
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Автообновление = Параметры.АвтоОбновление;
	ЭтотОбъект.ПериодАвтоОбновления = Параметры.ПериодАвтоОбновления;
	ИнтервалСекунд = 5;
	Если ЭтотОбъект.ПериодАвтоОбновления < ИнтервалСекунд Тогда
		ЭтотОбъект.ПериодАвтоОбновления = ИнтервалСекунд;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	ИнтервалСекунд = 5;
	Если ЭтотОбъект.ПериодАвтоОбновления < ИнтервалСекунд Тогда
		ЭтотОбъект.ПериодАвтоОбновления = ИнтервалСекунд;
	КонецЕсли;
	Результат = Новый Структура("АвтоОбновление, ПериодАвтоОбновления", АвтоОбновление, ЭтотОбъект.ПериодАвтоОбновления);
	Закрыть(Результат);
КонецПроцедуры
