#Область ПрограммныйИнтерфейс

// Обработать команду предназначенную для командной строки.
// 
// Параметры:
//  Команда - Строка - Переданная команда
// 
// Возвращаемое значение:
//  Массив из Строка - Токены команды
Функция ОбработатьКоманду(Знач Команда) Экспорт

	Токены = Новый Массив;
	ТекущийТокен = Новый Массив;
	ЧитаетсяТокен = Ложь;
	ПоследнийСимвол = СтрДлина(Команда);
	НомерСимвола = 1;
	Пока НомерСимвола <= ПоследнийСимвол Цикл

		ОбработатьСимволКоманды(Команда, ЧитаетсяТокен, ТекущийТокен, НомерСимвола, Токены, ПоследнийСимвол);

	КонецЦикла;
	ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
	Возврат Токены;

КонецФункции

// Возвращает испольняемую программу из вызываемой команды.
// 
// Параметры:
//  Команда - Строка - Вызываемая команда
//  		- Массив из Строка - Токены команды, см. ОбработатьКоманду
// 
// Возвращаемое значение:
//  Строка - Испольняемая программа
Функция ИсполняемаяПрограмма(Знач Команда) Экспорт

	Если ТипЗнч(Команда) = Тип("Строка") Тогда
		Токены = ОбработатьКоманду(Команда);
	Иначе
		Токены = Команда;
	КонецЕсли;

	Если Токены.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Передана пустая команда'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Возврат Токены[0];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСимволКоманды(Знач Команда, ЧитаетсяТокен, ТекущийТокен, НомерСимвола, Токены, Знач ПоследнийСимвол)

	Символ = Сред(Команда, НомерСимвола, 1);
	
	Если ОбработатьРазделительТокенов(Символ, Токены, ТекущийТокен, ЧитаетсяТокен, НомерСимвола) Тогда
		Возврат;
	КонецЕсли;

	Если ОбработатьКомментарий(Команда, ПоследнийСимвол, Символ, ЧитаетсяТокен, НомерСимвола) Тогда
		Возврат;
	КонецЕсли;

	Если ОбработатьОператор(Команда, Символ, Токены, ТекущийТокен, ЧитаетсяТокен, НомерСимвола) Тогда
		Возврат;
	КонецЕсли;

	Если ОбработатьОдинарныеКавычки(Команда, ТекущийТокен, Символ, ЧитаетсяТокен, НомерСимвола) Тогда
		Возврат;
	КонецЕсли;

	Если ОбработатьДвойныеКавычки(Команда, ТекущийТокен, Символ, ЧитаетсяТокен, НомерСимвола) Тогда
		Возврат;
	КонецЕсли;

	НомерСледующегоСимвола = НомерСимвола + 1;
	Если ОбработатьСимволДоллара(Команда,
								 ТекущийТокен,
								 Символ,
								 ПоследнийСимвол,
								 ЧитаетсяТокен,
								 НомерСимвола,
								 НомерСледующегоСимвола) Тогда
		Возврат;
	КонецЕсли;

	Если ОбработатьОбратныйСлэш(Команда,
								ТекущийТокен,
								Символ,
								ЧитаетсяТокен,
								НомерСимвола,
								НомерСледующегоСимвола,
								ПоследнийСимвол) Тогда
		Возврат;
	КонецЕсли;

	ТекущийТокен.Добавить(Символ);
	ЧитаетсяТокен = Истина;
	НомерСимвола = НомерСимвола + 1;
	
КонецПроцедуры

Функция ОбработатьРазделительТокенов(Символ, Токены, ТекущийТокен, ЧитаетсяТокен, НомерСимвола)
	Результат = Ложь;
	// Пробелы разделяют слова, если мы не внутри кавычек
	Если ЭтоРазделительТокенов(Символ) Тогда
		ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
		НомерСимвола = НомерСимвола + 1;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработатьКомментарий(Команда, Знач ПоследнийСимвол, Символ, ЧитаетсяТокен, НомерСимвола)
	Результат = Ложь;
	// Комментарий: если # стоит в начале слова
	Если ЭтоКомментарий(Символ, ЧитаетсяТокен) Тогда
		Пока НомерСимвола <= ПоследнийСимвол И Символ <> Символы.ПС Цикл
			НомерСимвола = НомерСимвола + 1;
			Символ = Сред(Команда, НомерСимвола, 1);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработатьОператор(Команда, Символ, Токены, ТекущийТокен, ЧитаетсяТокен, НомерСимвола)
	Результат = Ложь;
	Если ЭтоСимволОператора(Символ) Тогда
		Если ЧитаетсяТокен Тогда
			ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
		КонецЕсли;
		Оператор = ПрочитатьОператор(Команда, НомерСимвола);
		ДобавитьТокен(Токены, Оператор);
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработатьОдинарныеКавычки(Команда, ТекущийТокен, Знач Символ, ЧитаетсяТокен, НомерСимвола)
	Результат = Ложь;
	Если Символ = "'" Тогда
		НомерСимвола = НомерСимвола + 1;
		ЧастьТокена = РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола);
		ТекущийТокен.Добавить(ЧастьТокена);
		ЧитаетсяТокен = Истина;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработатьДвойныеКавычки(Команда, ТекущийТокен, Знач Символ, ЧитаетсяТокен, НомерСимвола)
	Результат = Ложь;
	Если Символ = """" Тогда
		НомерСимвола = НомерСимвола + 1;
		ЧастьТокена = РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола);
		ТекущийТокен.Добавить(ЧастьТокена);
		ЧитаетсяТокен = Истина;
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ОбработатьСимволДоллара(Команда, ТекущийТокен, Знач Символ, Знач ПоследнийСимвол, ЧитаетсяТокен, НомерСимвола,
	НомерСледующегоСимвола)

	Результат = Ложь;
	Если Символ = "$" И НомерСледующегоСимвола <= ПоследнийСимвол Тогда
		СледующийСимвол = Сред(Команда, НомерСледующегоСимвола, 1);
		// Конструкция $'...' в ANSI-C
		Если СледующийСимвол = "'" Тогда
			НомерСимвола = НомерСледующегоСимвола + 1;
			ЧастьТокена = РазобратьСтандартСиВКавычках(Команда, НомерСимвола);
			ТекущийТокен.Добавить(ЧастьТокена);
			ЧитаетсяТокен = Истина;
			Результат = Истина;
			Возврат Результат;
		КонецЕсли;
        	// $"..." locale-specific quoting.
	        // Locale translation не делаем, но кавычки разбираем.
		Если СледующийСимвол = """" Тогда
			НомерСимвола = НомерСледующегоСимвола + 1;
			ЧастьТокена = РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола);
			ТекущийТокен.Добавить(ЧастьТокена);
			ЧитаетсяТокен = Истина;
			Результат = Истина;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ОбработатьОбратныйСлэш(Знач Команда, ТекущийТокен, Символ, ЧитаетсяТокен, НомерСимвола, НомерСледующегоСимвола,
	Знач ПоследнийСимвол)
	
	Результат = Ложь;
	Если Символ = "\" Тогда
		Если НомерСледующегоСимвола > ПоследнийСимвол Тогда
			ТекущийТокен.Добавить(Символ);
			ЧитаетсяТокен = Истина;
			НомерСимвола = НомерСимвола + 1;
			Результат = Истина;
			Возврат Результат;
		КонецЕсли;

		СледующийСимвол = Сред(Команда, НомерСледующегоСимвола, 1);
		Если СледующийСимвол = Символы.ПС Тогда
			НомерСимвола = НомерСледующегоСимвола + 1;
			Результат = Истина;
			Возврат Результат;
		КонецЕсли;

		ТекущийТокен.Добавить(СледующийСимвол);
		ЧитаетсяТокен = Истина;
		НомерСимвола = НомерСледующегоСимвола + 1;
		Результат = Истина;
		Возврат Результат;

	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТокен(Токены, ДобавляемыйТокен, ЧитаетсяТокен = Ложь)

	Если ЧитаетсяТокен Тогда
		ЧитаетсяТокен = Ложь;
	КонецЕсли;
	Если ТипЗнч(ДобавляемыйТокен) = Тип("Массив") Тогда
		Токен = СтрСоединить(ДобавляемыйТокен, "");
		ДобавляемыйТокен.Очистить();
	Иначе
		Токен = ДобавляемыйТокен;
	КонецЕсли;
	Если Токен <> "" Тогда
		Токены.Добавить(Токен);
	КонецЕсли;

КонецПроцедуры

Функция ОператорыШелл()

	Операторы = Новый Массив;
	Операторы.Добавить("|");
	Операторы.Добавить("||");
	Операторы.Добавить("&");
	Операторы.Добавить("&&");
	Операторы.Добавить(";");
	Операторы.Добавить(";;");
	Операторы.Добавить("(");
	Операторы.Добавить(")");
	Операторы.Добавить("<");
	Операторы.Добавить(">");
	Операторы.Добавить("<<");
	Операторы.Добавить(">>");
	Операторы.Добавить("<&");
	Операторы.Добавить(">&");
	Операторы.Добавить("<>");
	Операторы.Добавить(">|");
	Возврат Операторы;

КонецФункции

Функция ПрочитатьОператор(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	Если НомерСимвола + 1 <= ПоследнийСимвол Тогда
		ДваСимвола = 2;
		ПроверочныеСимволы = Сред(Команда, НомерСимвола, ДваСимвола);
		ОператорыШелл = ОператорыШелл();
		Если ОператорыШелл.Найти(ПроверочныеСимволы) <> Неопределено Тогда
			НомерСимвола = НомерСимвола + ДваСимвола;
			Возврат ПроверочныеСимволы;
		КонецЕсли;
	КонецЕсли;
	Оператор = Сред(Команда, НомерСимвола, 1);
	НомерСимвола = НомерСимвола + 1;
	Возврат Оператор;

КонецФункции

Функция ЭтоРазделительТокенов(Символ)

	Результат = (Символ = Символы.ПС Или Символ = Символы.ВК Или Символ = Символы.Таб Или Символ = " ");
	Возврат Результат;

КонецФункции

Функция ЭтоСимволОператора(Символ)

	Результат = (СтрНайти("|&;()<>", Символ) > 0);
	Возврат Результат;

КонецФункции

Функция ЭтоКомментарий(Символ, ЧитаетсяТокен)

	Результат = (Символ = "#" И Не ЧитаетсяТокен);
	Возврат Результат;

КонецФункции

Функция РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	ЧастиТокена = Новый Массив;
	Пока НомерСимвола <= ПоследнийСимвол Цикл
		Символ = Сред(Команда, НомерСимвола, 1);
		Если Символ = "'" Тогда
			НомерСимвола = НомерСимвола + 1;
			Возврат СтрСоединить(ЧастиТокена, "");
		КонецЕсли;
		ЧастиТокена.Добавить(Символ);
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	ТекстОшибки = НСтр("ru = 'Не закрыта одинарная кавычка.'");
	ВызватьИсключение ТекстОшибки;

КонецФункции

Функция РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	ЧастиТокена = Новый Массив;
	Пока НомерСимвола <= ПоследнийСимвол Цикл
		Символ = Сред(Команда, НомерСимвола, 1);
		Если Символ = """" Тогда
			НомерСимвола = НомерСимвола + 1;
			Возврат СтрСоединить(ЧастиТокена, "");
		КонецЕсли;
		Если Символ = "\" Тогда
			Если НомерСимвола + 1 > ПоследнийСимвол Тогда
				ЧастиТокена.Добавить(Символ);
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;
			НомерСимвола = НомерСимвола + 1;
			СледующийСимвол = Сред(Команда, НомерСимвола, 1);
			Если СледующийСимвол = Символы.ПС Тогда
				// Перенос строки не учитывается в токене
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;

			ЭтоЭкранируемыйСимвол = (Символ = "$" Или Символ = "`" Или Символ = """" Или Символ = "\");
			Если ЭтоЭкранируемыйСимвол Тогда
				ЧастиТокена.Добавить(СледующийСимвол);
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;
			
			// Например "\a" внутри двойных кавычек остаётся "\a"
			ЧастиТокена.Добавить(Символ);
			ЧастиТокена.Добавить(СледующийСимвол);
			НомерСимвола = НомерСимвола + 1;
			Продолжить;
		КонецЕсли;
		ЧастиТокена.Добавить(Символ);
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	ТекстОшибки = НСтр("ru = 'Не закрыта двойная кавычка.'");
	ВызватьИсключение ТекстОшибки;

КонецФункции

// Разбирает значение в конструкции $'...' по ANSI-C в кавычках.
// 
// Параметры:
//  Команда - Строка - Команда в командной строке
//  НомерСимвола - Число - Номер текущего обрабатываемого символа в кавычках
// 
// Возвращаемое значение:
//  Строка - Разобрать стандарт си в кавычках
Функция РазобратьСтандартСиВКавычках(Команда, НомерСимвола)

	НеобработанныйТокен = РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола);
	Токен = РасшифроватьТокенСтандартаСи(НеобработанныйТокен);
	Возврат Токен;

КонецФункции

Функция РасшифроватьТокенСтандартаСи(СтрокаРасшифровки)

	ЧастиТокена = Новый Массив;
	ПоследнийСимвол = СтрДлина(СтрокаРасшифровки);
	НомерСимвола = 1;

	ШестнадцатеричныйКодСимволов = Новый Соответствие;
	КодЗвуковойСигнал = 7;
	ШестнадцатеричныйКодСимволов.Вставить("a", Символ(КодЗвуковойСигнал));
	КодВозвратНаОдинСимвол = 8;
	ШестнадцатеричныйКодСимволов.Вставить("b", Символ(КодВозвратНаОдинСимвол));
	КодРасширение = 27;
	ШестнадцатеричныйКодСимволов.Вставить("e", Символ(КодРасширение));
	ШестнадцатеричныйКодСимволов.Вставить("E", Символ(КодРасширение));
	КодНоваяСтраница = 12;
	ШестнадцатеричныйКодСимволов.Вставить("f", Символ(КодНоваяСтраница));
	КодПереводСтроки = 10;
	ШестнадцатеричныйКодСимволов.Вставить("n", Символ(КодПереводСтроки));
	КодВозвратКаретки = 13;
	ШестнадцатеричныйКодСимволов.Вставить("r", Символ(КодВозвратКаретки));
	КодТабуляция = 9;
	ШестнадцатеричныйКодСимволов.Вставить("t", Символ(КодТабуляция));
	КодВертикальнаяТабуляция = 11;
	ШестнадцатеричныйКодСимволов.Вставить("v", Символ(КодВертикальнаяТабуляция));
	ШестнадцатеричныйКодСимволов.Вставить("\\", "\");
	ШестнадцатеричныйКодСимволов.Вставить("'", "'");
	ШестнадцатеричныйКодСимволов.Вставить("""", """");
	ШестнадцатеричныйКодСимволов.Вставить("?", "?");

	Пока НомерСимвола <= ПоследнийСимвол Цикл

		Символ = Сред(СтрокаРасшифровки, НомерСимвола, 1);

		НомерСимвола = НомерСимвола + 1;
		Если Символ <> "\" Тогда
			ЧастиТокена.Добавить(Символ);
			Продолжить;
		КонецЕсли;

		Если НомерСимвола > ПоследнийСимвол Тогда
			ЧастиТокена.Добавить("\");
			Прервать;
		КонецЕсли;

		Символ = Сред(СтрокаРасшифровки, НомерСимвола, 1);
		НомерСимвола = НомерСимвола + 1;

		ВосьмеричнаяСистемаСчисления = КодВозвратНаОдинСимвол;
		ШестнадцатеричныйКодСимвола = ШестнадцатеричныйКодСимволов[Символ];
		Если ШестнадцатеричныйКодСимвола <> Неопределено Тогда
			ЧастиТокена.Добавить(ШестнадцатеричныйКодСимвола);
		ИначеЕсли Символ = "x" Тогда
			ОбработатьШестнадцатеричныеЦифрыИзДвухСимволов(СтрокаРасшифровки,
															 ПоследнийСимвол,
															 НомерСимвола,
															 ЧастиТокена);
		ИначеЕсли Символ = "u" Тогда
			ОбработатьШестнадцатеричныеЦифрыИзЧетырехСимволов(СтрокаРасшифровки,
															 ПоследнийСимвол,
															 НомерСимвола,
															 ЧастиТокена);
		ИначеЕсли Символ = "U" Тогда
			ОбработатьШестнадцатеричныеЦифрыИзВосьмиСимволов(СтрокаРасшифровки,
															НомерСимвола,
															ЧастиТокена,
															ПоследнийСимвол);
		ИначеЕсли ЭтотСимволПринадлежитСистемеСчисления(Символ, ВосьмеричнаяСистемаСчисления) Тогда
			ОбработатьВосьмеричныеЦифрыИзТрехСимволов(СтрокаРасшифровки,
													  НомерСимвола,
													  ЧастиТокена,
													  ВосьмеричнаяСистемаСчисления,
													  Символ,
													  ПоследнийСимвол);
		Иначе
			ЧастиТокена.Добавить(Символ);
		КонецЕсли;

	КонецЦикла;

	Результат = СтрСоединить(ЧастиТокена, "");
	Возврат Результат;

КонецФункции

Процедура ОбработатьШестнадцатеричныеЦифрыИзДвухСимволов(СтрокаРасшифровки, Знач ПоследнийСимвол, НомерСимвола,
	ЧастиТокена)
	
	ШестнадцатеричныеЦифры = "";
	СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	МаксимальноеКоличествоСимволов = 2;
	СистемаСчисления = 16;
	Пока НомерСимвола <= ПоследнийСимвол
		 И СтрДлина(ШестнадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
		 И ЭтотСимволПринадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
		НомерСимвола = НомерСимвола + 1;
		ШестнадцатеричныеЦифры = СтрШаблон("%1%2", ШестнадцатеричныеЦифры, СимволПроверки);
		СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	КонецЦикла;

	Если ЗначениеЗаполнено(ШестнадцатеричныеЦифры) Тогда
		ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШестнадцатеричныеЦифры, СистемаСчисления);
		ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
	Иначе
		ЧастиТокена.Добавить("\x");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьШестнадцатеричныеЦифрыИзЧетырехСимволов(СтрокаРасшифровки, Знач ПоследнийСимвол, НомерСимвола,
	ЧастиТокена)
	
	ШестнадцатеричныеЦифры = "";
	СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	МаксимальноеКоличествоСимволов = 4;
	СистемаСчисления = 16;
	Пока НомерСимвола <= ПоследнийСимвол
		 И СтрДлина(ШестнадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
		 И ЭтотСимволПринадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
		НомерСимвола = НомерСимвола + 1;
		ШестнадцатеричныеЦифры = СтрШаблон("%1%2", ШестнадцатеричныеЦифры, СимволПроверки);
		СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	КонецЦикла;

	Если СтрДлина(ШестнадцатеричныеЦифры) = МаксимальноеКоличествоСимволов Тогда
		ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШестнадцатеричныеЦифры, СистемаСчисления);
		ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
	Иначе
		ЧастиТокена.Добавить("\u");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьШестнадцатеричныеЦифрыИзВосьмиСимволов(СтрокаРасшифровки, НомерСимвола, ЧастиТокена,
	Знач ПоследнийСимвол)
	
	ШестнадцатеричныеЦифры = "";
	СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	МаксимальноеКоличествоСимволов = 8;
	СистемаСчисления = 16;
	Пока НомерСимвола <= ПоследнийСимвол
		 И СтрДлина(ШестнадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
		 И ЭтотСимволПринадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
		НомерСимвола = НомерСимвола + 1;
		ШестнадцатеричныеЦифры = СтрШаблон("%1%2", ШестнадцатеричныеЦифры, СимволПроверки);
		СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	КонецЦикла;

	Если СтрДлина(ШестнадцатеричныеЦифры) = МаксимальноеКоличествоСимволов Тогда
		ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШестнадцатеричныеЦифры, СистемаСчисления);
		ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
	Иначе
		ЧастиТокена.Добавить("\U");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВосьмеричныеЦифрыИзТрехСимволов(СтрокаРасшифровки, НомерСимвола, ЧастиТокена,
	ВосьмеричнаяСистемаСчисления, Знач Символ, Знач ПоследнийСимвол)

	СимволПроверки = Символ;
	ВосьмеричныеЦифры = СимволПроверки;
	МаксимальноеКоличествоСимволов = 3;
	Пока НомерСимвола <= ПоследнийСимвол
		 И СтрДлина(ВосьмеричныеЦифры) < МаксимальноеКоличествоСимволов
		 И ЭтотСимволПринадлежитСистемеСчисления(СимволПроверки, ВосьмеричнаяСистемаСчисления) Цикл
		НомерСимвола = НомерСимвола + 1;
		ВосьмеричныеЦифры = СтрШаблон("%1%2", ВосьмеричныеЦифры, СимволПроверки);
		СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
	КонецЦикла;
	ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ВосьмеричныеЦифры, ВосьмеричнаяСистемаСчисления);
	ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));

КонецПроцедуры

Функция ЭтотСимволПринадлежитСистемеСчисления(Знач Символ, СистемаСчисления)

	СимволыСистемыСчисления = СимволыСистемыСчисления(СистемаСчисления);
	Возврат (СтрНайти(СимволыСистемыСчисления, ВРег(Символ)) > 0);

КонецФункции

Функция СимволыСистемыСчисления(СистемаСчисления)

	МаксимальнаяСистемаСчисления = 36;
	Если СистемаСчисления > МаксимальнаяСистемаСчисления Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Нельзя указать систему счисления больше %1.'"),
								МаксимальнаяСистемаСчисления);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Шаблон = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СимволыСистемыСчисления = Лев(Шаблон, СистемаСчисления);
	Возврат СимволыСистемыСчисления;

КонецФункции

Функция ПеревестиЧислоВДесятичнуюСистемуСчисления(ЧислоСтрокой, СистемаСчисления)

	ЧислоСтрокой = ВРег(ЧислоСтрокой);
	СимволыСистемыСчисления = СимволыСистемыСчисления(СистемаСчисления);
	ДлинаШаблона = СтрДлина(СимволыСистемыСчисления);

	ДлинаСтроки = СтрДлина(ЧислоСтрокой);
	Результат = 0;

	Для ТекущийСимвол = 1 По ДлинаСтроки Цикл
		ОбрабатываемыйСимвол = Сред(ЧислоСтрокой, ТекущийСимвол, 1);
		ПозицияВШаблоне = СтрНайти(СимволыСистемыСчисления, ОбрабатываемыйСимвол) - 1;
		Результат = Результат * ДлинаШаблона + ПозицияВШаблоне;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти