#Область ПрограммныйИнтерфейс

// Обработать команду предназначенную для командной строки.
// 
// Параметры:
//  Команда - Строка - Переданная команда
// 
// Возвращаемое значение:
//  Массив из Строка - Токены команды
Функция ОбработатьКоманду(Знач Команда) Экспорт

	Токены = Новый Массив;
	ТекущийТокен = Новый Массив;
	ЧитаетсяТокен = Ложь;
	ПоследнийСимвол = СтрДлина(Команда);
	НомерСимвола = 1;
	Пока НомерСимвола <= ПоследнийСимвол Цикл

		Символ = Сред(Команда, НомерСимвола, 1);
		
		// Пробелы разделяют слова, если мы не внутри кавычек
		Если ЭтоРазделительТокенов(Символ) Тогда
			ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
			НомерСимвола = НомерСимвола + 1;
			Продолжить;
		КонецЕсли;
		
		// Комментарий: если # стоит в начале слова
		Если ЭтоКомментарий(Символ, ЧитаетсяТокен) Тогда
			Пока НомерСимвола <= ПоследнийСимвол И Символ <> Символы.ПС Цикл
				НомерСимвола = НомерСимвола + 1;
				Символ = Сред(Команда, НомерСимвола, 1);
			КонецЦикла;
			Продолжить;
		КонецЕсли;

		Если ЭтоСимволОператора(Символ) Тогда
			Если ЧитаетсяТокен Тогда
				ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
			КонецЕсли;
			Оператор = ПрочитатьОператор(Команда, НомерСимвола);
			ДобавитьТокен(Токены, Оператор);
			Продолжить;
		КонецЕсли;
		
		// Одинарные кавычки
		Если Символ = "'" Тогда
			НомерСимвола = НомерСимвола + 1;
			ЧастьТокена = РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола);
			ТекущийТокен.Добавить(ЧастьТокена);
			ЧитаетсяТокен = Истина;
			Продолжить;
		КонецЕсли;
		
		// Двойные кавычки
		Если Символ = """" Тогда
			НомерСимвола = НомерСимвола + 1;
			ЧастьТокена = РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола);
			ТекущийТокен.Добавить(ЧастьТокена);
			ЧитаетсяТокен = Истина;
			Продолжить;
		КонецЕсли;

		НомерСледущегоСимвола = НомерСимвола + 1;
		Если Символ = "$" И НомерСледущегоСимвола <= ПоследнийСимвол Тогда
			СледущийСимвол = Сред(Команда, НомерСледущегоСимвола, 1);
			// Конструкция $'...' в ANSI-C
			Если СледущийСимвол = "'" Тогда
				НомерСимвола = НомерСледущегоСимвола + 1;
				ЧастьТокена = РазобратьСтандартСиВКавычках(Команда, НомерСимвола);
				ТекущийТокен.Добавить(ЧастьТокена);
				ЧитаетсяТокен = Истина;
				Продолжить;
			КонецЕсли;
        	// $"..." locale-specific quoting.
	        // Locale translation не делаем, но кавычки разбираем.
			Если СледущийСимвол = """" Тогда
				НомерСимвола = НомерСледущегоСимвола + 1;
				ЧастьТокена = РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола);
				ТекущийТокен.Добавить(ЧастьТокена);
				ЧитаетсяТокен = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Если Символ = "\" Тогда
			Если НомерСледущегоСимвола > ПоследнийСимвол Тогда
				ТекущийТокен.Добавить(Символ);
				ЧитаетсяТокен = Истина;
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;

			СледущийСимвол = Сред(Команда, НомерСледущегоСимвола, 1);
			Если СледущийСимвол = Символы.ПС Тогда
				НомерСимвола = НомерСледущегоСимвола + 1;
				Продолжить;
			КонецЕсли;

			ТекущийТокен.Добавить(СледущийСимвол);
			ЧитаетсяТокен = Истина;
			НомерСимвола = НомерСледущегоСимвола + 1;
			Продолжить;

		КонецЕсли;

		ТекущийТокен.Добавить(Символ);
		ЧитаетсяТокен = Истина;
		НомерСимвола = НомерСимвола + 1;

	КонецЦикла;
	ДобавитьТокен(Токены, ТекущийТокен, ЧитаетсяТокен);
	Возврат Токены;

КонецФункции

// Возвращает испольняемую программу из вызываемой команды.
// 
// Параметры:
//  Команда - Строка - Вызываемая команда
//  		- Массив из Строка - Токены команды, см. ОбработатьКоманду
// 
// Возвращаемое значение:
//  Строка - Испольняемая программа
Функция ИспольняемаяПрограмма(Знач Команда) Экспорт

	Если ТипЗнч(Команда) = Тип("Строка") Тогда
		Токены = ОбработатьКоманду(Команда);
	Иначе
		Токены = Команда;
	КонецЕсли;

	Если Токены.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Передана пустая команда'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Возврат Токены[0];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТокен(Токены, ДобавляемыйТокен, ЧитаетсяТокен = Ложь)

	Если ЧитаетсяТокен Тогда
		ЧитаетсяТокен = Ложь;
	КонецЕсли;
	Если ТипЗнч(ДобавляемыйТокен) = Тип("Массив") Тогда
		Токен = СтрСоединить(ДобавляемыйТокен, "");
		ДобавляемыйТокен.Очистить();
	Иначе
		Токен = ДобавляемыйТокен;
	КонецЕсли;
	Если Токен <> "" Тогда
		Токены.Добавить(Токен);
	КонецЕсли;

КонецПроцедуры

Функция ОператорыШелл()

	Операторы = Новый Массив;
	Операторы.Добавить("|");
	Операторы.Добавить("||");
	Операторы.Добавить("&");
	Операторы.Добавить("&&");
	Операторы.Добавить(";");
	Операторы.Добавить(";;");
	Операторы.Добавить("(");
	Операторы.Добавить(")");
	Операторы.Добавить("<");
	Операторы.Добавить(">");
	Операторы.Добавить("<<");
	Операторы.Добавить(">>");
	Операторы.Добавить("<&");
	Операторы.Добавить(">&");
	Операторы.Добавить("<>");
	Операторы.Добавить(">|");
	Возврат Операторы;

КонецФункции

Функция ПрочитатьОператор(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	Если НомерСимвола + 1 <= ПоследнийСимвол Тогда
		ДваСимвола = 2;
		ПроверочныеСимволы = Сред(Команда, НомерСимвола, 2);
		ОператорыШелл = ОператорыШелл();
		Если ОператорыШелл.Найти(ПроверочныеСимволы) <> Неопределено Тогда
			НомерСимвола = НомерСимвола + ДваСимвола;
			Возврат ПроверочныеСимволы;
		КонецЕсли;
	КонецЕсли;
	Оператор = Сред(Команда, НомерСимвола, 1);
	НомерСимвола = НомерСимвола + 1;
	Возврат Оператор;

КонецФункции

Функция ЭтоРазделительТокенов(Символ)

	Результат = (Символ = Символы.ПС Или Символ = Символы.ВК Или Символ = Символы.Таб Или Символ = " ");
	Возврат Результат;

КонецФункции

Функция ЭтоСимволОператора(Символ)

	Результат = (СтрНайти("|&;()<>", Символ) > 0);
	Возврат Результат;

КонецФункции

Функция ЭтоКомментарий(Символ, ЧитаетсяТокен)

	Результат = (Символ = "#" И Не ЧитаетсяТокен);
	Возврат Результат;

КонецФункции

Функция РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	ЧастиТокена = Новый Массив;
	Пока НомерСимвола <= ПоследнийСимвол Цикл
		Символ = Сред(Команда, НомерСимвола, 1);
		Если Символ = "'" Тогда
			НомерСимвола = НомерСимвола + 1;
			Возврат СтрСоединить(ЧастиТокена, "");
		КонецЕсли;
		ЧастиТокена.Добавить(Символ);
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	ТекстОшибки = НСтр("ru = 'Не закрыта одинарная кавычка.'");
	ВызватьИсключение ТекстОшибки;

КонецФункции

Функция РазобратьТокенВДвойныхКавычках(Команда, НомерСимвола)

	ПоследнийСимвол = СтрДлина(Команда);
	ЧастиТокена = Новый Массив;
	Пока НомерСимвола <= ПоследнийСимвол Цикл
		Символ = Сред(Команда, НомерСимвола, 1);
		Если Символ = """" Тогда
			НомерСимвола = НомерСимвола + 1;
			Возврат СтрСоединить(ЧастиТокена, "");
		КонецЕсли;
		Если Символ = "\" Тогда
			Если НомерСимвола + 1 > ПоследнийСимвол Тогда
				ЧастиТокена.Добавить(Символ);
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;
			НомерСимвола = НомерСимвола + 1;
			СледущийСимвол = Сред(Команда, НомерСимвола, 1);
			Если СледущийСимвол = Символы.ПС Тогда
				// Перенос строки не учитывается в токене
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;

			ЭтоЭкранируемыйСимвол = (Символ = "$" Или Символ = "`" Или Символ = """" Или Символ = "\");
			Если ЭтоЭкранируемыйСимвол Тогда
				ЧастиТокена.Добавить(СледущийСимвол);
				НомерСимвола = НомерСимвола + 1;
				Продолжить;
			КонецЕсли;
			
			// Например "\a" внутри двойных кавычек остаётся "\a"
			ЧастиТокена.Добавить(Символ);
			ЧастиТокена.Добавить(СледущийСимвол);
			НомерСимвола = НомерСимвола + 1;
			Продолжить;
		КонецЕсли;
		ЧастиТокена.Добавить(Символ);
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	ТекстОшибки = НСтр("ru = 'Не закрыта двойная кавычка.'");
	ВызватьИсключение ТекстОшибки;

КонецФункции

// Разбирает значение в конструкции $'...' по ANSI-C в кавычках.
// 
// Параметры:
//  Команда - Строка - Команда в командной строке
//  НомерСимвола - Число - Номер текущего обрабатываемого символа в кавычках
// 
// Возвращаемое значение:
//  Строка - Разобрать стандарт си в кавычках
Функция РазобратьСтандартСиВКавычках(Команда, НомерСимвола)

	НеобработанныйТокен = РазобратьТокенВОдинарныхКавычках(Команда, НомерСимвола);
	Токен = РасшифроватьТокенСтандартаСи(НеобработанныйТокен);
	Возврат Токен;

КонецФункции

Функция РасшифроватьТокенСтандартаСи(СтрокаРасшифровки)

	ЧастиТокена = Новый Массив;
	ПоследнийСимвол = СтрДлина(СтрокаРасшифровки);
	НомерСимвола = 1;

	ШеснадцатеричнойКодСимволов = Новый Соответствие;
	ШеснадцатеричнойКодСимволов.Вставить("a", Символ(7));
	ШеснадцатеричнойКодСимволов.Вставить("b", Символ(8));
	ШеснадцатеричнойКодСимволов.Вставить("e", Символ(27));
	ШеснадцатеричнойКодСимволов.Вставить("E", Символ(27));
	ШеснадцатеричнойКодСимволов.Вставить("f", Символ(12));
	ШеснадцатеричнойКодСимволов.Вставить("n", Символ(10));
	ШеснадцатеричнойКодСимволов.Вставить("r", Символ(13));
	ШеснадцатеричнойКодСимволов.Вставить("t", Символ(9));
	ШеснадцатеричнойКодСимволов.Вставить("v", Символ(11));
	ШеснадцатеричнойКодСимволов.Вставить("\\", "\");
	ШеснадцатеричнойКодСимволов.Вставить("'", "'");
	ШеснадцатеричнойКодСимволов.Вставить("""", """");
	ШеснадцатеричнойКодСимволов.Вставить("?", "?");

	Пока НомерСимвола <= ПоследнийСимвол Цикл

		Символ = Сред(СтрокаРасшифровки, НомерСимвола, 1);

		НомерСимвола = НомерСимвола + 1;
		Если Символ <> "\" Тогда
			ЧастиТокена.Добавить(Символ);
			Продолжить;
		КонецЕсли;

		Если НомерСимвола > ПоследнийСимвол Тогда
			ЧастиТокена.Добавить("\");
			Прервать;
		КонецЕсли;

		Символ = Сред(СтрокаРасшифровки, НомерСимвола, 1);
		НомерСимвола = НомерСимвола + 1;

		ВосьмеричнаяСистемаСчисления = 8;
		ШеснадцатеричнойКодСимвола = ШеснадцатеричнойКодСимволов[Символ];
		Если ШеснадцатеричнойКодСимвола <> Неопределено Тогда
			ЧастиТокена.Добавить(ШеснадцатеричнойКодСимвола);
		ИначеЕсли Символ = "x" Тогда
			ШеснадцатеричныеЦифры = "";
			СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			МаксимальноеКоличествоСимволов = 2;
			СистемаСчисления = 16;
			Пока НомерСимвола <= ПоследнийСимвол
				 И СтрДлина(ШеснадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
				 И ЭтоСимволПренадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
				НомерСимвола = НомерСимвола + 1;
				ШеснадцатеричныеЦифры = СтрШаблон("%1%2", ШеснадцатеричныеЦифры, СимволПроверки);
				СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			КонецЦикла;

			Если ЗначениеЗаполнено(ШеснадцатеричныеЦифры) Тогда
				ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШеснадцатеричныеЦифры, СистемаСчисления);
				ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
			Иначе
				ЧастиТокена.Добавить("\x");
			КонецЕсли;

		ИначеЕсли Символ = "u" Тогда
			ШеснадцатеричныеЦифры = "";
			СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			МаксимальноеКоличествоСимволов = 4;
			СистемаСчисления = 16;
			Пока НомерСимвола <= ПоследнийСимвол
				 И СтрДлина(ШеснадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
				 И ЭтоСимволПренадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
				НомерСимвола = НомерСимвола + 1;
				ШеснадцатеричныеЦифры = СтрШаблон("%1%2", ШеснадцатеричныеЦифры, СимволПроверки);
				СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			КонецЦикла;

			Если СтрДлина(ШеснадцатеричныеЦифры) = МаксимальноеКоличествоСимволов Тогда
				ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШеснадцатеричныеЦифры, СистемаСчисления);
				ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
			Иначе
				ЧастиТокена.Добавить("\u");
			КонецЕсли;
		ИначеЕсли Символ = "U" Тогда
			ШеснадцатеричныеЦифры = "";
			СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			МаксимальноеКоличествоСимволов = 8;
			СистемаСчисления = 16;
			Пока НомерСимвола <= ПоследнийСимвол
				 И СтрДлина(ШеснадцатеричныеЦифры) < МаксимальноеКоличествоСимволов
				 И ЭтоСимволПренадлежитСистемеСчисления(СимволПроверки, СистемаСчисления) Цикл
				НомерСимвола = НомерСимвола + 1;
				ШеснадцатеричныеЦифры = СтрШаблон("%1%2", ШеснадцатеричныеЦифры, СимволПроверки);
				СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			КонецЦикла;

			Если СтрДлина(ШеснадцатеричныеЦифры) = МаксимальноеКоличествоСимволов Тогда
				ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ШеснадцатеричныеЦифры, СистемаСчисления);
				ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
			Иначе
				ЧастиТокена.Добавить("\U");
			КонецЕсли;
		ИначеЕсли ЭтоСимволПренадлежитСистемеСчисления(Символ, ВосьмеричнаяСистемаСчисления) Тогда
			СимволПроверки = Символ;
			ВосьмеричнныеЦифры = СимволПроверки;
			МаксимальноеКоличествоСимволов = 3;
			Пока НомерСимвола <= ПоследнийСимвол
				 И СтрДлина(ВосьмеричнныеЦифры) < МаксимальноеКоличествоСимволов
				 И ЭтоСимволПренадлежитСистемеСчисления(СимволПроверки, ВосьмеричнаяСистемаСчисления) Цикл
				НомерСимвола = НомерСимвола + 1;
				ВосьмеричнныеЦифры = СтрШаблон("%1%2", ВосьмеричнныеЦифры, СимволПроверки);
				СимволПроверки = Сред(СтрокаРасшифровки, НомерСимвола, 1);
			КонецЦикла;
			ЧислоВДесятичной = ПеревестиЧислоВДесятичнуюСистемуСчисления(ВосьмеричнныеЦифры,
																		 ВосьмеричнаяСистемаСчисления);
			ЧастиТокена.Добавить(Символ(ЧислоВДесятичной));
		Иначе
			ЧастиТокена.Добавить(Символ);
		КонецЕсли;

	КонецЦикла;

	Результат = СтрСоединить(ЧастиТокена, "");
	Возврат Результат;

КонецФункции

Функция ЭтоСимволПренадлежитСистемеСчисления(Знач Символ, СистемаСчисления)

	СимволыСистемыСчисления = СимволыСистемыСчисления(СистемаСчисления);
	Возврат (СтрНайти(СимволыСистемыСчисления, ВРег(Символ)) > 0);

КонецФункции

Функция СимволыСистемыСчисления(СистемаСчисления)

	Если СистемаСчисления > 36 Тогда
		ТекстОшибки = НСтр("ru = 'Нельзя указать систему счисления больше 36.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Шаблон = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СимволыСистемыСчисления = Лев(Шаблон, СистемаСчисления);
	Возврат СимволыСистемыСчисления;

КонецФункции

Функция ПеревестиЧислоВДесятичнуюСистемуСчисления(ЧислоСтрокой, СистемаСчисления)

	ЧислоСтрокой = ВРег(ЧислоСтрокой);
	СимволыСистемыСчисления = СимволыСистемыСчисления(СистемаСчисления);
	ДлинаШаблона = СтрДлина(СимволыСистемыСчисления);

	ДлинаСтроки = СтрДлина(ЧислоСтрокой);
	Результат = 0;

	Для ТекущийСимвол = 1 По ДлинаСтроки Цикл
		ОбрабатываемыйСимвол = Сред(ЧислоСтрокой, ТекущийСимвол, 1);
		ПозицияВШаблоне = СтрНайти(СимволыСистемыСчисления, ОбрабатываемыйСимвол) - 1;
		Результат = Результат * ДлинаШаблона + ПозицияВШаблоне;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти