#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мОбъектСсылка = Параметры.мОбъектСсылка;

	_ПолноеИмя = Параметры.ПолноеИмя;
	_ГдеНайдено = Параметры.ГдеНайдено;
	_ОграничениеНаСписокЗависимых = Параметры.ОграничениеНаСписокЗависимых;

	Результат = вСформироватьТекстЗапросаДляСпискаЗависимых(мОбъектСсылка,
														 _ПолноеИмя,
														 _ГдеНайдено,
														 _ОграничениеНаСписокЗависимых);
	Если Результат = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	АдресОбщихРеквизитов = Параметры.АдресОбщихРеквизитов;
	Если ПустаяСтрока(АдресОбщихРеквизитов) Тогда
		УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
	КонецЕсли;

	_КлючЗаписи = Результат.КлючЗаписи;
	_ТекстЗапроса = Результат.ТекстЗапроса;
	ТаблицаДанных = Результат.ТаблицаДанных;

	Заголовок = СтрШаблон(НСтр("ru = 'Зависимые: %1'"), Параметры.ПолноеИмя);

	Элементы._ДеревоОбъектов.Видимость = Ложь;

	ТипUUID = Тип("УникальныйИдентификатор");

	МассивКСозданию = Новый Массив;
	МассивКУдалению = Новый Массив;

	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			Если Колонка.ТипЗначения.СодержитТип(ТипUUID) Тогда
				ТипЗначенияРеквизита = Новый ОписаниеТипов;
			Иначе
				ТипЗначенияРеквизита = Колонка.ТипЗначения;
			КонецЕсли;
			МассивКСозданию.Добавить(Новый РеквизитФормы(Колонка.Имя, ТипЗначенияРеквизита, "_СписокЗаписей",
				Колонка.Заголовок, Ложь));
		КонецЦикла;

		ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
		ЗначениеВРеквизитФормы(ТаблицаДанных, "_СписокЗаписей");
		_ЧислоЗаписей = ТаблицаДанных.Количество();

		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			Элем = Элементы.Добавить("_СписокЗаписей_" + Колонка.Имя, Тип("ПолеФормы"), Элементы._СписокЗаписей);
			Элем.ПутьКДанным="_СписокЗаписей." + Колонка.Имя;
			Элем.Вид=ВидПоляФормы.ПолеВвода;
			Элем.ДоступныеТипы=Колонка.ТипЗначения;
			Элем.КнопкаОткрытия = Истина;
		КонецЦикла;

		Если _КлючЗаписи = Неопределено Тогда
			Элементы._СписокЗаписей_ОткрытьЗаписьРегистра.Видимость = Ложь;
			Элементы._СписокЗаписейКонтекстноеМеню_ОткрытьЗаписьРегистра.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ТаблицаДанных) = Тип("ДеревоЗначений") Тогда
		Элементы._ДеревоОбъектов.Видимость = Истина;
		ЗначениеВРеквизитФормы(ТаблицаДанных, "_ДеревоОбъектов");
		_ЧислоЗаписей = ТаблицаДанных.Строки.Количество();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура _ОграничениеНаСписокЗависимыхПриИзменении(Элемент)
	_ТекстЗапроса = "";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _ОткрытьЗаписьРегистра(Команда)
	ТекущиеДанные = Элементы._СписокЗаписей.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(_КлючЗаписи, ТекущиеДанные);
		КлючЗаписи = вСоздатьКлючЗаписи(_ПолноеИмя, _КлючЗаписи);
		ПоказатьЗначение( , КлючЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _Обновить(Команда)
	_ДеревоОбъектов.ПолучитьЭлементы().Очистить();
	_СписокЗаписей.Очистить();

	вОбновить();
КонецПроцедуры

&НаКлиенте
Процедура _ПоказатьТекстЗапроса(Команда)
	Если Не ПустаяСтрока(_ТекстЗапроса) Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(_ТекстЗапроса);
		ТекстовыйДокумент.Показать(НСтр("ru = 'Текст запроса для зависимых'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьОбъект(Команда)
	вОткрытьОбъектВФорме(Истина);
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьОбъектСтандартно(Команда)
	вОткрытьОбъектВФорме(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура вОбновить()
	_ДеревоОбъектов.ПолучитьЭлементы().Очистить();
	_СписокЗаписей.Очистить();

	Результат = вСформироватьТекстЗапросаДляСпискаЗависимых(мОбъектСсылка,
														 _ПолноеИмя,
														 _ГдеНайдено,
														 _ОграничениеНаСписокЗависимых,
														 _ТекстЗапроса);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	_ТекстЗапроса = Результат.ТекстЗапроса;
	ТаблицаДанных = Результат.ТаблицаДанных;

	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		ЗначениеВРеквизитФормы(ТаблицаДанных, "_СписокЗаписей");
		_ЧислоЗаписей = ТаблицаДанных.Количество();
	ИначеЕсли ТипЗнч(ТаблицаДанных) = Тип("ДеревоЗначений") Тогда
		ЗначениеВРеквизитФормы(ТаблицаДанных, "_ДеревоОбъектов");
		_ЧислоЗаписей = ТаблицаДанных.Строки.Количество();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция вСформироватьТекстЗапросаДляСпискаЗависимых(Знач Ссылка, Знач ПолноеИмя, Знач ГдеНайдено, Знач РазмерСписка,
		Знач ТекстЗапроса = "")
	Если СтрНайти(ПолноеИмя, "ПараметрСеанса") = 1 Тогда
		Возврат Неопределено;
	ИначеЕсли СтрНайти(ПолноеИмя, "ОпределяемыйТип") = 1 Тогда
		Возврат Неопределено;
	ИначеЕсли СтрНайти(ПолноеИмя, "Константа") = 1 Тогда
		Возврат Неопределено;
	ИначеЕсли СтрНайти(ПолноеИмя, "РегистрБухгалтерии") = 1 Тогда
		Возврат вСформироватьТекстЗапросаДляСпискаЗависимыхПоРегиструБухгалтерии(Ссылка,
																				 ПолноеИмя,
																				 ГдеНайдено,
																				 РазмерСписка,
																				 ТекстЗапроса);
	ИначеЕсли СтрНайти(ПолноеИмя, "Регистр") = 1 Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
			Если ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
				Возврат вСформироватьТекстЗапросаДляСпискаЗависимыхПоНРС(Ссылка,
																		 ПолноеИмя,
																		 ГдеНайдено,
																		 РазмерСписка,
																		 ТекстЗапроса);
			КонецЕсли;
		КонецЕсли;

		Возврат вСформироватьТекстЗапросаДляСпискаЗависимыхПоРегистру(Ссылка,
																	  ПолноеИмя,
																	  ГдеНайдено,
																	  РазмерСписка,
																	  ТекстЗапроса);
	Иначе
		Возврат вСформироватьТекстЗапросаДляСпискаЗависимыхОбъектов(Ссылка,
																	ПолноеИмя,
																	ГдеНайдено,
																	РазмерСписка,
																	ТекстЗапроса);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция вСформироватьТекстЗапросаДляСпискаЗависимыхОбъектов(Знач Ссылка, Знач ПолноеИмя, Знач ГдеНайдено,
	Знач РазмерСписка, Знач ТекстЗапроса = "")
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = ТекстЗапроса;
		Перейти ~ВыпонитьЗапрос;
	КонецЕсли;

	ЭтоПланОбмена = (СтрНайти(ПолноеИмя, "ПланОбмена.") = 1);

	ОграничениеНаРазмер = ?(РазмерСписка = 0, "", " ПЕРВЫЕ " + Формат(РазмерСписка, "ЧГ=0"));

	МассивЗапросов = Новый Массив;
	МассивРеквизитов = СтрРазделить(ГдеНайдено, ",");

	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;

	Для Каждого пРеквизит Из МассивРеквизитов Цикл
		пМассив = СтрРазделить(пРеквизит, ".");
		пЭтоТабЧасть = (пМассив.Количество() = 4);

		Если ЭтоПланОбмена Тогда
			Если пМассив[1] = "Состав" Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Если пЭтоТабЧасть Тогда
				пПоле = пМассив[3];
				пИмяПоля = пМассив[1] + "." + пПоле;
				пИмяТаблицы = ПолноеИмя + "." + пМассив[1];
			Иначе
				пПоле = пМассив[2];
				пИмяПоля = пПоле;
				пИмяТаблицы = ПолноеИмя;
			КонецЕсли;
		КонецЕсли;

		МассивЗапросов.Добавить("ВЫБРАТЬ"
								 + ОграничениеНаРазмер
								 + "
								   |	т.Ссылка,
								   |	"""
								 + пИмяПоля
								 + """ КАК Поле
								   |ИЗ
								   |	"
								 + пИмяТаблицы
								 + " КАК т
								   |ГДЕ
								   |	т."
								 + пПоле
								 + " = &Ссылка");
	КонецЦикла;

	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(МассивЗапросов, Разделитель);

	Если МассивЗапросов.Количество() > 1 Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	т.Ссылка КАК Ссылка,
						|	т.Поле КАК Поле
						|ИЗ (
						|" + ТекстЗапроса + "
											 |) КАК т";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса + "
								   |ИТОГИ
								   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Поле)
								   |ПО
								   |	Ссылка";
	
	~ВыпонитьЗапрос: пТабРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	Возврат Новый Структура("КлючЗаписи, ТаблицаДанных, ТекстЗапроса", Неопределено, пТабРезультат, Запрос.Текст);
КонецФункции

&НаСервереБезКонтекста
Функция вСформироватьТекстЗапросаДляСпискаЗависимыхПоНРС(Знач Ссылка, Знач ПолноеИмя, Знач ГдеНайдено,
		Знач РазмерСписка, Знач ТекстЗапроса = "")
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = ТекстЗапроса;
		Перейти ~ВыпонитьЗапрос;
	КонецЕсли;

	КлючиЗаписи = Новый Структура;
	МассивИзмерений = Новый Массив;

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	ЕстьПериод = (ОбъектМетаданных.ПериодичностьРегистраСведений
				   <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
	Если ЕстьПериод Тогда
		МассивИзмерений.Добавить("т.Период");
		КлючиЗаписи.Вставить("Период");
	КонецЕсли;

	Для Каждого Элем Из ОбъектМетаданных.Измерения Цикл
		МассивИзмерений.Добавить("т." + Элем.Имя);
		КлючиЗаписи.Вставить(Элем.Имя);
	КонецЦикла;

	Если МассивИзмерений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ОграничениеНаРазмер = ?(РазмерСписка = 0, "", " ПЕРВЫЕ " + Формат(РазмерСписка, "ЧГ=0"));

	МассивЗапросов = Новый Массив;
	МассивРеквизитов = СтрРазделить(ГдеНайдено, ",");

	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;

	Для Каждого пРеквизит Из МассивРеквизитов Цикл
		пМассив = СтрРазделить(пРеквизит, ".");
		пПоле = пМассив[2];
		МассивЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ"
								 + ОграничениеНаРазмер
								 + "
								   |	"
								 + СтрСоединить(МассивИзмерений, "," + Символы.ПС + Символы.Таб)
								 + "
								   |ИЗ
								   |	"
								 + ПолноеИмя
								 + " КАК т
								   |ГДЕ
								   |	т."
								 + пПоле
								 + " = &Ссылка");
	КонецЦикла;

	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(МассивЗапросов, Разделитель);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;

	~ВыпонитьЗапрос: пТабРезультат = Запрос.Выполнить().Выгрузить();

	Возврат Новый Структура("КлючЗаписи, ТаблицаДанных, ТекстЗапроса", КлючиЗаписи, пТабРезультат, Запрос.Текст);
КонецФункции

&НаСервереБезКонтекста
Функция вСформироватьТекстЗапросаДляСпискаЗависимыхПоРегистру(Знач Ссылка, Знач ПолноеИмя, Знач ГдеНайдено,
		Знач РазмерСписка, Знач ТекстЗапроса = "")
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = ТекстЗапроса;
		Перейти ~ВыпонитьЗапрос;
	КонецЕсли;

	МассивИзмерений = Новый Массив;

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	ЕстьПериод = Не Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных);
	Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
		 И ОбъектМетаданных.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		ЕстьПериод = Ложь;
	КонецЕсли;

	Если ЕстьПериод Тогда
		МассивИзмерений.Добавить("т.Период");
	КонецЕсли;

	Если Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		МассивИзмерений.Добавить("т.ПериодРегистрации");
		МассивИзмерений.Добавить("т.Сторно");
	КонецЕсли;

	МассивИзмерений.Добавить("т.Регистратор");
	МассивИзмерений.Добавить("т.НомерСтроки");

	Для Каждого Элем Из ОбъектМетаданных.Измерения Цикл
		МассивИзмерений.Добавить("т." + Элем.Имя);
	КонецЦикла;

	ОграничениеНаРазмер = ?(РазмерСписка = 0, "", " ПЕРВЫЕ " + Формат(РазмерСписка, "ЧГ=0"));

	МассивЗапросов = Новый Массив;
	МассивРеквизитов = СтрРазделить(ГдеНайдено, ",");

	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;

	Для Каждого пРеквизит Из МассивРеквизитов Цикл
		пМассив = СтрРазделить(пРеквизит, ".");
		пПоле = пМассив[2];
		МассивЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ"
								 + ОграничениеНаРазмер
								 + "
								   |	"
								 + СтрСоединить(МассивИзмерений, "," + Символы.ПС + Символы.Таб)
								 + "
								   |ИЗ
								   |	"
								 + ПолноеИмя
								 + " КАК т
								   |ГДЕ
								   |	т."
								 + пПоле
								 + " = &Ссылка");
	КонецЦикла;

	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(МассивЗапросов, Разделитель);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;

	~ВыпонитьЗапрос: пТабРезультат = Запрос.Выполнить().Выгрузить();

	Возврат Новый Структура("КлючЗаписи, ТаблицаДанных, ТекстЗапроса", Неопределено, пТабРезультат, Запрос.Текст);
КонецФункции

&НаСервереБезКонтекста
Функция вСформироватьТекстЗапросаДляСпискаЗависимыхПоРегиструБухгалтерии(Знач Ссылка, Знач ПолноеИмя,
		Знач ГдеНайдено, Знач РазмерСписка, Знач ТекстЗапроса = "")
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = ТекстЗапроса;
		Перейти ~ВыпонитьЗапрос;
	КонецЕсли;

	МассивИзмерений = Новый Массив;

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	ЕстьКорреспонденция = ОбъектМетаданных.Корреспонденция;

	НебалансовыеПоля = Новый Соответствие;

	МассивИзмерений.Добавить("т.Период");
	МассивИзмерений.Добавить("т.Регистратор");
	МассивИзмерений.Добавить("т.НомерСтроки");

	Для Каждого Элем Из ОбъектМетаданных.Измерения Цикл
		Если ЕстьКорреспонденция И Не Элем.Балансовый Тогда
			НебалансовыеПоля[Элем.Имя] = 1;
			МассивИзмерений.Добавить("т." + Элем.Имя + "Дт");
			МассивИзмерений.Добавить("т." + Элем.Имя + "Кт");
		Иначе
			МассивИзмерений.Добавить("т." + Элем.Имя);
		КонецЕсли;
	КонецЦикла;

	Если ЕстьКорреспонденция Тогда
		МассивИзмерений.Добавить("т.СчетДт");
		МассивИзмерений.Добавить("т.СчетКт");

		НебалансовыеПоля["Счет"] = 1;
		Для Каждого Элем Из ОбъектМетаданных.Ресурсы Цикл
			Если Не Элем.Балансовый Тогда
				НебалансовыеПоля[Элем.Имя] = 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивИзмерений.Добавить("т.Счет");
	КонецЕсли;

	ОграничениеНаРазмер = ?(РазмерСписка = 0, "", " ПЕРВЫЕ " + Формат(РазмерСписка, "ЧГ=0"));

	МассивЗапросов = Новый Массив;
	МассивРеквизитов = СтрРазделить(ГдеНайдено, ",");

	Разделитель = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;

	Для Каждого пРеквизит Из МассивРеквизитов Цикл
		пМассив = СтрРазделить(пРеквизит, ".");
		пПоле = пМассив[2];
		Если НебалансовыеПоля[пПоле] = 1 Тогда
			МассивЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ"
									 + ОграничениеНаРазмер
									 + "
									   |	"
									 + СтрСоединить(МассивИзмерений, "," + Символы.ПС + Символы.Таб)
									 + "
									   |ИЗ
									   |	"
									 + ПолноеИмя
									 + " КАК т
									   |ГДЕ
									   |	(т."
									 + пПоле
									 + "Дт = &Ссылка или т."
									 + пПоле
									 + "Кт = &Ссылка)");
		Иначе
			МассивЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ"
									 + ОграничениеНаРазмер
									 + "
									   |	"
									 + СтрСоединить(МассивИзмерений, "," + Символы.ПС + Символы.Таб)
									 + "
									   |ИЗ
									   |	"
									 + ПолноеИмя
									 + " КАК т
									   |ГДЕ
									   |	т."
									 + пПоле
									 + " = &Ссылка");
		КонецЕсли;
	КонецЦикла;

	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(МассивЗапросов, Разделитель);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;

	~ВыпонитьЗапрос: пТабРезультат = Запрос.Выполнить().Выгрузить();

	Возврат Новый Структура("КлючЗаписи, ТаблицаДанных, ТекстЗапроса", Неопределено, пТабРезультат, Запрос.Текст);
КонецФункции

&НаСервереБезКонтекста
Функция вСоздатьКлючЗаписи(Знач ПолноеИмя, Знач КлючЗаписи)
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		МененджерОбъекта = РегистрыСведений[ОбъектМетаданных.Имя];
	ИначеЕсли
	Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		МененджерОбъекта = РегистрыНакопления[ОбъектМетаданных.Имя];
	ИначеЕсли
	Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		МененджерОбъекта = РегистрыБухгалтерии[ОбъектМетаданных.Имя];
	ИначеЕсли
	Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		МененджерОбъекта = РегистрыРасчета[ОбъектМетаданных.Имя];
	КонецЕсли
	;

	Возврат МененджерОбъекта.СоздатьКлючЗаписи(КлючЗаписи);
КонецФункции

&НаКлиенте
Процедура вОткрытьОбъектВФорме(Знач ИспользоватьИнструмент = Истина)
	ЭлементФормы = ТекущийЭлемент;

	Если ЭлементФормы.Имя = "_ДеревоОбъектов" Тогда
		ТекущиеДанные = Элементы._ДеревоОбъектов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			вОткрытьОбъект(ТекущиеДанные.Ссылка, ИспользоватьИнструмент);
		КонецЕсли;
	ИначеЕсли ЭлементФормы.Имя = "_СписокЗаписей" Тогда
		ТекущиеДанные = Элементы._СписокЗаписей.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПолеФормы = ЭлементФормы.ТекущийЭлемент;
			ИмяПоля = Сред(ПолеФормы.Имя, СтрДлина("_СписокЗаписей_") + 1);
			Значение = ТекущиеДанные[ИмяПоля];

			Если ЗначениеЗаполнено(Значение) И вЭтоОбъектМетаданных(ТипЗнч(Значение)) Тогда
				вОткрытьОбъект(Значение, ИспользоватьИнструмент);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вОткрытьОбъект(Знач Ссылка, Знач ИспользоватьИнструмент = Истина)
	Если ИспользоватьИнструмент Тогда
		УИ_ОбщегоНазначенияКлиент.РедактироватьОбъект(Ссылка);
	Иначе
		ПоказатьЗначение( , Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция вЭтоОбъектМетаданных(Знач Тип)
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	Возврат (ОбъектМетаданных <> Неопределено И Не Метаданные.Перечисления.Содержит(ОбъектМетаданных));
КонецФункции

#КонецОбласти