
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	
	Заголовок = Параметры.Заголовок;
	Элементы.Информация.Заголовок = Параметры.Информация;
	КодДляКопирования = Параметры.КодДляКопирования;
	ИнформацияФорматированная = Новый ФорматированнаяСтрока(Параметры.Информация);
	
	Элементы.КодДляКопирования.КартинкаКнопкиВыбора = Элементы.Картинка_Копировать.Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура КодДляКопированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
КонецПроцедуры
