&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)

	Структура = Новый Структура;

	Для Каждого Строка Из ТЗ_Структура Цикл
		Структура.Вставить(Строка.Ключ, Строка.Значение);
	КонецЦикла;

	Закрыть(Структура);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ТипЗнч(Параметры.ПрошлоеЗначение) = Тип("Структура") Тогда
		Для Каждого Строка Из Параметры.ПрошлоеЗначение Цикл
			НоваяСтрока = ТЗ_Структура.Добавить();
			НоваяСтрока.Ключ = Строка.Ключ;
			НоваяСтрока.Значение = Строка.Значение;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры