&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	вПолучитьБлокировкуСеансов();
КонецПроцедуры

&НаСервере
Процедура вПолучитьБлокировкуСеансов()
	БлокировкаСеансов = ПолучитьБлокировкуСеансов();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БлокировкаСеансов);
КонецПроцедуры
&НаКлиенте
Процедура кУстановитьБлокировкуСеансов(Команда)
	вУстановитьБлокировкуСеансовНаСервере();
КонецПроцедуры

&НаСервере
Процедура вУстановитьБлокировкуСеансовНаСервере()
	БлокировкаСеансов = Новый БлокировкаСеансов;
	ЗаполнитьЗначенияСвойств(БлокировкаСеансов, ЭтаФорма);

	Попытка
		УстановитьБлокировкуСеансов(БлокировкаСеансов);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

	вПолучитьБлокировкуСеансов();
КонецПроцедуры