#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КолонкаЗапроса = Параметры.КолонкаЗапроса;
	ВидКолонки = "УИД";
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТекстВставки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидКолонкиПриИзменении(Элемент)
	СформироватьТекстВставки();
КонецПроцедуры

&НаКлиенте
Процедура КолонкаЗапросаПриИзменении(Элемент)
	СформироватьТекстВставки();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Вставить(Команда)
	Закрыть(ТекстВставки);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьТекстВставки()
	ТекстВставки = "";
	Если ВидКолонки = "УИД" Тогда
		ТекстВставки="&__УИД_"+КолонкаЗапроса;
	ИначеЕсли ВидКолонки = "ДатаСоздания" Тогда
		ТекстВставки="&__ДатаСоздания_"+КолонкаЗапроса;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

