
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сериализованные данные сохранения.
// 
// Параметры:
//  Формат-Строка - Формат
//  ДанныеСохранения - Произвольный- Данные сохранения
// 
// Возвращаемое значение:
//  Строка
Функция СериализованныеДанныеСохранения(Формат, ДанныеСохранения) Экспорт
	Если Формат = "html" Или Формат = ".html" Тогда

		Возврат ДанныеСохранения.ТекстHTML;

	Иначе
		
		Возврат УИ_ОбщегоНазначенияКлиентСервер.мЗаписатьJSON(ДанныеСохранения);		

	КонецЕсли;

КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
