

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонтейнерЗначения = Неопределено;
	Если Параметры.Свойство("КонтейнерЗначения") Тогда
		//@skip-check unknown-form-parameter-access
		КонтейнерЗначения = Параметры.КонтейнерЗначения; //см. УИ_ОбщегоНазначенияКлиентСервер.НовыйКонтейнерЗначения
	КонецЕсли;

	Если КонтейнерЗначения <> Неопределено Тогда
		Если КонтейнерЗначения.Хранилище <> Неопределено Тогда
			Дата = КонтейнерЗначения.Хранилище.Дата;
			Ссылка = КонтейнерЗначения.Хранилище.Ссылка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеНаборы = УИ_ОбщегоНазначенияКлиентСервер.ДоступныеНаборыТиповДляРедактирования();
	
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект, Элемент);
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.Значение = Ссылка;
	ПараметрыОбработчика.ИмяПоляВСтруктуре = "Ссылка";
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.НаборТипов = ДоступныеНаборы.Ссылки;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ТипыКонтейнеров = УИ_ОбщегоНазначенияКлиентСервер.ТипыКонтейнеровЗначения();

	Контейнер = УИ_ОбщегоНазначенияКлиентСервер.НовыйКонтейнерЗначения();
	Контейнер.Тип = ТипыКонтейнеров.МоментВремени;
	Контейнер.Хранилище = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеХранилищаКонтейнераМоментаВремениПоДатеИСсылке(Дата,
																												 Ссылка);
	УИ_ОбщегоНазначенияКлиентСервер.УстановитьПредставлениеКонтейнера(Контейнер);

	Закрыть(Контейнер);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
