
#Использовать osparser
#Использовать "./plugins"

ЧтениеТекста = Новый ЧтениеТекста("..\src\Классы\ПарсерВстроенногоЯзыка.os");
Исходник = ЧтениеТекста.Прочитать();
ЧтениеТекста.Закрыть();

Плагины = Новый Массив;
Плагины.Добавить(Новый ДетекторНеиспользуемыхПеременных);

ПараметрыПлагинов = Новый Соответствие;

Парсер = Новый ПарсерВстроенногоЯзыка;
Узлы = Парсер.Узлы();

ПроизвольноеОкружение = Парсер.Окружение();

// например, контекст формы:
Элемент = Узлы.ЭлементОкружения.Добавить();
Элемент.Имя = "ЭтаФорма";
ПроизвольноеОкружение.Переменные.Вставить("ЭтаФорма", Элемент);
// ...
Элемент = Узлы.ЭлементОкружения.Добавить();
Элемент.Имя = "РеквизитФормыВЗначение";
ПроизвольноеОкружение.Методы.Вставить("РеквизитФормыВЗначение", Элемент);
// ...

Парсер.Пуск(Исходник, Плагины, ПараметрыПлагинов, ПроизвольноеОкружение);

Для Каждого Ошибка Из Парсер.ТаблицаОшибок() Цикл
	Сообщить(Ошибка.Текст)
КонецЦикла;