Функция СериализованныеДанныеСохранения(Формат, ДанныеСохранения) Экспорт
	Если Формат = "xhttp" Или Формат = ".xhttp" Тогда

		СериализуемаяСтрока=ЗначениеВСтрокуВнутр(ДанныеСохранения);

	Иначе
		СериализаторJSON=Обработки.УИ_ПреобразованиеДанныхJSON.Создать();

		СтруктураИстории=СериализаторJSON.ЗначениеВСтруктуру(ДанныеСохранения);
		СериализуемаяСтрока=СериализаторJSON.ЗаписатьОписаниеОбъектаВJSON(СтруктураИстории);

	КонецЕсли;

	Возврат СериализуемаяСтрока;

КонецФункции

Функция ДанныеСохраненияИзСериализованнойСтроки(АдресФайлаВоВременномХранилище, ИмяФайлаЗапросов) Экспорт
	Файл=Новый Файл(ИмяФайлаЗапросов);

	Если Файл.Расширение = "xhttp" Или Файл.Расширение = ".xhttp" Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Данные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		Данные.Записать(ИмяВременногоФайла);

		Возврат ЗначениеИзФайла(ИмяВременногоФайла);
	Иначе
		ДанныеФайла=ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);

		ТекстовыйДокумент=Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ДанныеФайла.ОткрытьПотокДляЧтения());

		СериализаторJSON=Обработки.УИ_ПреобразованиеДанныхJSON.Создать();
		СтруктураТЗ= СериализаторJSON.ПрочитатьОписаниеОбъектаИзJSON(ТекстовыйДокумент.ПолучитьТекст());
		Возврат СериализаторJSON.ЗначениеИзСтруктуры(СтруктураТЗ, Истина);
	КонецЕсли;
КонецФункции