
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Элем из Параметры.ОписаниеРазработки Цикл
		ЭтаФорма["_" + Элем.Ключ] = Элем.Значение
	КонецЦикла;
	
	_Автор = "Русов Олег (ROL32)";
	_Сайт = "http://www.gf-fin.ru/";
	_Версия = _НомерВерсии + " от " + _ДатаВерсии;
	
	Элементы._Автор.Подсказка = "https://infostart.ru/profile/372296/";
КонецПроцедуры

&НаКлиенте
Процедура вПустойОбработчикОповещения(КодВозврата = Неопределено, ДопПарам = Неопределено) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура вВыполнитьПереходURL(СтрокаURL)
	Если ЗначениеЗаполнено(СтрокаURL) Тогда
		Попытка
			НачатьЗапускПриложения(новый ОписаниеОповещения("вПустойОбработчикОповещения", ЭтаФорма), СтрокаURL);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _АвторОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	СтрокаURL = Элемент.Подсказка;
	вВыполнитьПереходURL(СтрокаURL);
КонецПроцедуры

&НаКлиенте
Процедура _ОписаниеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	вВыполнитьПереходURL(_Описание);
КонецПроцедуры

&НаКлиенте
Процедура _СайтОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	
	вВыполнитьПереходURL(_Сайт);
КонецПроцедуры
