////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обаботчик события "Нажатие" в: Кнопка "ОК"
//
&НаКлиенте
Процедура ОКНажатие(Команда)
	ОповеститьОВыборе(Элементы.СписокНастроек.ТекущиеДанные);
	//Закрыть();
КонецПроцедуры

// Процедура - обаботчик события "Нажатие" в: Кнопка "Отмена"
//
&НаКлиенте
Процедура ОтменаНажатие(Команда)
	Закрыть();
КонецПроцедуры

// Процедура - обаботчик события "Нажатие" в: Кнопка "Удалить"
//
&НаКлиенте
Процедура УдалитьНажатие(Команда)

	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СписокНастроек.Удалить(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущиеДанные = СписокНастроек[0];

	Если Не ТекущиеДанные = Неопределено Тогда
		Элементы.СписокНастроек.ТекущаяСтрока = ТекущиеДанные;
	КонецЕсли;

	Элементы.Удалить.Доступность = Не СписокНастроек.Количество() = 0;
	Элементы.ОК.Доступность      = Не СписокНастроек.Количество() = 0;

КонецПроцедуры
&НаКлиенте
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные.Пометка Тогда
		Для Каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка И Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры