#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Параметры.Заголовок;
	Значение = Параметры.Значение;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВыделитьВесьТекстПоляЗначение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьСписокВыбора(Команда)

	Закрыть(Значение);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)

	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыделитьВесьТекстПоляЗначение()

	Элементы.Значение.УстановитьГраницыВыделения(1, СтрДлина(Значение) + 1);

КонецПроцедуры

#КонецОбласти