
#Область ОписаниеПеременных

&НаКлиенте
Перем ТипХранилищаЗначений;

&НаКлиенте
Перем ТипUUID;

&НаКлиенте
Перем ПоследнийUUID;

&НаКлиенте
Перем ОбработкаВыбораФормы;

&НаКлиенте
Перем ЭтоЗакрытиеОбработки; //Булево

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресОбщихРеквизитов = Параметры.АдресОбщихРеквизитов;
	Если ПустаяСтрока(АдресОбщихРеквизитов) Тогда
		УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
	КонецЕсли;
	
	ВсеПеречисления = УИ_ОбщегоНазначения.ОписаниеТипаПеречислениеСсылка().Типы();
	ВсеСсылки = УИ_ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	Элементы.мОбъектСсылка.ДоступныеТипы = Новый ОписаниеТипов(ВсеСсылки, , ВсеПеречисления);
	мОбъектСсылка = Параметры.мОбъектСсылка;
	
	ОграничениеНаСписокЗависимых = 10000;
	ПрефиксДляНовыхЭлементов = "__XXX__";
	ПриЗаполненииОбрабатыватьТолькоВыделенныеСтроки = Истина;
	
	НастройкиОбработки = СформироватьСтруктуруНастроек();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбработки);
	ЗагрузитьНастройкиОбработки();
	
	КонфигурацияДопускаетДопДвижения = (Метаданные.Документы.Найти("РегистраторРасчетов") <> Неопределено);
	
	Если Не ЕстьПраваАдминистратора() Тогда
		Элементы.Форма_УдалитьОбъект.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	ЗаполнитьДанныеОбъектаСсылки();
	
	УИ_РаботаСФормами.ФормаПриСозданииНаСервереСоздатьРеквизитыПараметровЗаписи(ЭтотОбъект,
		Элементы.ГруппаПараметрыЗаписи);
	УИ_ОбщегоНазначения.ФормаИнструментаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

	ДобавитьКомандуОчисткиТаблицы(Элементы._НаборЗаписей, "_НаборЗаписей");	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипХранилищаЗначений = Тип("ХранилищеЗначения");
	ТипUUID = Тип("УникальныйИдентификатор");
	ЭтоЗакрытиеОбработки = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)

	ИмяКлюча = "мОбъектСсылка";

	ЗначениеИзНастройки = Настройки[ИмяКлюча];
	Если ЗначениеИзНастройки <> Неопределено Тогда
		НовоеОписаниеТипов = НовоеОписаниеТипов(ТипЗнч(ЗначениеИзНастройки));
		Элементы[ИмяКлюча].ОграничениеТипа = НовоеОписаниеТипов;
		ЭтотОбъект[ИмяКлюча] = НовоеОписаниеТипов.ПривестиЗначение(ЗначениеИзНастройки);
	Иначе
		Элементы[ИмяКлюча].ОграничениеТипа = Новый ОписаниеТипов;
		ЭтотОбъект[ИмяКлюча] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если мОбъектСсылка <> Неопределено Тогда
		ЗаполнитьДанныеОбъектаСсылки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ОбработкаВыбораФормы <> Неопределено Тогда
		Элементы[ОбработкаВыбораФормы.Таблица].ТекущиеДанные[ОбработкаВыбораФормы.Поле] = ВыбранноеЗначение;
		ОбработкаВыбораФормы = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
	ИначеЕсли Модифицированность И Не ЭтоЗакрытиеОбработки Тогда
		Отказ = Истина;
		ЭтоЗакрытиеОбработки = Истина;

		ТекстВопроса  = "ru = 'Объект был изменен. 
						|Закрытие приведет к потере выполненных изменений.
						|Записать объект перед закрытием?'";
		ОповещениеОЗавершенииВопроса = Новый ОписаниеОповещения("ПередЗакрытиемЗавершениеВопросаОЗаписиОбъекта",
			ЭтотОбъект);

		ПоказатьВопрос(ОповещениеОЗавершенииВопроса,
					   ТекстВопроса,
					   РежимДиалогаВопрос.ДаНетОтмена,
					   10,
					   КодВозвратаДиалога.Нет);
	Иначе
		// SonarQube не пропускает обработку, если нет Иначе
		ЭтоЗакрытиеОбработки = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеНаборыТипов = УИ_ОбщегоНазначенияКлиентСервер.ДоступныеНаборыТиповДляРедактирования();

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "мОбъектСсылка");
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.Значение = мОбъектСсылка;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.НаборТипов = ДоступныеНаборыТипов.Ссылки;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Элемент.ДоступныеТипы;
	ПараметрыОбработчика.ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбъектСсылкаНачалоВыбораЗавершение",
		ЭтотОбъект);
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов",
		УИ_ОбщегоНазначенияКлиентСервер.ИспользованиеГруппИЭлементов(Элементы.мОбъектСсылка.ВыборГруппИЭлементов));

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСсылкаПриИзменении(Элемент)
	ПриИзмененииОбъектаСсылки();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСсылкаОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "мОбъектСсылка");
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
	ПриИзмененииОбъектаСсылки();
КонецПроцедуры

&НаКлиенте
Процедура _GUIDПриИзменении(Элемент)
	_ДатаСозданияОбъекта = ДатаСозданияГУИД(_UUID);
КонецПроцедуры

&НаКлиенте
Процедура _URLПриИзменении(Элемент)
	Если ЗначениеЗаполнено(_URL) Тогда
		ЗаполнитьОбъектСсылкаПоURL();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ИмяНабораЗаписейПриИзменении(Элемент)
	ОбновитьНаборЗаписейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура _СкрыватьПустыеТабличныеЧастиПриИзменении(Элемент)
	ИзменитьВидимостьТабличныхЧастейОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура _ЗначениеДляЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																											   Элемент,
																											   "_ЗначениеДляЗаполнения");
																											   
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;																											   
	ПараметрыОбработчика.Значение = _ЗначениеДляЗаполнения;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов",
		УИ_ОбщегоНазначенияКлиентСервер.ИспользованиеГруппИЭлементов(Элементы._ЗначениеДляЗаполнения.ВыборГруппИЭлементов));
	
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура _ЗначениеДляЗаполненияОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработкиСобытия = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																								  Элемент,
																								  "_ЗначениеДляЗаполнения");

	ПараметрыОбработкиСобытия.ДоступенКонтейнер = Ложь;																											   
	ПараметрыОбработкиСобытия.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработкиСобытия, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыОбъекта

&НаКлиенте
Процедура РеквизитыОбъектаЗначениеПриИзменении(Элемент)
	Значение = Элементы.РеквизитыОбъекта.ТекущиеДанные.Значение;

	Если Элементы.РеквизитыОбъекта.ТекущиеДанные.Имя = "ТипЗначения" И Значение <> Неопределено Тогда
		ВидОбъекта = ОпределитьВидОбъекта(мОбъектСсылка);
		Если ВидОбъекта = "ПланВидовХарактеристик" Тогда
			Элементы.РеквизитыОбъекта.ТекущиеДанные.Значение = НовоеОписаниеТипов(ТипЗнч(Значение));
		КонецЕсли;
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.РеквизитыОбъекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ЭтоРеквизитИмяПредопределенныхДанных(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "Значение");

	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.Значение = ТекущиеДанные.Значение;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = ТекущиеДанные.ТипЗначения;
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ОграничениеВыбораЗначенияОписанияТипов = ТекущиеДанные.ОграничениеВыбораЗначенияОписанияТипов;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ТекущиеДанные.ВыборГруппИЭлементов);
	
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.РеквизитыОбъекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "Значение");

	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = ТекущиеДанные.ТипЗначения;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОбъектаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.РеквизитыОбъекта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Колонка = Элементы.РеквизитыОбъектаЗначение;
	Если ЭтоРеквизитИмяПредопределенныхДанных(ТекущиеДанные) Тогда
		Колонка.РежимВыбораИзСписка = Истина;
		Колонка.СписокВыбора.ЗагрузитьЗначения(ИменаПредопределенныхДанных.ВыгрузитьЗначения());
	Иначе
		Колонка.РежимВыбораИзСписка = Ложь;
		Колонка.СписокВыбора.Очистить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабличнаяЧасть

&НаКлиенте
Процедура Подключаемый_ТабличнаяЧастьПриИзменении(Элемент)
	ОбновитьНомераСтрокТабличнойЧасти(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТабличнаяЧастьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьЗаголовокСтраницыТабличнойЧасти(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТабличнаяЧастьПослеУдаления(Элемент)
	ОбновитьЗаголовокСтраницыТабличнойЧасти(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТабличнаяЧастьРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТаблицаФормыЭлемента = Элемент.Родитель;

	ТекущиеДанные = ТаблицаФормыЭлемента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяКолонки = Сред(Элемент.Имя, СтрДлина(ТаблицаФормыЭлемента.Имя) + 1);
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  ИмяКолонки);

	ВыборГруппИЭлементов = УИ_ОбщегоНазначенияКлиентСервер.ИспользованиеГруппИЭлементов(Элемент.ВыборГруппИЭлементов);
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.Значение = ТекущиеДанные[ИмяКолонки];
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Элемент.ДоступныеТипы;
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ВыборГруппИЭлементов);

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТабличнаяЧастьРеквизитОчистка(Элемент, СтандартнаяОбработка)
	ТаблицаФормыЭлемента = Элемент.Родитель;

	ТекущиеДанные = ТаблицаФормыЭлемента.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяКолонки = Сред(Элемент.Имя, СтрДлина(ТаблицаФормыЭлемента.Имя) + 1);

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 ИмяКолонки);

	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Элемент.ДоступныеТипы;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗависимыеОбъекты

&НаКлиенте
Процедура _ЗависимыеОбъектыПриАктивизацииСтроки(Элемент)
	Интервал = 0.1;
	ПодключитьОбработчикОжидания("ОбработкаАктивизацииСтрокиЗависимых", Интервал, Истина);
КонецПроцедуры

&НаКлиенте
Процедура _ЗависимыеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы._ЗависимыеОбъекты.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ВидУзла = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуСпискаЗависимых();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьУдаленныйОбъект(Команда)	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВыборУдаленногоОбъектаЗавершение", ЭтотОбъект),
					   ,
					   НСтр("ru = 'Введите битую ссылку: <Объект не найден> ...'"),
					   ,
					   Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НайтиОбъектПоURL(Команда)
	ЗаполнитьОбъектСсылкаПоURL();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбъекта(Команда)
	ЗаполнитьДанныеОбъектаСсылки();
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнитьПоОбразцу(Команда)
	Если мОбъектСсылка = Неопределено Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан объект для записи!'"));
		Возврат;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																									  Элементы.мОбъектСсылка,
																									  "мОбъектСсылка");
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.Значение = мОбъектСсылка;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов",
		УИ_ОбщегоНазначенияКлиентСервер.ИспользованиеГруппИЭлементов(Элементы.мОбъектСсылка.ВыборГруппИЭлементов));
	ПараметрыОбработчика.ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПоОбразцуЗавершение",
		ЭтотОбъект);

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъект(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан объект для записи!'"));
		Возврат;
	КонецЕсли;

	Информация = ИнформацияОПредопределенныхДанных();
	Если Информация.НекорректноеИмя Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не правильное значение имени предопределенных данных!'"));
		Возврат;
	КонецЕсли;

	Если Информация.ЕстьИзменения Тогда
		ТекстВопроса = НСтр("ru = 'Объект будет записан в базу.
							|Важно: изменено предопреленное имя объекта.
							|Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Объект будет записан в базу. Продолжить?'");
	КонецЕсли;

	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения(НСтр("ru = 'ЗаписатьОбъектДалее'"), ЭтотОбъект),
				   ТекстВопроса,
				   РежимДиалогаВопрос.ДаНет,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _ЗаписатьОбъектКакНовый(Команда)
	Если мОбъектСсылка = Неопределено Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не заданы данные объекта для записи!'"));
		Возврат;
	КонецЕсли;

	Информация = ИнформацияОПредопределенныхДанных();
	Если Информация.НекорректноеИмя Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не правильное значение имени предопределенных данных!'"));
		Возврат;
	КонецЕсли;

	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьОбъектКакНовыйДалее", ЭтотОбъект),
				   НСтр("ru = 'В базу будет записан новый объект. Продолжить?'"),
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _ЗаписатьОбъектКакНовыйСУказаннымUUID(Команда)
	Если мОбъектСсылка = Неопределено Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не заданы данные объекта для записи!'"));
		Возврат;
	ИначеЕсли ПустаяСтрока(_UUID) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан UUID для нового объекта!'"));
		Возврат;
	КонецЕсли;

	Информация = ИнформацияОПредопределенныхДанных();
	Если Информация.НекорректноеИмя Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не правильное значение имени предопределенных данных!'"));
		Возврат;
	КонецЕсли;

	ШаблонВопроса = НСтр("ru = 'В базу будет записан новый объект с заданным UUID.
						 |UUID: %1
						 |
						 |Продолжить?'");
	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьОбъектКакНовыйДалее", ЭтотОбъект, _UUID),
				   СтрШаблон(ШаблонВопроса, _UUID),
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _УдалитьОбъект(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан объект для удаления!'"));
		Возврат;
	КонецЕсли;
	ТекстВопроса = НСтр("ru = 'Объект будет удален из базы!
						|Никакие проверки производиться не будут (возможно появление битых ссылок)!
						|
						|Продолжить?'");
	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьОбъектДалее", ЭтотОбъект),
				   ТекстВопроса,
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _ОбновитьНаборЗаписей(Команда)
	ОбновитьНаборЗаписейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура _ЗаписатьНаборЗаписей(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан объект для записи движений'"));
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(_ИмяНабораЗаписей) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан набор записей для сохранения'"));
		Возврат;
	КонецЕсли;
	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьНаборЗаписейПродолжение", ЭтотОбъект),
				   НСтр("ru = 'Набор записей будет записан в базу. Продолжить?'"),
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _ПереключитьАктивностьЗаписей(Команда)
	Для Каждого Стр Из _НаборЗаписей Цикл
		Стр.Активность = Не Стр.Активность;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _ПоказатьВсеДвижения(Команда)
	Если ЗначениеЗаполнено(мОбъектСсылка) Тогда
		СписокРегистров = Элементы._ИмяНабораЗаписей.СписокВыбора.Скопировать();
		Если СписокРегистров.Количество() <> 0 Тогда
			ТДок = СформироватьОтчетПоДвижениям(мОбъектСсылка, СписокРегистров, КонфигурацияДопускаетДопДвижения);
			ТДок.Показать("Наличие движений");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиОбъектПоUUID(Команда)
	НайтиОбъектПоUUIDСервер();
КонецПроцедуры

&НаКлиенте
Процедура НайтиОбъектПоТипу_UUID(Команда)
	НайтиОбъектПоТипу_UUIDСервер();
КонецПроцедуры

&НаКлиенте
Процедура _ПересчитатьИтогиПоКолонкам(Команда)

	Если Не ПоказыватьИтогиПоЧисловымКолонкам Тогда
		Возврат;
	КонецЕсли;

	ТекСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если ТекСтраница.Имя = "СтраницаРеквизитыОбъекта"
		 Или ТекСтраница.Имя = "СтраницаНастройки"
		 Или ТекСтраница.Имя = "СтраницаСсылкиНаОбъект" Тогда
		Возврат;
	КонецЕсли;

	Если ТекСтраница.Имя = "СтраницаТабличныеЧастиОбъекта" Тогда
	    ТекСтраница = Элементы.СтраницыТабличныхЧастейОбъекта.ТекущаяСтраница;
	КонецЕсли;
	
	ПрефиксСтраницы = ПрефиксСтраницы();
	КоличествоСимволов = СтрДлина(ТекСтраница.Имя) - СтрДлина(ПрефиксСтраницы);
	ТекущаяТаблица = ТекСтраница.ПодчиненныеЭлементы.Найти(Прав(ТекСтраница.Имя, КоличествоСимволов));

	Если ТипЗнч(ТекущаяТаблица) = Тип("ТаблицаФормы") Тогда
		ПересчитатьИтогиПоКолонкам(ТекущаяТаблица.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьФормуСписка(Команда)
	Если мОбъектСсылка <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("ТекущаяСтрока", мОбъектСсылка);
		УИ_ОбщегоНазначенияКлиент.ОткрытьДинамическийСписок(ТипОбъектаРедактирования, , ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	Имя = ПутьКДаннымТекущегоЭлемента();
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат;
	КонецЕсли;

	Значение = Неопределено;
	Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
		Значение = ЭтотОбъект[Имя];
	ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ТекДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Если ТекущийЭлемент.Имя = "РеквизитыОбъекта" Тогда
				Значение = ТекДанные.Значение;
			Иначе
				Значение = ТекДанные[Имя];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Значение) Тогда
		Если ТипЗнч(Значение) = ТипХранилищаЗначений Тогда
			УИ_ОбщегоНазначенияКлиент.РедактироватьХранилищеЗначения(ЭтотОбъект, Значение);
		Иначе
			УИ_ОбщегоНазначенияКлиент.РедактироватьОбъект(Значение, АдресОбщихРеквизитов);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьРедакторДвижений(Команда)
	
	НастройкиОбработки = СформироватьСтруктуруНастроек();
	ЗаполнитьЗначенияСвойств(НастройкиОбработки, ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", мОбъектСсылка);
	ПараметрыФормы.Вставить("Настройки", НастройкиОбработки);
	ПараметрыФормы.Вставить("АдресОбщихРеквизитов", АдресОбщихРеквизитов);
	ОткрытьФорму("Обработка.УИ_РедакторРеквизитовОбъекта.Форма.ФормаРедакторДвижений", ПараметрыФормы, , мОбъектСсылка);

КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьРедакторДвиженийДоп(Команда)

	НастройкиОбработки = СформироватьСтруктуруНастроек();
	ЗаполнитьЗначенияСвойств(НастройкиОбработки, ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", мОбъектСсылка);
	ПараметрыФормы.Вставить("Настройки", НастройкиОбработки);
	ПараметрыФормы.Вставить("АдресОбщихРеквизитов", АдресОбщихРеквизитов);
	ОткрытьФорму("Обработка.УИ_РедакторРеквизитовОбъекта.Форма.ФормаРедакторДвиженийДоп", ПараметрыФормы, , мОбъектСсылка);

КонецПроцедуры

&НаКлиенте
Процедура _ПоказатьТипЗначения(Команда)

	_ТипЗначенияТекущегоПоля = "";
	Имя = ПутьКДаннымТекущегоЭлемента();
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат;
	КонецЕсли;

	Значение = Неопределено;
	Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
		Значение = ЭтотОбъект[Имя];
	ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ТекДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Если ТекущийЭлемент.Имя = "РеквизитыОбъекта" Тогда
				Значение = ТекДанные.Значение;
			Иначе
				Значение = ТекДанные[Имя];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	_ТипЗначенияТекущегоПоля = СформироватьИмяТипаПоЗначению(Значение);

КонецПроцедуры

&НаКлиенте
Процедура _ПровестиДокумент(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан документ для обработки'"));
		Возврат;
	КонецЕсли;

	Если Не _ПроведениеРазрешено Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Проведение документов данного типа запрещено!'"));
		Возврат;
	КонецЕсли;

	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("ПровестиДокументПродолжение", ЭтотОбъект),
				   НСтр("ru = 'Документ будет перепроведен. Продолжить?'"),
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _РаспровестиДокумент(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан документ для обработки'"));
		Возврат;
	КонецЕсли;

	Если Не _ПроведениеРазрешено Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Проведение документов данного типа запрещено!'"));
		Возврат;
	КонецЕсли;

	Таймаут = 20;
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьПроведениеПродолжение", ЭтотОбъект),
				   НСтр("ru = 'Для документа будет выполнена отмена проведения. Продолжить?'"),
				   РежимДиалогаВопрос.ДаНетОтмена,
				   Таймаут);
КонецПроцедуры

&НаКлиенте
Процедура _ВставитьСсылкуНаОбъект(Команда)
	
	ДоступныеТипы = Новый ОписаниеТипов;
	Если ТекущийЭлемент.ТолькоПросмотр Или Не ТекущийЭлемент.Доступность Тогда
		Возврат;
	КонецЕсли;

	ЕстьСсылочныйТип = Ложь;

	Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
		ПолеФормы = ТекущийЭлемент;
	ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ПолеФормы = ТекущийЭлемент.ТекущийЭлемент;
		Если ПолеФормы.ТолькоПросмотр Или Не ПолеФормы.Доступность Тогда
			Возврат;
		КонецЕсли;

		ТекДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Если ТекущийЭлемент.Имя = "РеквизитыОбъекта" И Не ТекДанные.ТолькоПросмотр Тогда
			ЕстьСсылочныйТип = ОписаниеТиповСодержитСсылочныйТип(ТекДанные.ТипЗначения);
			Если Не ЕстьСсылочныйТип Тогда
				Возврат;
			КонецЕсли;
			ДоступныеТипы = ТекДанные.ТипЗначения;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	Если Не ЕстьСсылочныйТип Тогда
		ЕстьСсылочныйТип = ОписаниеТиповСодержитСсылочныйТип(ПолеФормы.ДоступныеТипы);
		ДоступныеТипы = ПолеФормы.ДоступныеТипы;
	КонецЕсли;
	
	Если ЕстьСсылочныйТип Тогда
		Имя = ПутьКДаннымТекущегоЭлемента();
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры = Новый Структура("Таблица");
		ДополнительныеПараметры.Вставить("Имя", Имя);
		Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			ДополнительныеПараметры.Таблица = ТекущийЭлемент.Имя;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("ДоступныеТипы", ДоступныеТипы);

		Оповещение = Новый ОписаниеОповещения("ВставитьСсылкуНаОбъектПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		УИ_БуферОбменаКлиент.НачатьПолучениеСтрокиИзБуфера(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ВставитьСсылкуИзБуфераОбмена(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВставитьСсылкуИзБуфераОбменаПродолжение", ЭтотОбъект);
	УИ_БуферОбменаКлиент.НачатьПолучениеСтрокиИзБуфера(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура _ВставитьУникальныйИдентификатор(Команда)
	
	Если ТекущийЭлемент.ТолькоПросмотр Или Не ТекущийЭлемент.Доступность Тогда
		Возврат;
	КонецЕсли;

	МожноВставить = Ложь;
	Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
		ПолеФормы = ТекущийЭлемент;
	ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ПолеФормы = ТекущийЭлемент.ТекущийЭлемент;
		Если ПолеФормы.ТолькоПросмотр Или Не ПолеФормы.Доступность Тогда
			Возврат;
		КонецЕсли;
		ТекДанные = ТекущийЭлемент.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ТекущийЭлемент.Имя = "РеквизитыОбъекта" И Не ТекДанные.ТолькоПросмотр Тогда
			МожноВставить = ОписаниеТиповПоддерживаетВставкуУникальногоИдентификатора(ТекДанные.ТипЗначения);
			Если Не МожноВставить Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	Если Не МожноВставить Тогда
		МожноВставить = ОписаниеТиповПоддерживаетВставкуУникальногоИдентификатора(ПолеФормы.ДоступныеТипы);		
	КонецЕсли;
	
	Если МожноВставить Тогда
		Имя = ПутьКДаннымТекущегоЭлемента();
		Если Не ЗначениеЗаполнено(Имя) Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры = Новый Структура("Таблица");
		ДополнительныеПараметры.Вставить("Имя", Имя);
		Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			ДополнительныеПараметры.Таблица = ТекущийЭлемент.Имя;
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ВставитьУникальныйИдентификаторПродолжение", ЭтотОбъект,
			ДополнительныеПараметры);
		УИ_БуферОбменаКлиент.НачатьПолучениеСтрокиИзБуфера(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнитьДанныеТекущейКолонки(Команда)

	ТекСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Если ТекСтраница.Имя = "СтраницаРеквизитыОбъекта"
		 Или ТекСтраница.Имя = "СтраницаНастройки"
		 Или ТекСтраница.Имя = "СтраницаСсылкиНаОбъект" Тогда
		Возврат;
	КонецЕсли;

	Если ТекСтраница.Имя = "СтраницаТабличныеЧастиОбъекта" Тогда
		ТекСтраница = Элементы.СтраницыТабличныхЧастейОбъекта.ТекущаяСтраница;
	КонецЕсли;

	ПрефиксСтраницы = ПрефиксСтраницы();
	КоличествоСимволов = СтрДлина(ТекСтраница.Имя) - СтрДлина(ПрефиксСтраницы);
	ТекущаяТаблица = ТекСтраница.ПодчиненныеЭлементы.Найти(Прав(ТекСтраница.Имя, КоличествоСимволов));

	Если ТипЗнч(ТекущаяТаблица) = Тип("ТаблицаФормы") Тогда
		Если ТекущаяТаблица.ТолькоПросмотр Или Не ТекущаяТаблица.Доступность Тогда
			Возврат;
		КонецЕсли;
		СтрукДанные = ПолучитьСвойстваТабличногоПоля(ТекущаяТаблица.Имя);
		Если Не СтрукДанные.Отказ Тогда
			ТаблицаФормы = ЭтотОбъект[СтрукДанные.Таблица];
			ИмяПоля = СтрукДанные.Поле;
			ПолеФормы = ТекущаяТаблица.ТекущийЭлемент;
			Если ТекущаяТаблица.ТекущийЭлемент.ТолькоПросмотр Или Не ТекущаяТаблица.ТекущийЭлемент.Доступность Тогда
				Возврат;
			КонецЕсли;

			Если ТипЗнч(ТаблицаФормы) = Тип("ДанныеФормыКоллекция") И ТаблицаФормы.Количество() <> 0 Тогда

				НовоеЗначение = ПолеФормы.ДоступныеТипы.ПривестиЗначение(_ЗначениеДляЗаполнения);
				Если ПриЗаполненииОбрабатыватьТолькоВыделенныеСтроки Тогда
					Для Каждого Элем Из ТекущаяТаблица.ВыделенныеСтроки Цикл
						Стр = ТаблицаФормы.НайтиПоИдентификатору(Элем);
						Стр[ИмяПоля] = НовоеЗначение;
					КонецЦикла;
				Иначе
					Для Каждого Стр Из ТаблицаФормы Цикл
						Стр[ИмяПоля] = НовоеЗначение;
					КонецЦикла;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура _ВыгрузитьНаборЗаписей(Команда)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан объект для выгрузки движений'"));
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(_ИмяНабораЗаписей) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан набор записей для выгрузки'"));
		Возврат;
	КонецЕсли;

	РежимыРаботыВыгрузкиОбъекта = РежимыРаботыВыгрузкиОбъекта();
	ОткрытьФормуВыгрузкиОбъекта(РежимыРаботыВыгрузкиОбъекта.ВыгрузкаНабораЗаписей);
КонецПроцедуры

&НаКлиенте
Процедура _ВыгрузитьОбъект(Команда)
	РежимыРаботыВыгрузкиОбъекта = РежимыРаботыВыгрузкиОбъекта();
	ОткрытьФормуВыгрузкиОбъекта(РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура _ВыгрузитьОбъектСДвижениями(Команда)
	РежимыРаботыВыгрузкиОбъекта = РежимыРаботыВыгрузкиОбъекта();
	ОткрытьФормуВыгрузкиОбъекта(РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъектаСДвижениями);
КонецПроцедуры

&НаКлиенте
Процедура _ВыгрузитьДвиженияОбъекта(Команда)
	РежимыРаботыВыгрузкиОбъекта = РежимыРаботыВыгрузкиОбъекта();
	ОткрытьФормуВыгрузкиОбъекта(РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъектаТолькоДвижения);
КонецПроцедуры

&НаКлиенте
Процедура _ЗагрузитьДанныеXML(Команда)
	ОткрытьФорму("Обработка.УИ_РедакторРеквизитовОбъекта.Форма.ФормаЗагрузкаXML",
				 ,
				 ,
				 ,
				 ,
				 ,
				 Новый ОписаниеОповещения("вОбработатьКомандуЗагрузкиДанныхXML", ЭтотОбъект),
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура _РазвернутьВсеУзлы(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМетаданные Тогда
		Для Каждого Элемент Из _ДеревоСвойств.ПолучитьЭлементы() Цикл
			Элементы._ДеревоСвойств.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСсылкиНаОбъект Тогда
		Для Каждого Элемент Из _ЗависимыеОбъекты.ПолучитьЭлементы() Цикл
			Элементы._ЗависимыеОбъекты.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _СвернутьВсеУзлы(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМетаданные Тогда
		Для Каждого УзелДерева Из _ДеревоСвойств.ПолучитьЭлементы() Цикл
			Для Каждого Элемент Из УзелДерева.ПолучитьЭлементы() Цикл
				Элементы._ДеревоСвойств.Свернуть(Элемент.ПолучитьИдентификатор());
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСсылкиНаОбъект Тогда
		Для Каждого УзелДерева Из _ЗависимыеОбъекты.ПолучитьЭлементы() Цикл
			Для Каждого Элемент Из УзелДерева.ПолучитьЭлементы() Цикл
				Элементы._ЗависимыеОбъекты.Свернуть(Элемент.ПолучитьИдентификатор());
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнитьЗависимыеОбъекты(Команда)
	вЗаполнитьЗависимыеОбъекты();
	Для Каждого Элем Из _ЗависимыеОбъекты.ПолучитьЭлементы() Цикл
		Элементы._ЗависимыеОбъекты.Развернуть(Элем.ПолучитьИдентификатор(), Ложь);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьСписокЗависимых(Команда)
	ОткрытьФормуСпискаЗависимых();
КонецПроцедуры

&НаКлиенте
Процедура _ПрименитьНастройки(Команда)
	ИмяНабораЗаписей = _ИмяНабораЗаписей;
	ПерезаполнитьДанныеОбъекта(Истина);
	Если Не ПустаяСтрока(ИмяНабораЗаписей) Тогда
		_ИмяНабораЗаписей = ИмяНабораЗаписей;
		ОбновитьНаборЗаписейНаСервере();
	КонецЕсли;

	НастройкиОбработки = СформироватьСтруктуруНастроек();
	ЗаполнитьЗначенияСвойств(НастройкиОбработки, ЭтотОбъект);
	СохранитьНастройкиОбработки(НастройкиОбработки);
КонецПроцедуры

&НаКлиенте
Процедура _ПоказатьСвойстваОбъектаМД(Команда)

	ТекДанные = Элементы._ДеревоСвойств.ТекущиеДанные;

	Если ТекДанные = Неопределено Или ПустаяСтрока(ТекДанные.ТипСтрокой) Или СтрНайти(ТекДанные.ТипСтрокой, ".") = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивТипов = вПолучитьМассивТиповМД(ТекДанные.ТипСтрокой);
	Если МассивТипов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ФормаНавигатора = ПолучитьФормуНавигатораПоКонфигурации(Истина);
	Если ФормаНавигатора = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Операция не доступна, необходимо открыть ""Навигатор по метаданным""'");
		УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	Если МассивТипов.Количество() = 1 Тогда
		вПоказатьСвойстваОбъектаМД(Новый Структура("Значение", МассивТипов[0]), ФормаНавигатора);
	Иначе
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(МассивТипов);
		СписокТипов.СортироватьПоЗначению();
		Оповещение = Новый ОписаниеОповещения("вПоказатьСвойстваОбъектаМД", ЭтотОбъект, ФормаНавигатора);
		СписокТипов.ПоказатьВыборЭлемента(Оповещение, "Выбор типа");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьТаблицу(Команда)
	
	Префикс = ПрефиксКомандыОчиститьТаблицу();
	ИмяНаФорме = Сред(Команда.Имя, СтрДлина(Префикс) + 1);
	НайденныеТабличныеЧасти = ТабличныеЧастиОбъекта.НайтиСтроки(Новый Структура("ИмяНаФорме", ИмяНаФорме));
	Если НайденныеТабличныеЧасти.Количество() > 0 Тогда
		ТабличнаяЧасть = НайденныеТабличныеЧасти[0];
		ОчиститьТабличнуюЧастьОбъекта(ТабличнаяЧасть.ИмяНаФорме);
		ОбновитьЗаголовокСтраницыТабличнойЧасти(Элементы[ТабличнаяЧасть.ИмяНаФорме]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Перед закрытием завершение вопроса о записи объекта.
// 
// Параметры:
//  Результат - КодВозвратаДиалога
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ПередЗакрытиемЗавершениеВопросаОЗаписиОбъекта(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		ЭтоЗакрытиеОбработки = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьОбъектДалее(Результат, ДополнительныеПараметры);

	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуОчисткиТаблицы(Таблица, ПутьКДанным)
	ИмяКоманды = СтрШаблон("%1%2", ПрефиксКомандыОчиститьТаблицу(), ПутьКДанным);
	Если Команды.Найти(ИмяКоманды) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	НоваяКоманда = Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Действие = "Подключаемый_ОчиститьТаблицу";
	НоваяКоманда.Заголовок = "Очистить таблицу";
	НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;

	Кнопка = Элементы.Добавить("ОчиститьТаблицу_" + ПутьКДанным, Тип("КнопкаФормы"), Таблица.КоманднаяПанель);
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = ИмяКоманды;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличнуюЧастьОбъекта(Знач ИмяНаФорме)
	ЭтотОбъект[ИмяНаФорме].Очистить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПраваАдминистратора()
	Возврат ПравоДоступа("Администрирование", Метаданные);
КонецФункции

&НаСервереБезКонтекста
Функция КлючОбъектаХранилищаНастройки()
	Возврат "УИ_РедакторРеквизитовОбъекта";
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОбработки(Знач НастройкиОбработки)
	ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХранилищаНастройки(), "Настройки", НастройкиОбработки);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОбработки()
	ДанныеНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъектаХранилищаНастройки(), "Настройки");
	Если ТипЗнч(ДанныеНастройки) = Тип("Структура") Тогда
		НастройкиОбработки = СформироватьСтруктуруНастроек();
		ЗаполнитьЗначенияСвойств(НастройкиОбработки, ДанныеНастройки);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОбработки);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтруктуруНастроек()
	Настройка = Новый Структура;
	Настройка.Вставить("ПоказыватьИтогиПоЧисловымКолонкам", Ложь);
	Настройка.Вставить("ПоказыватьИтогиПоЧисловымКолонкамРД", Ложь);
	Настройка.Вставить("ИспользоватьЖирныйШрифтДляИтогов", Истина);
	Настройка.Вставить("ПоказыватьНомерСтрокиТЧ", Истина);
	Настройка.Вставить("СкрыватьПустыеТабличныеЧасти", Ложь);
	Настройка.Вставить("ОсобыйРежимРаботыСНаборомЗаписейРБ", Истина);
	Возврат Настройка;
КонецФункции

&НаКлиенте
Процедура ОбъектСсылкаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	мОбъектСсылка = Результат;
	ПриИзмененииОбъектаСсылки();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОбъектаСсылки()
	КлючУникальности = мОбъектСсылка;
	_URL = "";
	Если мОбъектСсылка <> Неопределено Тогда
		_UUID = "";
		_ДатаСозданияОбъекта = Дата(1, 1, 1);
	КонецЕсли;
	ЗаполнитьДанныеОбъектаСсылки();
КонецПроцедуры

&НаКлиенте
Процедура ВыборУдаленногоОбъектаЗавершение(Строка, ДополнительныеПараметры = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Строка) Тогда
		Результат = СсылкаНаУдаленныйОбъект(Строка);
		Если Не Результат.Отказ Тогда
			мОбъектСсылка = Результат.Ссылка;
			ПриИзмененииОбъектаСсылки();
		ИначеЕсли ЗначениеЗаполнено(Результат.ПричинаОтказа) Тогда
			УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПричинаОтказа);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаНаУдаленныйОбъект(Знач СтрокаУдаленногоОбъекта)

	Результат = Новый Структура("Отказ, ПричинаОтказа, Ссылка", Истина, НСтр("ru = 'Неправильный формат строки!'"),
		Неопределено);

	// Пример строки "<Объект не найден> (769:b1390050568b35ac11e6e46fdd2c3861)"
	СтрокаУдаленногоОбъекта = Сред(СтрокаУдаленногоОбъекта, СтрНайти(СтрокаУдаленногоОбъекта, "(") + 1);
	СтрокаУдаленногоОбъекта = СтрЗаменить(СтрокаУдаленногоОбъекта, ")", "");
	СтрокаУдаленногоОбъекта = СокрЛП(СтрокаУдаленногоОбъекта);

	ПозицияРазделителя = СтрНайти(СтрокаУдаленногоОбъекта, ":");

	ТипСсылкиСтрокой = Лев(СтрокаУдаленногоОбъекта, ПозицияРазделителя - 1);
	СтрокаUUID = Сред(СтрокаУдаленногоОбъекта, ПозицияРазделителя + 1);

	Попытка
		UUIDСтрокой = СтрШаблон("%1-%2-%3-%4-%5",
								Сред(СтрокаUUID, 25, 8),
								Сред(СтрокаUUID, 21, 4),
								Сред(СтрокаUUID, 17, 4),
								Сред(СтрокаUUID, 1, 4),
								Сред(СтрокаUUID, 5, 12));
		UUID = Новый УникальныйИдентификатор(UUIDСтрокой);

		РазделыМетаданных = Новый Массив;
		РазделыМетаданных.Добавить("Справочник");
		РазделыМетаданных.Добавить("Документ");
		РазделыМетаданных.Добавить("БизнесПроцесс");
		РазделыМетаданных.Добавить("Задача");
		РазделыМетаданных.Добавить("ПланСчетов");
		РазделыМетаданных.Добавить("ПланОбмена");
		РазделыМетаданных.Добавить("ПланВидовХарактеристик");
		РазделыМетаданных.Добавить("ПланВидовРасчета");

		Для Каждого РазделМетаданных Из РазделыМетаданных Цикл
			Для Каждого ОбъектМетаданных Из Метаданные[РазделМетаданных] Цикл
				ИмяМенеджера = СтрШаблон("%1.%2", РазделМетаданных, ОбъектМетаданных.Имя);
				МенеджерОбъекта = УИ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяМенеджера);
				ПредставлениеСсылки = ЗначениеВСтрокуВнутр(МенеджерОбъекта.ПустаяСсылка());
				Поз1 = СтрНайти(ПредставлениеСсылки, ",", НаправлениеПоиска.СКонца);
				Поз2 = СтрНайти(ПредставлениеСсылки, ":");

				Если Сред(ПредставлениеСсылки, Поз1 + 1, Поз2 - Поз1 - 1) = ТипСсылкиСтрокой Тогда
					Результат.Ссылка = МенеджерОбъекта.ПолучитьСсылку(UUID);
					Результат.Отказ = Ложь;
					Возврат Результат;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Результат.ПричинаОтказа = СтрШаблон("%1
											|%2",
											Результат.ПричинаОтказа,
											ПредставлениеОшибки);
	КонецПопытки;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ДатаСозданияГУИД(Знач ГУИДСтрокой)

	ПустаяДата = Дата(1, 1, 1);
	ПустойГУИД = Строка(УИ_ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Если ГУИДСтрокой = ПустойГУИД
		Или Не УИ_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ГУИДСтрокой) Тогда
		Возврат ПустаяДата;
	КонецЕсли;
	
	Возврат УИ_ОбщегоНазначения.ДатаСозданияГУИД(ГУИДСтрокой);	
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОбъектСсылкаПоURL()
	
	ЗначениеОбъектаСсылка = УИ_ОбщегоНазначения.СсылкаНаОбъектПоНавигационнойСсылке(_URL);
	
	Если мОбъектСсылка <> ЗначениеОбъектаСсылка Тогда
		мОбъектСсылка = ЗначениеОбъектаСсылка;
		ЗаполнитьДанныеОбъектаСсылки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъектаСсылки()
	
	Элементы.мОбъектСсылка.ОграничениеТипа = НовоеОписаниеТипов(ТипЗнч(мОбъектСсылка));
	НадоСоздаватьРеквизиты = (ТипЗнч(мОбъектСсылка) <> ТипЗнч(ОбъектСсылкаПредыдущий));
	
	Если НадоСоздаватьРеквизиты Тогда
		ЗаполнитьДеревоМетаданныхОбъекта();
		ОчиститьЗависимыеОбъекты();
	КонецЕсли;
	
	Если КонфигурацияДопускаетДопДвижения Тогда
		Если НадоСоздаватьРеквизиты Тогда
			РезультатПроверки = ОпределитьДополнительныеРегистрыДокумента(мОбъектСсылка);
			Элементы._ОткрытьРедакторДвиженийДоп.Видимость = РезультатПроверки.ЕстьДанные;
		КонецЕсли;
	Иначе
		Элементы._ОткрытьРедакторДвиженийДоп.Видимость = Ложь;
	КонецЕсли;
	
	ПерезаполнитьДанныеОбъекта(НадоСоздаватьРеквизиты);
	ОбъектСсылкаПредыдущий = мОбъектСсылка;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовоеОписаниеТипов(Знач ТипЗначения)
	
	ТипВМассиве = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначения);
	Возврат Новый ОписаниеТипов(ТипВМассиве);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхОбъекта()
	
	_ДеревоСвойств.ПолучитьЭлементы().Очистить();
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(мОбъектСсылка));
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если УИ_ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхСправочника(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхДокумента(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхПланаСчетов(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхПланаОбмена(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхПланаВидовХарактеристик(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхПланаВидовРасчета(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхБизнесПроцесса(ОбъектМетаданных);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		ЗаполнитьДеревоМетаданныхЗадачи(ОбъектМетаданных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхСправочника(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, Автонумерация, Иерархический, ВидИерархии, ГруппыСверху, ТипКода, ДлинаКода, ДлинаНаименования, КонтрольУникальности, СерииКодов, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВладельцевОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхДокумента(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, Автонумерация, ДлинаНомера, КонтрольУникальности, ОперативноеПроведение, ПериодичностьНомера, Проведение, УдалениеДвижений, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхПланаВидовХарактеристик(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, Автонумерация, Иерархический, ГруппыСверху, ДлинаКода, ДлинаНаименования, КонтрольУникальности, СерииКодов, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхПланаВидовРасчета(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, ДлинаКода, ДлинаНаименования, ТипКода, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхПланаСчетов(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, АвтоПорядокПоКоду, ДлинаКода, ДлинаНаименования, ДлинаПорядка, КонтрольУникальности, МаскаКода, ПоляБлокировкиДанных, СерииКодов, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьСпецСвойствоОбъекта(ОбъектМетаданных, УзелДЗ, "ПризнакиУчета");
	вЗаполнитьСпецСвойствоОбъекта(ОбъектМетаданных, УзелДЗ, "ПризнакиУчетаСубконто");
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхБизнесПроцесса(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, Автонумерация, ДлинаНомера, Задача, ТипНомера, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхЗадачи(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, Автонумерация, Адресация, ДлинаНомера, ДлинаНаименования, КонтрольУникальности, ТипНомера, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМетаданныхПланаОбмена(ОбъектМетаданных)
	
	УзелДЗ = _ДеревоСвойств.ПолучитьЭлементы().Добавить();
	УзелДЗ.ВидУзла = 1;
	УзелДЗ.Имя = ОбъектМетаданных.Имя;
	УзелДЗ.Синоним = ОбъектМетаданных.Представление();
	УзелДЗ.Комментарий = ОбъектМетаданных.Комментарий;
	УзелДЗ.ТипСтрокой = ОбъектМетаданных.ПолноеИмя();
	УзелДЗ.Расширение = (ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено);
	УзелДЗ.ИзмененРасширениями = ОбъектМетаданных.ЕстьИзмененияРасширениямиКонфигурации();
	
	ПереченьСвойств = "ИспользоватьСтандартныеКоманды, ДлинаКода, ДлинаНаименования, ДопустимаяДлинаКода, РежимУправленияБлокировкойДанных";
	вЗаполнитьСвойстваОбъекта(ОбъектМетаданных, УзелДЗ, ПереченьСвойств);
	вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, УзелДЗ);
	вЗаполнитьВводитсяНаОсновании(ОбъектМетаданных, УзелДЗ);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗависимыеОбъекты()
	Элементы.ДекорацияСсылкиНаОбъект.Заголовок = "Ссылки на объекты конфигурации";
	_ЗависимыеОбъекты.ПолучитьЭлементы().Очистить();
	_ГдеНайдено = "";
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьДополнительныеРегистрыДокумента(Знач СсылкаНаДокумент)

	ДополнительныеРегистры = Новый Соответствие;
	Результат = Новый Структура;
	Результат.Вставить("ЕстьДанные", Ложь);
	Результат.Вставить("ДополнительныеРегистры", ДополнительныеРегистры);

	Если СсылкаНаДокумент = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	МетаданныеРегистратораРасчетов = Метаданные.Документы.Найти("РегистраторРасчетов");
	Если МетаданныеРегистратораРасчетов = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	МетаданныеДокумента = СсылкаНаДокумент.Метаданные();
	Если Не УИ_ОбщегоНазначения.ЭтоДокумент(МетаданныеДокумента)
		 Или МетаданныеДокумента = МетаданныеРегистратораРасчетов Тогда
		Возврат Результат;
	КонецЕсли;

	ТипДокумента = ТипЗнч(СсылкаНаДокумент);
	Для Каждого МетаданныеРегистра Из МетаданныеРегистратораРасчетов.Движения Цикл
		РеквизитДокументРегистратор = МетаданныеРегистра.Реквизиты.Найти("ДокументРегистратор");
		Если РеквизитДокументРегистратор <> Неопределено Тогда
			Если РеквизитДокументРегистратор.Тип.СодержитТип(ТипДокумента) Тогда
				ДополнительныеРегистры[МетаданныеРегистра.ПолноеИмя()] = МетаданныеРегистра.Представление();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат.ЕстьДанные = (ДополнительныеРегистры.Количество() > 0);

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПодготовитьТабличныеЧастиОбъекта(МассивКСозданию, МассивКУдалению, ТабличныеЧастиПредыдущие, ТипыДанныхРеквизитов)

	ТабличныеЧастиОбъекта.Очистить();
	РеквизитыТабличныхЧастейОбъекта.Очистить();
	Если ОбъектСсылкаПредыдущий <> Неопределено Тогда
		Для Каждого ИмяНаФорме Из ТабличныеЧастиПредыдущие Цикл
			МассивКУдалению.Добавить(ИмяНаФорме);
		КонецЦикла;
	КонецЕсли;

	Если мОбъектСсылка <> Неопределено Тогда
		ОбъектМетаданных = мОбъектСсылка.Метаданные();
		ВидыТабличныхЧастейОбъекта = ВидыТабличныхЧастейОбъекта(ОбъектМетаданных);
		Для Каждого ВидТабличнойЧасти Из ВидыТабличныхЧастейОбъекта Цикл
			Для Каждого ТабличнаяЧасть Из ВидТабличнойЧасти Цикл
				
				ЭтоСтандартнаяТабличнаяЧасть = (ТипЗнч(ТабличнаяЧасть) = Тип("ОписаниеСтандартнойТабличнойЧасти"));
				НоваяТабличнаяЧасть = ТабличныеЧастиОбъекта.Добавить();
				НоваяТабличнаяЧасть.Имя = ТабличнаяЧасть.Имя;
				НоваяТабличнаяЧасть.ИмяНаФорме = ПрефиксДляНовыхЭлементов + ТабличнаяЧасть.Имя;
				НоваяТабличнаяЧасть.Представление = ТабличнаяЧасть.Представление();
				НоваяТабличнаяЧасть.Категория = ?(ЭтоСтандартнаяТабличнаяЧасть, 0, 1);
				
				НовыйРеквизит = УИ_РаботаСФормами.ОписаниеРеквизитаФормы();
				НовыйРеквизит.Имя = НоваяТабличнаяЧасть.ИмяНаФорме;
				НовыйРеквизит.Заголовок = НоваяТабличнаяЧасть.Представление;
				НовыйРеквизит.Тип = Новый ОписаниеТипов("ТаблицаЗначений");
				НовыйРеквизит.СохраняемыеДанные = Истина;
				
				УИ_РаботаСФормами.ДобавитьРеквизитФормы(МассивКСозданию, НовыйРеквизит);
				
				ВидыРеквизитовТабличнойЧасти = ВидыРеквизитовТабличнойЧасти(ТабличнаяЧасть);
				Для Каждого ВидРеквизита Из ВидыРеквизитовТабличнойЧасти Цикл
					Для Каждого Реквизит Из ВидРеквизита Цикл
						НоваяСтрока = ДобавитьРеквизитТабличнойЧастиОбъекта(НоваяТабличнаяЧасть, Реквизит);
						НовыйРеквизит = УИ_РаботаСФормами.ОписаниеРеквизитаФормы();
						НовыйРеквизит.Имя = НоваяСтрока.Имя;
						НовыйРеквизит.Заголовок = НоваяСтрока.Представление;
						НовыйРеквизит.ПутьКДанным = НоваяТабличнаяЧасть.ИмяНаФорме;
						Если НоваяСтрока.Тип.СодержитТип(ТипыДанныхРеквизитов.ХранилищеЗначения) Тогда
							НовыйРеквизит.Тип = Новый ОписаниеТипов;
						Иначе
							НовыйРеквизит.Тип = НоваяСтрока.Тип;
						КонецЕсли;
						УИ_РаботаСФормами.ДобавитьРеквизитФормы(МассивКСозданию, НовыйРеквизит);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		ТабличныеЧастиОбъекта.Сортировать("Категория, Представление");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДобавитьРеквизитТабличнойЧастиОбъекта(ТабличнаяЧасть, Реквизит)
	НоваяСтрока = РеквизитыТабличныхЧастейОбъекта.Добавить();
	НоваяСтрока.Имя = Реквизит.Имя;
	НоваяСтрока.ИмяНаФорме = ТабличнаяЧасть.ИмяНаФорме + Реквизит.Имя;
	НоваяСтрока.ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
	НоваяСтрока.Категория = ?(ТипЗнч(Реквизит) = Тип("ОписаниеСтандартногоРеквизита"), 0, 1);
	НоваяСтрока.Представление = Реквизит.Представление();
	НоваяСтрока.Тип = Реквизит.Тип;

	ЭтоНомерСтроки = (НоваяСтрока.Категория = 0 И НоваяСтрока.Имя = "НомерСтроки");
	ЭтоПредопределенный = (НоваяСтрока.Категория = 0 И НоваяСтрока.Имя = "Предопределенный");
	ЭтоТипЧисло = УИ_ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Реквизит.Тип, Тип("Число"));
	НоваяСтрока.ИспользоватьИтоги =  Не ЭтоНомерСтроки И ЭтоТипЧисло;
	НоваяСтрока.ТолькоПросмотр = ЭтоНомерСтроки Или ЭтоПредопределенный;
	Если НоваяСтрока.Категория <> 0 Тогда
		НоваяСтрока.ВыборГруппИЭлементов = Реквизит.ВыборГруппИЭлементов;
	КонецЕсли;
	
	Возврат НоваяСтрока;
КонецФункции

// Возвращает табличные части объект метаданных.
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданныхПланСчетов, ОбъектМетаданныхПланВидовХарактеристик, ОбъектМетаданныхПланВидовРасчета, ОбъектМетаданныхСправочник, ОбъектМетаданныхЗадача, ОбъектМетаданныхПланОбмена, ОбъектМетаданныхБизнесПроцесс, ОбъектМетаданныхДокумент - Объект метаданных
// 
// Возвращаемое значение:
//  Массив из КоллекцияОбъектовМетаданных, ОписанияСтандартныхТабличныхЧастей - Виды табличных частей объекта
&НаСервереБезКонтекста
Функция ВидыТабличныхЧастейОбъекта(ОбъектМетаданных)
	
	Результат = Новый Массив;
	Если ЕстьТабличныеЧасти(ОбъектМетаданных) Тогда
		Результат.Добавить(ОбъектМетаданных.ТабличныеЧасти);
	КонецЕсли;
	Если ЕстьСтандартныеТабличныеЧасти(ОбъектМетаданных) Тогда
		Результат.Добавить(ОбъектМетаданных.СтандартныеТабличныеЧасти);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Возвращает реквизиты табличной части объект метаданных.
// 
// Параметры:
//  ТабличнаяЧасть - КоллекцияОбъектовМетаданных, ОписанияСтандартныхТабличныхЧастей - Табличная часть
// 
// Возвращаемое значение:
//  Массив из КоллекцияОбъектовМетаданных, ОписанияСтандартныхРеквизитов - Виды табличных частей объекта
&НаСервереБезКонтекста
Функция ВидыРеквизитовТабличнойЧасти(ТабличнаяЧасть)
	ЭтоСтандартнаяТабличнаяЧасть = (ТипЗнч(ТабличнаяЧасть) = Тип("ОписаниеСтандартнойТабличнойЧасти"));
	Результат = Новый Массив;
	Результат.Добавить(ТабличнаяЧасть.СтандартныеРеквизиты);
	Если Не ЭтоСтандартнаяТабличнаяЧасть Тогда
		Результат.Добавить(ТабличнаяЧасть.Реквизиты);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ГруппыИЭлементыПоИспользованию(ОписаниеИспользования)

	Если ОписаниеИспользования = ИспользованиеГруппИЭлементов.Группы Тогда
		Результат = ГруппыИЭлементы.Группы;
	ИначеЕсли ОписаниеИспользования = ИспользованиеГруппИЭлементов.ГруппыИЭлементы Тогда
		Результат = ГруппыИЭлементы.ГруппыИЭлементы;
	ИначеЕсли ОписаниеИспользования = ИспользованиеГруппИЭлементов.Элементы Тогда
		Результат = ГруппыИЭлементы.Элементы;
	Иначе
		Результат = ГруппыИЭлементы.Авто;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПодготовитьСтраницуДвижений(ПересоздатьРеквизиты)
	
	_ИмяНабораЗаписей = "";
	ВидимостьРазделаДвижения = Ложь;
	ОбновитьНаборЗаписейНаСервере();

	Если мОбъектСсылка <> Неопределено Тогда
		ОбъектМетаданных = мОбъектСсылка.Метаданные();

		Если УИ_ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
			Если ОбъектМетаданных.Движения.Количество() > 0 Тогда
				ВидимостьРазделаДвижения = Истина;
				Если ПересоздатьРеквизиты Тогда
					_ПроведениеРазрешено = (ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить);

					СписокНабораЗаписей = Элементы._ИмяНабораЗаписей.СписокВыбора;
					СписокНабораЗаписей.Очистить();
					КэшИменРегистров = Новый Соответствие;
					Для Каждого ОбъектРегистрМД Из ОбъектМетаданных.Движения Цикл
						ПолноеИмяРегистра = ОбъектРегистрМД.ПолноеИмя();
						Если КэшИменРегистров[ПолноеИмяРегистра] = Неопределено Тогда
								// Защита от кривых конфигураций
							КэшИменРегистров[ПолноеИмяРегистра] = 1;
							СписокНабораЗаписей.Добавить(ПолноеИмяРегистра, ОбъектРегистрМД.Представление());
						КонецЕсли;
					КонецЦикла;
					СписокНабораЗаписей.СортироватьПоЗначению();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Элементы.СтраницаДвиженияДокумента.Видимость = ВидимостьРазделаДвижения;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксСтраницы()
	Возврат "Страница";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксКомандыОчиститьТаблицу()
	Возврат "_ОчиститьТаблицу_";
КонецФункции

&НаСервере
Процедура ЗаполнитьИменаПредопределенныхДанных(ОбъектМетаданных)
	
	ЭтоПланСчетов = УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных);
	ЭтоПланВидовРасчета = УИ_ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных);
	ЭтоПланВидовХарактеристик = УИ_ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных);
	ЭтоСправочник = УИ_ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных);
	Если ЭтоПланСчетов Или ЭтоПланВидовРасчета Или ЭтоПланВидовХарактеристик Или ЭтоСправочник Тогда
		ЗначенияПредопределенных = Новый Массив(ОбъектМетаданных.ПолучитьИменаПредопределенных());
		ИменаПредопределенныхДанных.ЗагрузитьЗначения(ЗначенияПредопределенных);
	Иначе
		ИменаПредопределенныхДанных.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЭлементыТабличныхЧастейОбъекта(ТабличныеЧастиПредыдущие, ТипыДанныхРеквизитов)
	
	ПрефиксСтраницы = ПрефиксСтраницы();
	Если ОбъектСсылкаПредыдущий <> Неопределено Тогда
		Для Каждого ИмяНаФорме Из ТабличныеЧастиПредыдущие Цикл
			ИмяСтраницы = ПрефиксСтраницы + ИмяНаФорме;
			СтраницаДляУдаления = Элементы.Найти(ИмяСтраницы);
			Если СтраницаДляУдаления <> Неопределено Тогда
				Элементы.Удалить(СтраницаДляУдаления);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если мОбъектСсылка <> Неопределено Тогда
		ИмяРеквизитаНомерСтроки = "НомерСтроки";
		ШаблонПутиКРеквизиту = "%1.%2";
		Для Каждого ТабличнаяЧасть Из ТабличныеЧастиОбъекта Цикл
			
			ИмяТаблицы = ТабличнаяЧасть.ИмяНаФорме;
			ИмяСтраницы = ПрефиксСтраницы + ИмяТаблицы;

			ОписаниеСтраницы = УИ_РаботаСФормами.НовыйОписаниеГруппыФормы();
			ОписаниеСтраницы.Имя = ИмяСтраницы;
			ОписаниеСтраницы.Родитель = Элементы.СтраницыТабличныхЧастейОбъекта;
			ОписаниеСтраницы.ОтображатьЗаголовок = Истина;
			ОписаниеСтраницы.Вид = ВидГруппыФормы.Страница;
			ОписаниеСтраницы.Заголовок = ТабличнаяЧасть.Имя;
			НоваяСтраница = УИ_РаботаСФормами.СоздатьГруппуПоОписанию(ЭтотОбъект, ОписаниеСтраницы);

			ШаблонОформленияЭФ = Элементы.ДекорацияРеквизитыОбъекта;
			ЭФ = Элементы.Добавить(СтрШаблон("Надпись_%1", ИмяТаблицы), Тип("ДекорацияФормы"), НоваяСтраница);
			ЭФ.Вид = ВидДекорацииФормы.Надпись;
			ЭФ.ЦветТекста = ШаблонОформленияЭФ.ЦветТекста;
			ЭФ.Шрифт = ШаблонОформленияЭФ.Шрифт;
			ЭФ.АвтоМаксимальнаяШирина = Ложь;
			ЭФ.РастягиватьПоГоризонтали = Истина;
			ЭФ.Заголовок = СтрШаблон("%1: %2", ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление);

			НоваяТаблица = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), НоваяСтраница);
			НоваяТаблица.ПутьКДанным = ИмяТаблицы;
			НоваяТаблица.Подвал = ПоказыватьИтогиПоЧисловымКолонкам;
			
			ПараметрыПоиска = Новый Структура("ИмяТабличнойЧасти", ТабличнаяЧасть.Имя);
			Реквизиты = РеквизитыТабличныхЧастейОбъекта.НайтиСтроки(ПараметрыПоиска);
			Для Каждого Реквизит Из Реквизиты Цикл
				НоваяКолонка = Элементы.Добавить(Реквизит.ИмяНаФорме, Тип("ПолеФормы"), НоваяТаблица);
				НоваяКолонка.ПутьКДанным = СтрШаблон(ШаблонПутиКРеквизиту, ИмяТаблицы, Реквизит.Имя);
				НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
				НоваяКолонка.КнопкаОчистки = Истина;
				НоваяКолонка.КнопкаВыбора = Истина;
				НоваяКолонка.ТолькоПросмотр = Реквизит.ТолькоПросмотр;
				НоваяКолонка.ДоступныеТипы = Реквизит.Тип;
				НоваяКолонка.ВыбиратьТип = Ложь;
				НоваяКолонка.ВыборГруппИЭлементов = ГруппыИЭлементыПоИспользованию(Реквизит.ВыборГруппИЭлементов);
				НоваяКолонка.УстановитьДействие("НачалоВыбора", "Подключаемый_ТабличнаяЧастьРеквизитНачалоВыбора");
				НоваяКолонка.УстановитьДействие("Очистка", "Подключаемый_ТабличнаяЧастьРеквизитОчистка");
				ЗаполнениеПодвалаЧисловойКолонки(ИмяТаблицы, НоваяКолонка, Реквизит);
			КонецЦикла;
			
			КолонкаНомерСтроки = Элементы[ИмяТаблицы + ИмяРеквизитаНомерСтроки];
			КолонкаНомерСтроки.АвтоМаксимальнаяШирина = Ложь;
			КолонкаНомерСтроки.МаксимальнаяШирина = 5;
			КолонкаНомерСтроки.Заголовок = НСтр("ru = 'N'");

			НоваяТаблица.УстановитьДействие("ПриОкончанииРедактирования",
											"Подключаемый_ТабличнаяЧастьПриОкончанииРедактирования");
			НоваяТаблица.УстановитьДействие("ПослеУдаления", "Подключаемый_ТабличнаяЧастьПослеУдаления");
			//@skip-check bsl-legacy-check-string-literal
			НоваяТаблица.УстановитьДействие("ПриИзменении", "Подключаемый_ТабличнаяЧастьПриИзменении");
			
			// Заполнение контекстного меню
			ГруппаКнопок = Элементы.Добавить(СтрШаблон("Группа_%1", ИмяТаблицы), Тип("ГруппаФормы"),
				НоваяТаблица.КонтекстноеМеню);
			ГруппаКнопок.Вид = ВидГруппыФормы.ГруппаКнопок;

			Кнопка = Элементы.Добавить(СтрШаблон("_ВставитьСсылкуНаОбъект_%1", ИмяТаблицы), Тип("КнопкаФормы"),
				ГруппаКнопок);
			Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Кнопка.ИмяКоманды = "_ВставитьСсылкуНаОбъект";

			Кнопка = Элементы.Добавить(СтрШаблон("_ВставитьУникальныйИдентификатор_%1", ИмяТаблицы), Тип("КнопкаФормы"),
				ГруппаКнопок);
			Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Кнопка.ИмяКоманды = "_ВставитьУникальныйИдентификатор";

			Кнопка = Элементы.Добавить(СтрШаблон("ОткрытьОбъект_%1", ИмяТаблицы), Тип("КнопкаФормы"), ГруппаКнопок);
			Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Кнопка.ИмяКоманды = "ОткрытьОбъект";
			
			ДобавитьКомандуОчисткиТаблицы(НоваяТаблица, ИмяТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПодвалаЧисловойКолонки(ИмяТаблицы, КолонкаТаблицы, РеквизитТаблицы)
	
	Если ПоказыватьИтогиПоЧисловымКолонкам Тогда
		Если РеквизитТаблицы.ИспользоватьИтоги Тогда
			КолонкаТаблицы.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			КолонкаТаблицы.ЦветТекстаПодвала = ЦветаСтиля.ЦветФонаВыделенияПоля;
			Если ИспользоватьЖирныйШрифтДляИтогов Тогда
				КолонкаТаблицы.ШрифтПодвала = Новый Шрифт(КолонкаТаблицы.Шрифт, , , Истина);
			КонецЕсли;
			ИмяКнопки = СтрШаблон("_%1_ПересчитатьИтогиПоКолонкам", ИмяТаблицы);
			Если Элементы.Найти(ИмяКнопки) = Неопределено Тогда
				НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы[ИмяТаблицы].КоманднаяПанель);
				НоваяКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
				НоваяКнопка.ИмяКоманды = "_ПересчитатьИтогиПоКолонкам";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуОбъекта(Ссылка)
	// На некоторых платформах возникает ошибка при получении НавСсылки определенных объектов (на пример, счета БУ)
	Попытка
		Возврат ПолучитьНавигационнуюСсылку(Ссылка);
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИерархияГруппИЭлементов(ОбъектМетаданных)

	Если УИ_ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Результат = (ОбъектМетаданных.Иерархический
					 И ОбъектМетаданных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
	ИначеЕсли УИ_ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Результат = ОбъектМетаданных.Иерархический;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеОбъекта(ПересоздатьРеквизиты)

	ВидОбъекта = УИ_ОбщегоНазначения.ВидОбъектаПоСсылке(мОбъектСсылка);
	ОбъектМетаданных = мОбъектСсылка.Метаданные();
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	ТипОбъектаРедактирования = ПолноеИмя;
	
	_UUID = мОбъектСсылка.УникальныйИдентификатор();
	_URL  = ПолучитьНавигационнуюСсылкуОбъекта(мОбъектСсылка);
	_ДатаСозданияОбъекта = ДатаСозданияГУИД(_UUID);
	
	Если ПересоздатьРеквизиты Тогда
		ЗаполнитьИменаПредопределенныхДанных(ОбъектМетаданных);	
	КонецЕсли;
	ТипыДанныхРеквизитов = ТипыДанныхРеквизитов();
	ЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, ПолноеИмя, ТипыДанныхРеквизитов);	
	ЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, ВидОбъекта, ТипыДанныхРеквизитов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеЗначенияРеквизитаОбъекта()
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", "");
	Описание.Вставить("Категория", 1);
	Описание.Вставить("Тип", Новый ОписаниеТипов());
	Описание.Вставить("Значение", Неопределено);
	Описание.Вставить("Представление", "");
	Описание.Вставить("Использование", Истина);
	Описание.Вставить("ТолькоПросмотр", Ложь);
	Описание.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	Описание.Вставить("ОграничениеВыбораЗначенияОписанияТипов", Новый ОписаниеТипов());
	Возврат Описание;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИспользоватьРеквизит(ЭтоИерархияГруппИЭлементов, ЭтоГруппа, Реквизит)

	Результат = Истина;
	Если ЭтоИерархияГруппИЭлементов Тогда
		ИспользованиеРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита;

		НекорретныеДанные = ЭтоГруппа
							И Реквизит.Использование = ИспользованиеРеквизита.ДляЭлемента
							Или Не ЭтоГруппа
								И Реквизит.Использование = ИспользованиеРеквизита.ДляГруппы;
		Если НекорретныеДанные Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ИспользоватьТабличнуюЧасть(ОбъектМетаданных, ТабличнаяЧасть, ЭтоИерархияГруппИЭлементов, ЭтоГруппа,
	ЭтоПланСчетов)

	Результат = Истина;
	Если ЭтоИерархияГруппИЭлементов Тогда
		Если ТабличнаяЧасть.Категория = 0 Тогда
			ТабличныеЧасти = ОбъектМетаданных.СтандартныеТабличныеЧасти;
		Иначе
			ТабличныеЧасти = ОбъектМетаданных.ТабличныеЧасти;
		КонецЕсли;
		ТабличнаяЧастьМетаданных = ТабличныеЧасти[ТабличнаяЧасть.Имя];
		ИспользованиеРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита;
		ТаблицаИспользуется = Не (ЭтоГруппа
								  И ТабличнаяЧастьМетаданных.Использование = ИспользованиеРеквизита.ДляЭлемента
								  Или Не ЭтоГруппа
								  И ТабличнаяЧастьМетаданных.Использование = ИспользованиеРеквизита.ДляГруппы);
		Если Не ТаблицаИспользуется Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;

	ПланСчетовБезСубконто = (ЭтоПланСчетов
							 И НРег(ТабличнаяЧасть.Имя) = НРег("ВидыСубконто")
							 И ОбъектМетаданных.МаксКоличествоСубконто = 0);
	Если ПланСчетовБезСубконто Тогда
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Добавить значение реквизита объекта.
// 
// Параметры:
//  ОписаниеЗначенияРеквизита - Структура - Описание значения реквизита:
// * Имя - Строка - имя реквизита
// * Категория - Число - категория реквизита, 0 - стандартный реквизит, 1 - реквизит
// * Тип - ОписаниеТипов - описание типа для текущего реквизита
// * Значение - Произвольный - значение реквизита
// * Представление - Строка - представление реквизита
// * Использование - Булево - использование реквизита
// * ТолькоПросмотр - Булево - будет ли возможность редактировать значение реквизита
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции - Добавить значение реквизита объекта
&НаСервере
Функция ДобавитьЗначениеРеквизитаОбъекта(ОписаниеЗначенияРеквизита)

	НоваяСтрока = РеквизитыОбъекта.Добавить();
	НоваяСтрока.Имя = ОписаниеЗначенияРеквизита.Имя;
	НоваяСтрока.Представление = ?(ПустаяСтрока(ОписаниеЗначенияРеквизита.Представление),
								  ОписаниеЗначенияРеквизита.Имя,
								  ОписаниеЗначенияРеквизита.Представление);
	НоваяСтрока.Категория = ОписаниеЗначенияРеквизита.Категория;

	НоваяСтрока.ТипЗначения = ОписаниеЗначенияРеквизита.Тип;
	ТипыДанныхРеквизитов = ТипыДанныхРеквизитов();
	НоваяСтрока.ТипСтрокой = ПредставлениеОписанияТипа(НоваяСтрока.ТипЗначения, ТипыДанныхРеквизитов);
	НоваяСтрока.ТолькоПросмотр = ОписаниеЗначенияРеквизита.ТолькоПросмотр;
	НоваяСтрока.Использование = ОписаниеЗначенияРеквизита.Использование;
	НоваяСтрока.Значение = ОписаниеЗначенияРеквизита.Значение;
	НоваяСтрока.ВыборГруппИЭлементов = ОписаниеЗначенияРеквизита.ВыборГруппИЭлементов;
	НоваяСтрока.ОграничениеВыбораЗначенияОписанияТипов = ОписаниеЗначенияРеквизита.ОграничениеВыбораЗначенияОписанияТипов;

	Возврат НоваяСтрока;

КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыОбъекта(ОбъектМетаданных, ПолноеИмя, ТипыДанныхРеквизитов)

	ЭтоПланСчетов = УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных);
	ЭтоЗадача = УИ_ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных);
	ДанныеПоОбщимРеквизитам = УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
	ОбщиеРеквизиты = ДанныеПоОбщимРеквизитам.НайтиСтроки(Новый Структура("Объект", ПолноеИмя));

	ЗначенияРеквизитов = ЗначенияРеквизитовОбъекта(мОбъектСсылка,
												   ОбъектМетаданных,
												   ПолноеИмя,
												   ОбщиеРеквизиты,
												   ЭтоПланСчетов,
												   ЭтоЗадача);

	ЕстьИмяПредопределенныхДанных = Ложь;
	ЕстьЭтоГруппа = Ложь;
	ДобавитьЗначениеСтандартныхРеквизитовОбъекта(ОбъектМетаданных,
												 ЗначенияРеквизитов,
												 ЕстьИмяПредопределенныхДанных,
												 ЕстьЭтоГруппа);

	Если ЕстьИмяПредопределенныхДанных Тогда
		ЗначенияРеквизитов.Свойство("ИмяПредопределенныхДанных", _ИмяПредопределенныхДанных);
	Иначе
		_ИмяПредопределенныхДанных = "";
	КонецЕсли;
	Если ЕстьЭтоГруппа Тогда
		ЭтоГруппа = ЗначенияРеквизитов.ЭтоГруппа;
	Иначе
		ЭтоГруппа = Ложь;
	КонецЕсли;

	Для Каждого Реквизит Из ОбщиеРеквизиты Цикл
		ОписаниеРеквизита = ОписаниеЗначенияРеквизитаОбъекта();
		ОписаниеРеквизита.Имя = Реквизит.Имя;
		ОписаниеРеквизита.Тип = Реквизит.Тип;
		ОписаниеРеквизита.Представление = Реквизит.Представление;
		ОписаниеРеквизита.Значение = ЗначенияРеквизитов[Реквизит.Имя];
		ОписаниеРеквизита.ВыборГруппИЭлементов = Реквизит.ВыборГруппИЭлементов;
		ДобавитьЗначениеРеквизитаОбъекта(ОписаниеРеквизита);
	КонецЦикла;

	ЭтоИерархияГруппИЭлементов = ЭтоИерархияГруппИЭлементов(ОбъектМетаданных);
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		ОписаниеРеквизита = ОписаниеЗначенияРеквизитаОбъекта();
		ОписаниеРеквизита.Имя = Реквизит.Имя;
		ОписаниеРеквизита.Тип = Реквизит.Тип;
		ОписаниеРеквизита.Представление = Реквизит.Представление();
		ОписаниеРеквизита.Значение = ЗначенияРеквизитов[Реквизит.Имя];
		ОписаниеРеквизита.Использование = ИспользоватьРеквизит(ЭтоИерархияГруппИЭлементов, ЭтоГруппа, Реквизит);
		ОписаниеРеквизита.ВыборГруппИЭлементов = Реквизит.ВыборГруппИЭлементов;
		ДобавитьЗначениеРеквизитаОбъекта(ОписаниеРеквизита);
	КонецЦикла;

	Если ЭтоПланСчетов Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.ПризнакиУчета Цикл
			ОписаниеРеквизита = ОписаниеЗначенияРеквизитаОбъекта();
			ОписаниеРеквизита.Имя = Реквизит.Имя;
			ОписаниеРеквизита.Тип = Реквизит.Тип;
			ОписаниеРеквизита.Представление = Реквизит.Представление();
			ОписаниеРеквизита.Значение = ЗначенияРеквизитов[Реквизит.Имя];
			ОписаниеРеквизита.ВыборГруппИЭлементов = Реквизит.ВыборГруппИЭлементов;
			ДобавитьЗначениеРеквизитаОбъекта(ОписаниеРеквизита);
		КонецЦикла;
	КонецЕсли;

	Если ЭтоЗадача Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.РеквизитыАдресации Цикл
			ОписаниеРеквизита = ОписаниеЗначенияРеквизитаОбъекта();
			ОписаниеРеквизита.Имя = Реквизит.Имя;
			ОписаниеРеквизита.Тип = Реквизит.Тип;
			ОписаниеРеквизита.Представление = Реквизит.Представление();
			ОписаниеРеквизита.Значение = ЗначенияРеквизитов[Реквизит.Имя];
			ОписаниеРеквизита.ВыборГруппИЭлементов = Реквизит.ВыборГруппИЭлементов;
			ДобавитьЗначениеРеквизитаОбъекта(ОписаниеРеквизита);
		КонецЦикла;
	КонецЕсли;

	РеквизитыОбъекта.Сортировать("Категория, Имя");

КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеСтандартныхРеквизитовОбъекта(ОбъектМетаданных, Знач ЗначенияРеквизитов,
	ЕстьИмяПредопределенныхДанных, ЕстьЭтоГруппа)
	
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		ОписаниеРеквизита = ОписаниеЗначенияРеквизитаОбъекта();
		ОписаниеРеквизита.Имя = Реквизит.Имя;
		ОписаниеРеквизита.Тип = Реквизит.Тип;
		ОписаниеРеквизита.Представление = Реквизит.Представление();
		ОписаниеРеквизита.Значение = ЗначенияРеквизитов[Реквизит.Имя];
		ОписаниеРеквизита.Категория = 0;
		ОписаниеРеквизита.ТолькоПросмотр = ЭтоРеквизитТолькоДляЧтения(Реквизит);
		Если Реквизит.Имя = "ТипЗначения" Тогда
			ОписаниеРеквизита.ОграничениеВыбораЗначенияОписанияТипов = ОбъектМетаданных.Тип;
		КонецЕсли;
		Если Реквизит.Имя = "Родитель" Тогда
			ОписаниеРеквизита.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		КонецЕсли;
		ДобавитьЗначениеРеквизитаОбъекта(ОписаниеРеквизита);
		Если Реквизит.Имя = "ИмяПредопределенныхДанных" Тогда
			ЕстьИмяПредопределенныхДанных = Истина;
		КонецЕсли;
		Если Реквизит.Имя = "ЭтоГруппа" Тогда
			ЕстьЭтоГруппа = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, ОбъектМетаданных, ПолноеИмя, ОбщиеРеквизиты, ЭтоПланСчетов,
	ЭтоЗадача)

	СписокРеквизитов = Новый Структура;
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		СписокРеквизитов.Вставить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из ОбщиеРеквизиты Цикл
		СписокРеквизитов.Вставить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		СписокРеквизитов.Вставить(Реквизит.Имя);
	КонецЦикла;
	Если ЭтоПланСчетов Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.ПризнакиУчета Цикл
			СписокРеквизитов.Вставить(Реквизит.Имя);
		КонецЦикла;
	КонецЕсли;
	Если ЭтоЗадача Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.РеквизитыАдресации Цикл
			СписокРеквизитов.Вставить(Реквизит.Имя);
		КонецЦикла;
	КонецЕсли;
	ЗначенияРеквизитов = УИ_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, СписокРеквизитов);
	Возврат ЗначенияРеквизитов;

КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныеЧастиОбъекта(ОбъектМетаданных, ВидОбъекта, ТипыДанныхРеквизитов)

	Если ТабличныеЧастиОбъекта.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НайденныеРеквизиты = РеквизитыОбъекта.НайтиСтроки(Новый Структура("Категория, Имя", 0, "ЭтоГруппа"));
	Если НайденныеРеквизиты.Количество() > 0 Тогда
		ЭтоГруппа = НайденныеРеквизиты[0].Значение;
	Иначе
		ЭтоГруппа = Ложь;
	КонецЕсли;
	ЭтоИерархияГруппИЭлементов = ЭтоИерархияГруппИЭлементов(ОбъектМетаданных);
	ЭтоПланСчетов = УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных);

	ШаблонЗапроса =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	&ПолноеИмяТаблицы КАК ТаблицаОбъекта
		|ГДЕ
		|	ТаблицаОбъекта.Ссылка = &Ссылка";

	ТекстыЗапроса = Новый Массив;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиОбъекта Цикл
		ТабличнаяЧасть.Использование = ИспользоватьТабличнуюЧасть(ОбъектМетаданных,
																  ТабличнаяЧасть,
																  ЭтоИерархияГруппИЭлементов,
																  ЭтоГруппа,
																  ЭтоПланСчетов);
		Если ТабличнаяЧасть.Использование Тогда
			ПолноеИмяТаблицы = СтрШаблон("%1.%2.%3", ВидОбъекта, ОбъектМетаданных.Имя, ТабличнаяЧасть.Имя);
			ТекстыЗапроса.Добавить(СтрЗаменить(ШаблонЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицы));
		Иначе
			ЭтотОбъект[ТабличнаяЧасть.ИмяНаФорме].Очистить();
		КонецЕсли;
	КонецЦикла;
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапроса, УИ_ОбщегоНазначения.РазделительПакетаЗапросов()));
	Запрос.УстановитьПараметр("Ссылка", мОбъектСсылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ИспользуемыеТабличныеЧасти = ТабличныеЧастиОбъекта.НайтиСтроки(Новый Структура("Использование", Истина));
	НомерПакета = 0;
	Для Каждого ТабличнаяЧасть Из ИспользуемыеТабличныеЧасти Цикл
		ТаблицаРезультата = РезультатЗапроса[НомерПакета].Выгрузить();
		ЗначениеВРеквизитФормы(ТаблицаРезультата, ТабличнаяЧасть.ИмяНаФорме);
		Если ПоказыватьИтогиПоЧисловымКолонкам Тогда
			ПересчитатьИтогиПоКолонкам(ТабличнаяЧасть.ИмяНаФорме);
		КонецЕсли;
		ОбновитьЗаголовокСтраницыТабличнойЧастиНаСервере(ТабличнаяЧасть);
		НомерПакета = НомерПакета + 1;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДанныеОбъекта(Знач ПересоздатьРеквизиты)
	
	Если ПересоздатьРеквизиты Тогда
		ТипыДанныхРеквизитов = ТипыДанныхРеквизитов();
		МассивКСозданию = Новый Массив;
		МассивКУдалению = Новый Массив;
		ТабличныеЧастиПредыдущие = ТабличныеЧастиОбъекта.Выгрузить(, "ИмяНаФорме").ВыгрузитьКолонку(0);
		ПодготовитьТабличныеЧастиОбъекта(МассивКСозданию, МассивКУдалению, ТабличныеЧастиПредыдущие, ТипыДанныхРеквизитов);
		ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
		ПодготовитьЭлементыТабличныхЧастейОбъекта(ТабличныеЧастиПредыдущие, ТипыДанныхРеквизитов);
	КонецЕсли;
	
	РеквизитыОбъекта.Очистить();
	Если мОбъектСсылка <> Неопределено Тогда
		ЗаполнитьДанныеОбъекта(ПересоздатьРеквизиты);
	Иначе
		ТипОбъектаРедактирования = "";
	КонецЕсли;
		
	ПодготовитьСтраницуДвижений(ПересоздатьРеквизиты);
	УстановитьВидимостьТабличныхЧастейОбъекта();
	УстановитьВидимостьНомераСтрокиТабличныхЧастейОбъекта();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаборЗаписейНаСервере()

	_НаборЗаписей.Очистить();
	НадоИзменитьРеквизиты = (_ИмяНабораЗаписей <> _ИмяНабораЗаписейПредыдущий);

	ИмяКомандыПересчета = "__НаборЗаписей__ПересчитатьИтогиПоКолонкам";

	МассивКСозданию = Новый Массив;
	МассивКУдалению = Новый Массив;

	Если НадоИзменитьРеквизиты Тогда
		РезультатТаблица = РеквизитФормыВЗначение("_НаборЗаписей");
		Для Каждого Колонка Из РезультатТаблица.Колонки Цикл
			МассивКУдалению.Добавить("_НаборЗаписей." + Колонка.Имя);
			Элем = Элементы.Найти("_НаборЗаписей_" + Колонка.Имя);
			Если Элем <> Неопределено Тогда
				Элементы.Удалить(Элем);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если Не ПустаяСтрока(_ИмяНабораЗаписей) Тогда
		Менеджер = УИ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(_ИмяНабораЗаписей);
		Если Менеджер = Неопределено Тогда
			Если НадоИзменитьРеквизиты Тогда
				ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
			КонецЕсли;
			Возврат;
		КонецЕсли;

		Набор = Менеджер.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(мОбъектСсылка);
		Набор.Прочитать();

		РезультатТаблица = Набор.Выгрузить();

		Если ОсобыйРежимРаботыСНаборомЗаписейРБ Тогда
			НастроитьТаблицуНабораЗаписей(Набор, РезультатТаблица);
		КонецЕсли;

		Попытка
			Если НадоИзменитьРеквизиты Тогда
				ТипХЗ = Тип("ХранилищеЗначения");
				ТипТТ = Тип("Тип");
				ТипМВ = Тип("МоментВремени");
				ТипUUID = Тип("УникальныйИдентификатор");

				СтрукСпецКолонки = Новый Структура("Регистратор, МоментВремени");

				Для Каждого Колонка Из РезультатТаблица.Колонки Цикл
					Если Колонка.ТипЗначения.СодержитТип(ТипХЗ) Тогда
						ТипЗначенияРеквизита = Новый ОписаниеТипов;
					ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипТТ) Тогда
						ТипЗначенияРеквизита = Новый ОписаниеТипов;
					ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипМВ) Тогда
						ТипЗначенияРеквизита = Новый ОписаниеТипов;
					ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипUUID) Тогда
						ТипЗначенияРеквизита = вОписаниеТиповДляUUID(Колонка.ТипЗначения);
					Иначе
						ТипЗначенияРеквизита = Колонка.ТипЗначения;
					КонецЕсли;
					НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, ТипЗначенияРеквизита, "_НаборЗаписей",
						Колонка.Заголовок, Истина);
					МассивКСозданию.Добавить(НовыйРеквизит);
				КонецЦикла;

				ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
			КонецЕсли;

			ЗначениеВРеквизитФормы(РезультатТаблица, "_НаборЗаписей");

			Если НадоИзменитьРеквизиты Тогда

				Для Каждого Колонка Из РезультатТаблица.Колонки Цикл
					Если СтрукСпецКолонки.Свойство(Колонка.Имя) Тогда
						Продолжить;
					КонецЕсли;

					Элем = Элементы.Добавить("_НаборЗаписей_" + Колонка.Имя, Тип("ПолеФормы"), Элементы._НаборЗаписей);
					Элем.ПутьКДанным = "_НаборЗаписей." + Колонка.Имя;
					Элем.Вид = ВидПоляФормы.ПолеВвода;
					Элем.ДоступныеТипы = Колонка.ТипЗначения;
					Элем.КнопкаОчистки = Истина;

					Если Колонка.ТипЗначения.СодержитТип(ТипХЗ) Тогда // версия 033
						Элем.ТолькоПросмотр = Истина;
					Иначе
						Элем.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
					КонецЕсли;
				КонецЦикла;

			КонецЕсли;

			ТипЧисло = Тип("Число");
			ЕстьЧисловыеКолонки = Ложь;

			Если ПоказыватьИтогиПоЧисловымКолонкам Тогда
				Для Каждого пКолонка Из РезультатТаблица.Колонки Цикл
					Если пКолонка.Имя <> "НомерСтроки" И пКолонка.ТипЗначения.СодержитТип(ТипЧисло) Тогда
						ЕстьЧисловыеКолонки = Истина;
						ЭФ = Элементы.Найти("_НаборЗаписей_" + пКолонка.Имя);
						Если ЭФ <> Неопределено Тогда
							Если НадоИзменитьРеквизиты Тогда
								ЭФ.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
								ЭФ.ЦветТекстаПодвала = ЦветаСтиля.ЦветФонаВыделенияПоля;
								Если ИспользоватьЖирныйШрифтДляИтогов Тогда
									ЭФ.ШрифтПодвала = Новый Шрифт(ЭФ.Шрифт, , , Истина);
								КонецЕсли;
							КонецЕсли;
							ЭФ.ТекстПодвала = Строка(РезультатТаблица.Итог(пКолонка.Имя));
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				КнопкаПересчета = Элементы.Найти(ИмяКомандыПересчета);
				Если ЕстьЧисловыеКолонки Тогда
					Если КнопкаПересчета = Неопределено Тогда
						ЭФ = Элементы.Добавить(ИмяКомандыПересчета,
											   Тип("КнопкаФормы"),
											   Элементы._НаборЗаписей.КоманднаяПанель);
						ЭФ.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
						ЭФ.ИмяКоманды = "_ПересчитатьИтогиПоКолонкам";
					КонецЕсли;
				ИначеЕсли КнопкаПересчета <> Неопределено Тогда
					Элементы.Удалить(КнопкаПересчета);
				КонецЕсли;
			КонецЕсли;

			Элементы._НаборЗаписей.Подвал = ПоказыватьИтогиПоЧисловымКолонкам И ЕстьЧисловыеКолонки;

		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;

	ИначеЕсли НадоИзменитьРеквизиты Тогда
		ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
		КомандаПересчета = Элементы.Найти(ИмяКомандыПересчета);
		Если КомандаПересчета <> Неопределено Тогда
			Элементы.Удалить(КомандаПересчета);
		КонецЕсли;
	КонецЕсли;

	_ИмяНабораЗаписейПредыдущий = _ИмяНабораЗаписей;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСтандартныеТабличныеЧасти(ОбъектМетаданных)
	
	Возврат (УИ_ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных));
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьТабличныеЧасти(ОбъектМетаданных)
	
	Возврат (УИ_ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных)
		Или УИ_ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных));
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеОписанияТипа(ОписаниеТипов, Знач ТипыДанныхРеквизитов = Неопределено)

	Результат = "";
	Если ОписаниеТипов = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	ТипыДанныхРеквизитов = ?(ТипыДанныхРеквизитов = Неопределено, ТипыДанныхРеквизитов(), ТипыДанныхРеквизитов);
	ПредставленияТипов = Новый Массив;
	Типы = ОписаниеТипов.Типы();
	Для Каждого Тип Из Типы Цикл
		ИмяТипа = ПредставлениеТипа(ТипыДанныхРеквизитов, ОписаниеТипов, Тип);
		Если Не ПустаяСтрока(ИмяТипа) Тогда
			ПредставленияТипов.Добавить(ИмяТипа);
		КонецЕсли;
	КонецЦикла;
	Результат = СтрСоединить(ПредставленияТипов, ", ");
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеТипа(ТипыДанныхРеквизитов, ОписаниеТипов, Тип)
	
	ИмяТипа = "";
	Если Тип = ТипыДанныхРеквизитов.Число Тогда
		ИмяТипа = "Число";
		КвалификаторыЧисла = ОписаниеТипов.КвалификаторыЧисла;
		ОписаниеЧисла = Новый Массив;
		Если ЗначениеЗаполнено(КвалификаторыЧисла.Разрядность) Тогда
			ОписаниеРазрядности = СтрШаблон("%1.%2",
				КвалификаторыЧисла.Разрядность, КвалификаторыЧисла.РазрядностьДробнойЧасти);
			ОписаниеЧисла.Добавить(ОписаниеРазрядности);
		КонецЕсли;
		Если КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный Тогда
			ОписаниеЧисла.Добавить("+");
		КонецЕсли;
		Если ЗначениеЗаполнено(ОписаниеЧисла) Тогда
		    ИмяТипа = СтрШаблон("%1(%2)", ИмяТипа, СтрСоединить(ОписаниеЧисла, ", "));
		КонецЕсли;
	ИначеЕсли Тип = ТипыДанныхРеквизитов.Строка Тогда
		ИмяТипа = "Строка";
		КвалификаторыСтроки = ОписаниеТипов.КвалификаторыСтроки;
		Если КвалификаторыСтроки.Длина <> 0 Тогда
			ПредставлениеДлины = ?(КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Переменная, "П", "Ф");
			ИмяТипа = СтрШаблон("%1(%2%3)", ИмяТипа, ПредставлениеДлины, КвалификаторыСтроки.Длина);
		КонецЕсли;
	ИначеЕсли Тип = ТипыДанныхРеквизитов.Дата Тогда
		КвалификаторыДаты = ОписаниеТипов.КвалификаторыДаты;
		Если КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			ИмяТипа = "Время";
		ИначеЕсли КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
			ИмяТипа = "Дата";
		Иначе
			ИмяТипа = "ДатаВремя";
		КонецЕсли;
	ИначеЕсли Тип = ТипыДанныхРеквизитов.Булево Тогда
		ИмяТипа = "Булево";
	ИначеЕсли Тип = ТипыДанныхРеквизитов.ДвоичныеДанные Тогда
		ИмяТипа = "ДвоичныеДанные";
	ИначеЕсли Тип = ТипыДанныхРеквизитов.ХранилищеЗначения Тогда
		ИмяТипа = "ХранилищеЗначения";
	ИначеЕсли Тип = ТипыДанныхРеквизитов.УникальныйИдентификатор Тогда
		ИмяТипа = "УникальныйИдентификатор";
	Иначе
		ОбъектМД = Метаданные.НайтиПоТипу(Тип);
		Если ОбъектМД <> Неопределено Тогда
			ИмяТипа = ОбъектМД.ПолноеИмя();
		Иначе
			ИмяТипа = Строка(Тип);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипыДанныхРеквизитов()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Число", Тип("Число"));
	Результат.Вставить("Строка", Тип("Строка"));
	Результат.Вставить("Дата", Тип("Дата"));
	Результат.Вставить("Булево", Тип("Булево"));
	Результат.Вставить("ХранилищеЗначения", Тип("ХранилищеЗначения"));
	Результат.Вставить("УникальныйИдентификатор", Тип("УникальныйИдентификатор"));
	Результат.Вставить("ДвоичныеДанные", Тип("ДвоичныеДанные"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИзменитьВидимостьТабличныхЧастейОбъекта()
	НастройкиОбработки = СформироватьСтруктуруНастроек();
	ЗаполнитьЗначенияСвойств(НастройкиОбработки, ЭтотОбъект);
	СохранитьНастройкиОбработки(НастройкиОбработки);
	УстановитьВидимостьТабличныхЧастейОбъекта();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТабличныхЧастейОбъекта()
	ПрефиксСтраницы = ПрефиксСтраницы();
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиОбъекта Цикл
		ИмяСтраницы = ПрефиксСтраницы + ТабличнаяЧасть.ИмяНаФорме;
		СтраницаТаблицы = Элементы.Найти(ИмяСтраницы);
		Если СтраницаТаблицы <> Неопределено Тогда
			Если СкрыватьПустыеТабличныеЧасти Тогда
				ДанныеТаблицы = ЭтотОбъект[ТабличнаяЧасть.ИмяНаФорме];
				ЕстьДанные = (ДанныеТаблицы.Количество() > 0);
				СтраницаТаблицы.Видимость = ТабличнаяЧасть.Использование И ЕстьДанные;
			Иначе
				СтраницаТаблицы.Видимость = ТабличнаяЧасть.Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНомераСтрокиТабличныхЧастейОбъекта()
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиОбъекта Цикл
		ИмяКолонкиНомерСтроки = СтрШаблон("%1НомерСтроки", ТабличнаяЧасть.ИмяНаФорме);
		Колонка = Элементы.Найти(ИмяКолонкиНомерСтроки);
		Если Колонка <> Неопределено Тогда
			Колонка.Видимость = ПоказыватьНомерСтрокиТЧ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОбразцуЗавершение(РезультатЗакрытия, ДопПарам = Неопределено) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ПредыдущаяСсылка = мОбъектСсылка;
		мОбъектСсылка = РезультатЗакрытия;

		ИнформацияОПредопределенныхДанных = ИнформацияОПредопределенныхДанных();

		Попытка
			ЗаполнитьДанныеОбъектаСсылки();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;

		Если ИнформацияОПредопределенныхДанных.ЕстьДанные Тогда
			СтруктураПоиска = Новый Структура("Категория, Имя", 0, "ИмяПредопределенныхДанных");
			НайденныеСтроки = РеквизитыОбъекта.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Значение = ИнформацияОПредопределенныхДанных.Значение;
			КонецЕсли;
		КонецЕсли;

		мОбъектСсылка = ПредыдущаяСсылка;
		_UUID = мОбъектСсылка.УникальныйИдентификатор();
		_URL  = ПолучитьНавигационнуюСсылкуОбъекта(мОбъектСсылка);
		_ДатаСозданияОбъекта = ДатаСозданияГУИД(_UUID);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСсылкуДляОбъекта(ОбъектЗаполнения, Знач UUIDСтрокой)

	Если УИ_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(UUIDСтрокой) Тогда
		УИД = Новый УникальныйИдентификатор(UUIDСтрокой);
		Если Не ЗначениеЗаполнено(УИД) Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Неправильное значение UUID'"));
		Возврат Ложь;
	КонецЕсли;

	ОбъектМетаданных = ОбъектЗаполнения.Метаданные();
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Попытка
		МенеджерОбъекта = УИ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = '%1 - данный тип не обрабатывается!'"), ПолноеИмя);
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

	Попытка
		НоваяСсылка = МенеджерОбъекта.ПолучитьСсылку(УИД);
		ОбъектЗаполнения.УстановитьСсылкуНового(НоваяСсылка);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось установить ссылку для нового объекта!
									 |%1'"), ПредставлениеОшибки);
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьИмяПредопределенныхДанных()
	
	НайденныеСтроки = РеквизитыОбъекта.НайтиСтроки(Новый Структура("Категория, Имя", 0, "ИмяПредопределенныхДанных"));
	Если НайденныеСтроки.Количество() <> 0 Тогда
		НайденнаяСтрока = НайденныеСтроки[0];
		НайденнаяСтрока.Значение = СокрЛП(НайденнаяСтрока.Значение);

		Если Не ПустаяСтрока(НайденнаяСтрока.Значение) Тогда
			ПроверочнаяСтруктура = Новый Структура;
			Попытка
				ПроверочнаяСтруктура.Вставить(НайденнаяСтрока.Значение, 1);
			Исключение
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ИнформацияОПредопределенныхДанных()
	
	Результат = Новый Структура("ЕстьДанные, ЕстьИзменения, НекорректноеИмя", Ложь, Ложь, Ложь);
	Результат.Вставить("Значение");

	НайденныеСтроки = РеквизитыОбъекта.НайтиСтроки(Новый Структура("Категория, Имя", 0, "ИмяПредопределенныхДанных"));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат.ЕстьДанные = Истина;
		Если Не ПроверитьИмяПредопределенныхДанных() Тогда
			Результат.НекорректноеИмя = Истина;
		КонецЕсли;

		Результат.Значение = НайденныеСтроки[0].Значение;
		Если НайденныеСтроки[0].Значение <> _ИмяПредопределенныхДанных Тогда
			Результат.ЕстьИзменения = Истина;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьОбъектДалее(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьОбъектВБазу(Ложь) Тогда
			ОтобразитьИзменениеДанных(мОбъектСсылка, ВидИзмененияДанных.Изменение);
			Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъектКакНовыйДалее(РезультатВопроса, ДопПараметры = Неопределено) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьОбъектВБазу(Истина, ДопПараметры) Тогда
			ОтобразитьИзменениеДанных(мОбъектСсылка, ВидИзмененияДанных.Добавление);
			Если ДопПараметры <> Неопределено Тогда
				ОтобразитьИзменениеДанных(мОбъектСсылка, ВидИзмененияДанных.Изменение);
			КонецЕсли;
		Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектДалее(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОписаниеТипаОбъекта = НовоеОписаниеТипов(ТипЗнч(мОбъектСсылка));
		Если УдалитьОбъектНаСервере(мОбъектСсылка) Тогда
			ОтобразитьИзменениеДанных(мОбъектСсылка, ВидИзмененияДанных.Удаление);
			мОбъектСсылка = ОписаниеТипаОбъекта.ПривестиЗначение();
			ЗаполнитьДанныеОбъектаСсылки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаборЗаписейПродолжение(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаборЗаписейНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеБезОповещения(ТекстСообщения)
	ПоказатьПредупреждение( , ТекстСообщения);
КонецПроцедуры

&НаСервере
Процедура НайтиОбъектПоUUIDСервер()
	
	Если ПустаяСтрока(_UUID) Тогда
		Возврат;
	КонецЕсли;
	
	мОбъектСсылка = Неопределено;
	ТипОбъектаРедактирования = "";

	Если УИ_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(_UUID) Тогда
		УИД = Новый УникальныйИдентификатор(_UUID);
		Если Не ЗначениеЗаполнено(УИД) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Неправильное значение UUID'"));
		Возврат;
	КонецЕсли;

	МенеджерыОбъектов = Новый Массив;
	МенеджерыОбъектов.Добавить(Справочники);
	МенеджерыОбъектов.Добавить(Документы);
	МенеджерыОбъектов.Добавить(ПланыВидовРасчета);
	МенеджерыОбъектов.Добавить(ПланыВидовХарактеристик);
	МенеджерыОбъектов.Добавить(ПланыСчетов);
	МенеджерыОбъектов.Добавить(БизнесПроцессы);
	МенеджерыОбъектов.Добавить(Задачи);
	
	Для Каждого МенеджерОбъектов Из МенеджерыОбъектов Цикл
		Для Каждого Менеджер Из МенеджерОбъектов Цикл
			СсылкаНаОбъект = Менеджер.ПолучитьСсылку(УИД);
			Если УИ_ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
				мОбъектСсылка = СсылкаНаОбъект;
				ЗаполнитьДанныеОбъектаСсылки();
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиОбъектПоТипу_UUIDСервер()
	Если Не ПустаяСтрока(ТипОбъектаРедактирования) И Не ПустаяСтрока(_UUID) Тогда
		Если Не УИ_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(_UUID) Тогда
			УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Неправильное значение UUID'"));
			Возврат;
		КонецЕсли;

		ИмяТипа = СтрЗаменить(ТипОбъектаРедактирования, ".", "Ссылка.");
		Попытка
			мОбъектСсылка = XMLЗначение(Тип(ИмяТипа), _UUID);
		Исключение
			УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить объект по типу'"));
			Возврат;
		КонецПопытки;
		ЗаполнитьДанныеОбъектаСсылки();
	КонецЕсли;
КонецПроцедуры

// Возвращает заголовок страницы табличной части.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части
//  ДанныеТабличнойЧасти - ДанныеФормыКоллекция, ТаблицаЗначений - Данные табличной части
// 
// Возвращаемое значение:
//  Строка - новый заголовок страницы
&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокСтраницыТабличнойЧасти(ИмяТабличнойЧасти, ДанныеТабличнойЧасти)
	КоличествоСтрок = ДанныеТабличнойЧасти.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат ИмяТабличнойЧасти;
	Иначе
		Возврат СтрШаблон("%1 (%2)", ИмяТабличнойЧасти, КоличествоСтрок);
	КонецЕсли;			
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыТабличнойЧасти(ЭлементТабличнойЧасти)
	
	НайденныеТабличныеЧасти = ТабличныеЧастиОбъекта.НайтиСтроки(Новый Структура("ИмяНаФорме", ЭлементТабличнойЧасти.Имя));
	Если НайденныеТабличныеЧасти.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = НайденныеТабличныеЧасти[0];
	ДанныеТабличнойЧасти = ЭтотОбъект[ТабличнаяЧасть.ИмяНаФорме];
	ИмяСтраницы = ПрефиксСтраницы() + ТабличнаяЧасть.ИмяНаФорме;
	Элементы[ИмяСтраницы].Заголовок = ЗаголовокСтраницыТабличнойЧасти(ТабличнаяЧасть.Имя, ДанныеТабличнойЧасти);

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокСтраницыТабличнойЧастиНаСервере(Знач ТабличнаяЧасть)
	
	ДанныеТабличнойЧасти = ЭтотОбъект[ТабличнаяЧасть.ИмяНаФорме];
	ИмяСтраницы = ПрефиксСтраницы() + ТабличнаяЧасть.ИмяНаФорме;
	Элементы[ИмяСтраницы].Заголовок = ЗаголовокСтраницыТабличнойЧасти(ТабличнаяЧасть.Имя, ДанныеТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомераСтрокТабличнойЧасти(Знач ИмяЭлемента)

	ТаблицаФормы = Элементы[ИмяЭлемента];
	ТабличнаяЧасть = ЭтотОбъект[ТаблицаФормы.ПутьКДанным];
	НомерСтроки = 1;
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Строка.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ЭтоРеквизитИмяПредопределенныхДанных(ТекущиеДанные)
	
	Возврат (ТекущиеДанные.Имя = "ИмяПредопределенныхДанных" И ТекущиеДанные.Категория = 0);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоРеквизитТолькоДляЧтения(Реквизит)
	
	РеквизитыДляЧтения = Новый Массив;
	РеквизитыДляЧтения.Добавить("Ссылка");
	РеквизитыДляЧтения.Добавить("Предопределенный");
	РеквизитыДляЧтения.Добавить("ДатаОбмена");
	РеквизитыДляЧтения.Добавить("ЭтоГруппа");
	
	Возврат (ТипЗнч(Реквизит) = Тип("ОписаниеСтандартногоРеквизита")
			И РеквизитыДляЧтения.Найти(Реквизит.Имя) <> Неопределено);
	
КонецФункции

&НаКлиенте
Функция ПолучитьФормуНавигатораПоКонфигурации(ОткрытьФорму = Ложь)

	ФормаНавигатора = Неопределено;
	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл
		Для Каждого Элем Из ОткрытоеОкно.Содержимое Цикл
			Если ТипЗнч(Элем) = УИ_ОбщегоНазначенияКлиентСервер.ТипУправляемойФормы() Тогда
				Если СтрЗаканчиваетсяНа(Элем.ИмяФормы, ".УИ_НавигаторПоМетаданным.Форма.Форма") Тогда
					ФормаНавигатора = Элем;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Если ФормаНавигатора <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ОткрытьФорму И ФормаНавигатора <> Неопределено Тогда
		Если Не ФормаНавигатора.Открыта() Тогда
			Попытка
				ФормаНавигатора.Открыть();
			Исключение
				Возврат Неопределено;
			КонецПопытки;
		КонецЕсли;
		Возврат ФормаНавигатора;
	ИначеЕсли ОткрытьФорму И ФормаНавигатора = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиент.ОткрытьНавигаторПоКонфигурации();
		ФормаНавигатора = ПолучитьФормуНавигатораПоКонфигурации(ОткрытьФорму);
		Возврат ФормаНавигатора;
	Иначе
		Возврат ФормаНавигатора;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПутьКДаннымТекущегоЭлемента()

	Если ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ТекПоле = ТекущийЭлемент.ТекущийЭлемент;
		Если ТипЗнч(ТекПоле) = Тип("ПолеФормы") Тогда
			Значение = ТекПоле.ПутьКДанным;
			Поз = СтрНайти(Значение, ".");
			Если Поз <> 0 Тогда
				Значение = Сред(Значение, Поз + 1);
				Если СтрНайти(Значение, ".") = 0 Тогда
					Возврат Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
		Возврат ТекущийЭлемент.ПутьКДанным;
	КонецЕсли;

	Возврат "";
	
КонецФункции

&НаСервере
Функция ЗаписатьОбъектВБазу(Знач КакНовый = Ложь, Знач СтрокаUUID = Неопределено)
	
	Если КакНовый Тогда
		Если Не УИ_ОбщегоНазначения.СсылкаСуществует(мОбъектСсылка) Тогда
			ОбъектМД = мОбъектСсылка.Метаданные();
			ОбъектДляЗаписи = СоздатьНовыйОбъект(ОбъектМД);
			Если ОбъектДляЗаписи = Неопределено Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось создать новый объект типа %1.'"),
										   ОбъектМД.ПолноеИмя());
				УИ_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Ложь;
			КонецЕсли;
		Иначе
			ОбъектДляЗаписи = мОбъектСсылка.Скопировать();
		КонецЕсли;

		Если СтрокаUUID <> Неопределено Тогда
			Если Не УстановитьСсылкуДляОбъекта(ОбъектДляЗаписи, СтрокаUUID) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОбъектДляЗаписи = мОбъектСсылка.ПолучитьОбъект();
	КонецЕсли;

	Если ОбъектДляЗаписи = Неопределено Тогда
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить объект для записи (битая ссылка)!'"));
		Возврат Ложь;
	КонецЕсли;

	Попытка
		ОбъектМД = ОбъектДляЗаписи.Метаданные();
		
		ПараметрыОтбора = Новый Структура("Использование, ТолькоПросмотр", Истина, Ложь);
		СписокРеквизитовОбъекта = РеквизитыОбъекта.НайтиСтроки(ПараметрыОтбора);
		Для Каждого Реквизит Из СписокРеквизитовОбъекта Цикл
			ОбъектДляЗаписи[Реквизит.Имя] = Реквизит.Значение;
		КонецЦикла;

		Для Каждого ТабличнаяЧасть Из ТабличныеЧастиОбъекта Цикл
			Если Не ТабличнаяЧасть.Использование Тогда
				Продолжить;
			КонецЕсли;
			ТабличнаяЧастьОбъекта = ОбъектДляЗаписи[ТабличнаяЧасть.Имя];
			ТаблицаЗагрузки = РеквизитФормыВЗначение(ТабличнаяЧасть.ИмяНаФорме);
			ТабличнаяЧастьОбъекта.Загрузить(ТаблицаЗагрузки);
		КонецЦикла;

		ПараметрыЗаписи = УИ_ОбщегоНазначенияКлиентСервер.ПараметрыЗаписиФормы(ЭтотОбъект);
		Если УИ_ОбщегоНазначения.ЗаписатьОбъектВБазу(ОбъектДляЗаписи, ПараметрыЗаписи) Тогда
			мОбъектСсылка = ОбъектДляЗаписи.Ссылка;
			ЗаполнитьДанныеОбъектаСсылки();
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция СоздатьНовыйОбъект(ОбъектМетаданных)
	
	ИмяОбъекта = ОбъектМетаданных.Имя;
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Или Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		ЭтоИерархияГруппИЭлементов = ЭтоИерархияГруппИЭлементов(ОбъектМетаданных);

		ЭтоГруппа = Ложь;
		Если ЭтоИерархияГруппИЭлементов Тогда
			ПараметрыПоиска = Новый Структура("Категория, Имя", 0, "ЭтоГруппа");
			НайденныеРеквизиты = РеквизитыОбъекта.НайтиСтроки(ПараметрыПоиска);
			Для Каждого Реквизит Из НайденныеРеквизиты Цикл
				ЭтоГруппа = Реквизит.Значение;
			КонецЦикла;
		КонецЕсли;

		Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			Менеджер = Справочники;
		Иначе
			Менеджер = ПланыВидовХарактеристик;
		КонецЕсли;

		НовыйОбъект = ?(ЭтоГруппа, Менеджер[ИмяОбъекта].СоздатьГруппу(), Менеджер[ИмяОбъекта].СоздатьЭлемент());

	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = ПланыОбмена[ИмяОбъекта].СоздатьУзел();

	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = Документы[ИмяОбъекта].СоздатьДокумент();

	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = ПланыСчетов[ИмяОбъекта].СоздатьСчет();

	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = ПланыВидовРасчета[ИмяОбъекта].СоздатьВидРасчета();

	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = БизнесПроцессы[ИмяОбъекта].СоздатьБизнесПроцесс();

	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		НовыйОбъект = Задачи[ИмяОбъекта].СоздатьЗадачу();

	Иначе
		НовыйОбъект = Неопределено;
	КонецЕсли;

	Возврат НовыйОбъект;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьИмяТипаПоЗначению(Знач Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Неопределено") Тогда
		ИмяТипа = "Неопределено";
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		Если ОбъектМетаданных <> Неопределено Тогда
			ИмяТипа = ОбъектМетаданных.ПолноеИмя();
		Иначе
			ИмяТипа = Строка(ТипЗначения);
		КонецЕсли;
	КонецЕсли;
	Возврат ИмяТипа;
	
КонецФункции

&НаСервере
Функция УдалитьОбъектНаСервере(Знач Ссылка)
	Попытка
		ОбъектДляУдаления = Ссылка.ПолучитьОбъект();
		Если ОбъектДляУдаления = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

		Если УИ_ОбщегоНазначения.ЗаписатьОбъектВБазу(ОбъектДляУдаления,
													 УИ_ОбщегоНазначенияКлиентСервер.ПараметрыЗаписиФормы(ЭтотОбъект),
													 "НепосредственноеУдаление") Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШаблонОшибки = НСтр("ru = 'Ошибка при удалении объекта: 
							|%1'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПровестиДокументПродолжение(РезультатВопроса, ДопПараметры = Неопределено) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьДокумент(мОбъектСсылка, Истина) Тогда
			ЗаполнитьДанныеОбъектаСсылки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеПродолжение(РезультатВопроса, ДопПараметры = Неопределено) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если ЗаписатьДокумент(мОбъектСсылка, Ложь) Тогда
			ЗаполнитьДанныеОбъектаСсылки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьДокумент(Знач Ссылка, Знач Проводить = Истина)
	Режим = ?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.ОтменаПроведения);
	ДокОбъект = Ссылка.ПолучитьОбъект();
	Возврат УИ_ОбщегоНазначения.ЗаписатьОбъектВБазу(ДокОбъект,
													УИ_ОбщегоНазначенияКлиентСервер.ПараметрыЗаписиФормы(ЭтотОбъект),
													,
													Режим);
КонецФункции

&НаСервере
Процедура ЗаписатьНаборЗаписейНаСервере()
	Если Не ПустаяСтрока(_ИмяНабораЗаписей) И ЗначениеЗаполнено(мОбъектСсылка) Тогда
		Менеджер = УИ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(_ИмяНабораЗаписей);
		Если Менеджер <> Неопределено Тогда
			Набор = Менеджер.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(мОбъектСсылка);
			ПараметрыЗаписи = УИ_ОбщегоНазначенияКлиентСервер.ПараметрыЗаписиФормы(ЭтотОбъект);

			Если ПараметрыЗаписи.ЗаписьВРежимеЗагрузки Тогда
				Набор.ОбменДанными.Загрузка = Истина;
			КонецЕсли;

			Попытка
				РезультатТаблица = РеквизитФормыВЗначение("_НаборЗаписей");
				РезультатТаблица.ЗаполнитьЗначения(мОбъектСсылка, "Регистратор");
				Набор.Загрузить(РезультатТаблица);
				Набор.Записать(Истина);
				ОбновитьНаборЗаписейНаСервере();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция вОписаниеТиповДляUUID(ОписаниеТипов)
	Если ОписаниеТипов.Типы().Количество() = 1 Тогда
		НовоеОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипов, "Строка");
	Иначе
		НовоеОписаниеТипов = ОписаниеТипов;
	КонецЕсли;

	Возврат НовоеОписаниеТипов;
КонецФункции

&НаСервере
Процедура ПересчитатьИтогиПоКолонкам(Знач ИмяТабличнойЧасти)
	ТипЧисло = Тип("Число");
	РезультатТаблица = РеквизитФормыВЗначение(ИмяТабличнойЧасти);

	Если РезультатТаблица = Неопределено Тогда
		РезультатТаблица = Новый ТаблицаЗначений;
	КонецЕсли;

	Если ИмяТабличнойЧасти = "_НаборЗаписей" Тогда
		ИмяТабличнойЧасти = "_НаборЗаписей_";
		Для Каждого Колонка Из РезультатТаблица.Колонки Цикл
			Если Колонка.Имя <> "НомерСтроки" 
				И УИ_ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Колонка.ТипЗначения, ТипЧисло) Тогда
				ЭФ = Элементы.Найти(ИмяТабличнойЧасти + Колонка.Имя);
				Если ЭФ <> Неопределено Тогда
					ЭФ.ТекстПодвала = Строка(РезультатТаблица.Итог(Колонка.Имя));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ИмяБезПрефикса = Прав(ИмяТабличнойЧасти, СтрДлина(ИмяТабличнойЧасти) - СтрДлина(ПрефиксДляНовыхЭлементов));
		ПараметрыПоиска = Новый Структура("ИмяТабличнойЧасти", ИмяБезПрефикса);
		РеквизитыТабличнойЧасти = РеквизитыТабличныхЧастейОбъекта.НайтиСтроки(ПараметрыПоиска);
		Для Каждого Реквизит Из РеквизитыТабличнойЧасти Цикл
			Если Реквизит.ИспользоватьИтоги Тогда
				ЭФ = Элементы.Найти(Реквизит.ИмяНаФорме);
				Если ЭФ <> Неопределено Тогда
					ЭФ.ТекстПодвала = Строка(РезультатТаблица.Итог(Реквизит.Имя));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НовоеОформление = УсловноеОформление.Элементы.Добавить();
	Для Каждого Элемент Из Элементы.РеквизитыОбъекта.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = НовоеОформление.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элемент.Имя);
		ОформляемоеПоле.Использование = Истина;
	КонецЦикла;

	УИ_ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(НовоеОформление.Отбор,
		"РеквизитыОбъекта.Использование", ВидСравненияКомпоновкиДанных.Равно, Ложь, , Истина);
	НовоеОформление.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	НовоеОформление.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылкуНаОбъектПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Оповещение = Новый ОписаниеОповещения("ВставитьСсылкуНаОбъектЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводСтроки(Оповещение, Результат, "Введите ссылку на объект");

КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылкуНаОбъектЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СсылкаНаОбъектБазы = УИ_ОбщегоНазначения.СсылкаНаОбъектПоНавигационнойСсылке(Результат);
	Если СсылкаНаОбъектБазы <> Неопределено Тогда
		Если ДополнительныеПараметры.ДоступныеТипы.Типы().Количество() > 0 Тогда
			Если Не ДополнительныеПараметры.ДоступныеТипы.СодержитТип(ТипЗнч(СсылкаНаОбъектБазы)) Тогда
				ПредупреждениеБезОповещения(НСтр("ru = 'Неправильное значение для подстановки!'"));
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДополнительныеПараметры.Таблица) Тогда
			ТекДанные = Элементы[ДополнительныеПараметры.Таблица].ТекущиеДанные;
			Если ТекДанные <> Неопределено Тогда
				ТекДанные[ДополнительныеПараметры.Имя] = СсылкаНаОбъектБазы;
			КонецЕсли;
		Иначе
			ЭтотОбъект[ДополнительныеПараметры.Имя] = СсылкаНаОбъектБазы;
			Если ДополнительныеПараметры.Имя = "мОбъектСсылка" Тогда
				КлючУникальности = мОбъектСсылка;
				ЗаполнитьДанныеОбъектаСсылки();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВставитьСсылкуИзБуфераОбменаПродолжение(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		_URL = Результат;
		ЗаполнитьОбъектСсылкаПоURL();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВставитьУникальныйИдентификаторПродолжение(Результат, ДополнительныеПараметры) Экспорт

	ЗначениеИзБуфера = "";
	Если УИ_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Результат) Тогда
		ЗначениеИзБуфера = Результат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ВставитьУникальныйИдентификаторЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	УИ_ОбщегоНазначенияКлиент.НачатьРедактированияУникальногоИдентификатора(ЗначениеИзБуфера, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВставитьУникальныйИдентификаторЗавершение(НовыйУникальныйИдентификатор, ДополнительныеПараметры) Экспорт
	Если НовыйУникальныйИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДополнительныеПараметры.Таблица) Тогда
		ТекДанные = Элементы[ДополнительныеПараметры.Таблица].ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ТекДанные[ДополнительныеПараметры.Имя] = НовыйУникальныйИдентификатор;
		КонецЕсли;
	Иначе
		ЭтотОбъект[ДополнительныеПараметры.Имя] = НовыйУникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

// Проверка, что описание типов содержит ссылочный тип.
// 
// Параметры:
//  ОписаниеТипов - ОписаниеТипов - Описание типов
// 
// Возвращаемое значение:
//  Булево - описание типов содержит ссылочный тип
&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТиповСодержитСсылочныйТип(Знач ОписаниеТипов)

	ПримитивныеТипы = Новый Массив;
	ПримитивныеТипы.Добавить(Тип("Дата"));
	ПримитивныеТипы.Добавить(Тип("Число"));
	ПримитивныеТипы.Добавить(Тип("Булево"));
	ПримитивныеТипы.Добавить(Тип("Строка"));
	ПримитивныеТипы.Добавить(Тип("ХранилищеЗначения"));
	ПримитивныеТипы.Добавить(Тип("УникальныйИдентификатор"));

	ЕстьСсылочныйТип = Истина;
	ДоступныеТипы = ОписаниеТипов.Типы();
	Если ДоступныеТипы.Количество() > 0 Тогда
		ЕстьСсылочныйТип = Ложь;
		Для Каждого Элем Из ДоступныеТипы Цикл
			Если ПримитивныеТипы.Найти(Элем) = Неопределено Тогда
				ЕстьСсылочныйТип = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ЕстьСсылочныйТип;

КонецФункции

// Проверка описание типов поддерживает вставку уникального идентификатора.
// 
// Параметры:
//  ОписаниеТипов - ОписаниеТипов - Описание типов
// 
// Возвращаемое значение:
//  Булево - описание типов поддерживает вставку уникального идентификатора
&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТиповПоддерживаетВставкуУникальногоИдентификатора(Знач ОписаниеТипов)
	
	Результат = ОписаниеТипов.Типы().Количество() = 0
		Или ОписаниеТипов.СодержитТип(Тип("Строка"))
		Или ОписаниеТипов.СодержитТип(Тип("УникальныйИдентификатор"));
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСвойстваТабличногоПоля(Знач ИмяЭлементаФормы)
	Результат = Новый Структура("Отказ, Таблица, Поле", Истина, "", "");
	ЭлементФормы = Элементы[ИмяЭлементаФормы];

	Если ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
		Результат.Вставить("Таблица", ЭлементФормы.ПутьКДанным);

		ТекПоле = ЭлементФормы.ТекущийЭлемент;
		Если ТипЗнч(ТекПоле) = Тип("ПолеФормы") Тогда
			Значение = ТекПоле.ПутьКДанным;
			Позиция = СтрНайти(Значение, ".");
			Если Позиция <> 0 Тогда
				Значение = Сред(Значение, Позиция + 1);
				Результат.Вставить("Поле", Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Результат.Отказ = (ПустаяСтрока(Результат.Таблица) Или ПустаяСтрока(Результат.Поле));

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура НастроитьТаблицуНабораЗаписей(Знач НаборЗаписей, ТаблицаРезультата)
	Если ТаблицаРезультата = Неопределено Тогда
		ТаблицаРезультата = Новый ТаблицаЗначений;
	КонецЕсли;

	ОбъектМетаданных = НаборЗаписей.Метаданные();
	Если Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		КолонкиДляОбработки = "";
		Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
			Если Измерение.ПризнакУчета <> Неопределено Тогда
				Суффиксы = Новый Массив;
				Если Измерение.Балансовый Или Не ОбъектМетаданных.Корреспонденция Тогда
					Суффиксы.Добавить("");
				Иначе
					Суффиксы.Добавить("Дт");
					Суффиксы.Добавить("Кт");
				КонецЕсли;

				Для Каждого Суффикс Из Суффиксы Цикл
					ИмяКолонки = Измерение.Имя + Суффикс;
					СтараяКолонка = ТаблицаРезультата.Колонки.Найти(ИмяКолонки);
					Если СтараяКолонка <> Неопределено Тогда
						КолонкиДляОбработки = КолонкиДляОбработки + "," + ИмяКолонки;
						ТипЗначения = Новый ОписаниеТипов(СтараяКолонка.ТипЗначения, "NULL");
						НоваяКолонка = ТаблицаРезультата.Колонки.Вставить(ТаблицаРезультата.Колонки.Индекс(СтараяКолонка),
																		   ,
																		   ТипЗначения,
																		   СтараяКолонка.Заголовок,
																		   СтараяКолонка.Ширина);
						ТаблицаРезультата.Колонки.Удалить(СтараяКолонка);
						НоваяКолонка.Имя = ИмяКолонки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(КолонкиДляОбработки) Тогда
			КолонкиДляОбработки = Сред(КолонкиДляОбработки, 2);
			НомерСтроки = 0;
			Для Каждого Стр Из НаборЗаписей Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаРезультата[НомерСтроки], Стр, КолонкиДляОбработки);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьОтчетПоДвижениям(Знач ДокСсылка, Знач СписокРегистров, Знач КонфигурацияДопускаетДопДвижения)
	
	ЧислоТаблицВЗапросе = 200;
	Если КонфигурацияДопускаетДопДвижения Тогда
		РезультатПроверки = ОпределитьДополнительныеРегистрыДокумента(ДокСсылка);
		Если РезультатПроверки.ЕстьДанные Тогда
			Для Каждого Элемент Из РезультатПроверки.ДополнительныеРегистры Цикл
				СписокРегистров.Добавить("+" + Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ДокСсылка);

	ТекстНачалаЗапроса = 
		"ВЫБРАТЬ
		|	0 КАК Инд,
		|	100000000 КАК ПолеА
		|ГДЕ
		|	ЛОЖЬ";
	МассивЗапросов = Новый Массив;
	МассивЗапросов.Добавить(ТекстНачалаЗапроса);

	ТабРезультат = Неопределено;
	Идентификатор = 0;
	НомерТаблицы = 0;

	Для Каждого Элемент Из СписокРегистров Цикл
		НомерТаблицы = НомерТаблицы + 1;

		Если НомерТаблицы > ЧислоТаблицВЗапросе Тогда
			НомерТаблицы = 1;

			Запрос.Текст = СтрСоединить(МассивЗапросов, УИ_ОбщегоНазначения.ТекстОбъединитьВсе());
			ТабДанные = Запрос.Выполнить().Выгрузить();

			Если ТабРезультат = Неопределено Тогда
				ТабРезультат = ТабДанные;
			Иначе
				Для Каждого Стр Из ТабДанные Цикл
					ЗаполнитьЗначенияСвойств(ТабРезультат.Добавить(), Стр);
				КонецЦикла;
			КонецЕсли;

			МассивЗапросов.Очистить();
			МассивЗапросов.Добавить(ТекстНачалаЗапроса);
		КонецЕсли;

		Если Лев(Элемент.Значение, 1) = "+" Тогда
			МассивЗапросов.Добавить("ВЫБРАТЬ "
									 + Идентификатор
									 + ", КОЛИЧЕСТВО(*) ИЗ "
									 + Сред(Элемент.Значение, 2)
									 + " КАК т ГДЕ т.ДокументРегистратор = &Регистратор ИМЕЮЩИЕ КОЛИЧЕСТВО(*) > 0");
		Иначе
			МассивЗапросов.Добавить("ВЫБРАТЬ "
									 + Идентификатор
									 + ", КОЛИЧЕСТВО(*) ИЗ "
									 + Элемент.Значение
									 + " КАК т ГДЕ т.Регистратор = &Регистратор ИМЕЮЩИЕ КОЛИЧЕСТВО(*) > 0");
		КонецЕсли;
		Идентификатор = Идентификатор + 1;
	КонецЦикла;

	Запрос.Текст = СтрСоединить(МассивЗапросов, УИ_ОбщегоНазначения.ТекстОбъединитьВсе());
	ТабДанные = Запрос.Выполнить().Выгрузить();

	Если ТабРезультат = Неопределено Тогда
		ТабРезультат = ТабДанные;
	Иначе
		Для Каждого Стр Из ТабДанные Цикл
			ЗаполнитьЗначенияСвойств(ТабРезультат.Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;

	Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);

	ТабличныйДокумент = Новый ТабличныйДокумент;

	ТабличныйДокумент.Область( , 1, , 1).ШиринаКолонки = 2;
	ТабличныйДокумент.Область( , 2, , 2).ШиринаКолонки = 50;
	ТабличныйДокумент.Область( , 3, , 3).ШиринаКолонки = 50;
	ТабличныйДокумент.Область( , 4, , 4).ШиринаКолонки = 12;

	ТабличныйДокумент.Область(2, 2).Текст = Строка(ДокСсылка);
	ТабличныйДокумент.Область(2, 2, 2, 3).Обвести( , , , Линия1);

	ТабличныйДокумент.Область(4, 2).Текст = "Имя регистра";
	ТабличныйДокумент.Область(4, 3).Текст = "Представление";
	ТабличныйДокумент.Область(4, 4).Текст = "Число записей";
	ТабличныйДокумент.Область(4, 2, 4, 4).ЦветФона = WebЦвета.СветлоЖелтыйЗолотистый;
	ТабличныйДокумент.Область(4, 2, 4, 4).Обвести(Линия1, Линия1, Линия1, Линия1);

	ПорядковыйНомер = 4;
	Для Каждого Стр Из ТабРезультат Цикл
		ПорядковыйНомер = ПорядковыйНомер + 1;
		ИмяРегистра = СписокРегистров[Стр.Инд].Значение;
		ЭтоДопДвижение = КонфигурацияДопускаетДопДвижения И (Лев(ИмяРегистра, 1) = "+");

		ТабличныйДокумент.Область(ПорядковыйНомер, 2).Текст = ?(ЭтоДопДвижение, Сред(ИмяРегистра, 2), ИмяРегистра);
		ТабличныйДокумент.Область(ПорядковыйНомер, 3).Текст = СписокРегистров[Стр.Инд].Представление;
		ТабличныйДокумент.Область(ПорядковыйНомер, 4).Текст = Стр.ПолеА;

		Если ЭтоДопДвижение Тогда
			ТабличныйДокумент.Область(ПорядковыйНомер, 2, ПорядковыйНомер, 4).ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
	КонецЦикла;

	ТабличныйДокумент.Область(4, 2, ПорядковыйНомер, 4).Обвести(Линия1, Линия1, Линия1, Линия1);

	Возврат ТабличныйДокумент;
	
КонецФункции

&НаКлиенте
Процедура вОбработатьКомандуЗагрузкиДанныхXML(РезультатЗакрытия = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Если РезультатЗакрытия.ЗагружатьДанныеБезИспользованияФайла Тогда
			СтрокаXML = РезультатЗакрытия.ДанныеXML;
			Если Не ПустаяСтрока(СтрокаXML) Тогда
				РезультатЗакрытия.ДанныеXML = "";
				вЗагрузитьДанныеXML(РезультатЗакрытия, СтрокаXML);
			КонецЕсли;

			Возврат;
		КонецЕсли;

		ПутьКФайлуXML = РезультатЗакрытия.ПутьКФайлуXML;
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Параметры", РезультатЗакрытия);
		Оповещение = Новый ОписаниеОповещения("вПослеОкончанияЧтенияФайла", ЭтотОбъект, ПараметрыОповещения);
		НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ПутьКФайлуXML);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вПослеОкончанияЧтенияФайла(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	Если ДвоичныеДанные <> Неопределено И ДвоичныеДанные.Размер() <> 0 Тогда
		вЗагрузитьДанныеXML(ДополнительныеПараметры.Параметры, ДвоичныеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РежимыРаботыВыгрузкиОбъекта()
	
	Режимы = Новый Структура();
	Режимы.Вставить("ВыгрузкаОбъекта", 1);
	Режимы.Вставить("ВыгрузкаОбъектаСДвижениями", 2);
	Режимы.Вставить("ВыгрузкаОбъектаТолькоДвижения", 3);
	Режимы.Вставить("ВыгрузкаНабораЗаписей", 4);
	Возврат Режимы;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыгрузкиОбъекта(РежимРаботы)
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		ПредупреждениеБезОповещения(НСтр("ru = 'Не задан документ для выгрузки'"));
		Возврат;
	КонецЕсли;

	РежимыРаботыВыгрузкиОбъекта = РежимыРаботыВыгрузкиОбъекта();
	ПараметрыОткрытия = Новый Структура("_Режим, _ИмяФайла", РежимРаботы, "ДанныеXML");
	Если РежимРаботы = РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъекта Тогда
		ПараметрыОткрытия._ИмяФайла = "Объект";
	ИначеЕсли РежимРаботы = РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъектаСДвижениями Тогда
		ПараметрыОткрытия._ИмяФайла = "Объект (с движениями)";
	ИначеЕсли РежимРаботы = РежимыРаботыВыгрузкиОбъекта.ВыгрузкаОбъектаТолькоДвижения Тогда
		ПараметрыОткрытия._ИмяФайла = "Объект (движения)";
	ИначеЕсли РежимРаботы = РежимыРаботыВыгрузкиОбъекта.ВыгрузкаНабораЗаписей Тогда
		ПараметрыОткрытия._ИмяФайла = _ИмяНабораЗаписей;
	Иначе
		ТекстОшибки = НСтр("ru = 'Указан неизвестный режим работы выгрузки объекта'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ВыгрузитьОбъектВФайл", ЭтотОбъект);
	ОткрытьФорму("Обработка.УИ_РедакторРеквизитовОбъекта.Форма.ФормаВыгрузкаОбъектаXML",
				 ПараметрыОткрытия, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектВФайл(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Режим = РезультатЗакрытия.Режим;
		СтрокаXML = СформироватьВыгрузкуXML(мОбъектСсылка,
											 Режим,
											 _ИмяНабораЗаписей,
											 Не РезультатЗакрытия.ВыгружатьДанныеБезИспользованияФайла);
		Если СтрокаXML <> Неопределено Тогда
			Если РезультатЗакрытия.ВыгружатьДанныеБезИспользованияФайла Тогда
				ТДок = Новый ТекстовыйДокумент;
				ТДок.УстановитьТекст(СтрокаXML);
				ТДок.Показать("ДанныеXML");
			Иначе
				ИмяФайла = РезультатЗакрытия.ПутьКФайлуXML;
				СтрокаXML.НачатьЗапись(Новый ОписаниеОповещения("ПослеОкончанияЗаписиФайла", ЭтотОбъект), ИмяФайла);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияЗаписиФайла(ДополнительныеПараметры) Экспорт
	ПредупреждениеБезОповещения(НСтр("ru = 'Данные выгружены в файл'"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьВыгрузкуXML(Знач СсылкаНаОбъект, Знач РежимРаботы, Знач ИмяНабораЗаписей = "",
	Знач ИспользоватьДвоичныеДанные = Истина)

	ЗаписьXML = Новый ЗаписьXML;

	Если ИспользоватьДвоичныеДанные Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("xml");
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;

	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("_1CV8DtUD", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("V8Exch", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("core", "http://v8.1c.ru/data");

	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8", "http://v8.1c.ru/8.1/data/enterprise/current-config");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");

	ЗаписьXML.ЗаписатьНачалоЭлемента("V8Exch:Data");
	Если РежимРаботы = 4 Тогда
		Менеджер = УИ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяНабораЗаписей);
		Если Менеджер <> Неопределено Тогда
			Набор = Менеджер.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(СсылкаНаОбъект);
			Набор.Прочитать();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Набор);
		КонецЕсли;
	Иначе
		Попытка
			Объект = СсылкаНаОбъект.ПолучитьОбъект();
		Исключение
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выгрузка данных не выполнена!'"));
			ЗаписьXML.Закрыть();
			Если ИспользоватьДвоичныеДанные Тогда
				УдалитьФайлы(ИмяФайла);
			КонецЕсли;
			Возврат Неопределено;
		КонецПопытки;
		Если РежимРаботы = 1 Или РежимРаботы = 2 Тогда
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Явное);
		КонецЕсли;
		Если РежимРаботы = 2 Или РежимРаботы = 3 Тогда
			ОбъектМетаданных = Объект.Метаданные();
			Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				КэшИмен = Новый Соответствие;
				Для Каждого Движение Из Объект.Движения Цикл
					ПолноеИмя = Движение.Метаданные().ПолноеИмя();
					Если КэшИмен[ПолноеИмя] = Неопределено Тогда
						// Защита от кривых конфигураций
						КэшИмен[ПолноеИмя] = 1;
						Движение.Прочитать();
						СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Движение);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // V8Exc:Data
	ЗаписьXML.ЗаписатьКонецЭлемента(); // V8Exc:_1CV8DtUD

	СтрокаXML = ЗаписьXML.Закрыть();

	Если ИспользоватьДвоичныеДанные Тогда
		СтрокаXML = Новый ДвоичныеДанные(ИмяФайла);
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;

	Возврат СтрокаXML;

КонецФункции

&НаСервереБезКонтекста
Процедура ВыполнитьПроцедуруВКонтекстеОбъекта(ОбъектКонтекта, ПроцедураПередЗаписью)
	Попытка
		УИ_ОбщегоНазначения.ВычислитьВБезопасномРежиме(ПроцедураПередЗаписью);
	Исключение
		УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СтатусСообщения.Важное);
		ВызватьИсключение НСтр("ru = 'Ошибка при выполнение процедуры перед записью!'");
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура вЗагрузитьДанныеXML(Знач ПараметрыВыполнения, Знач СтрокаXML)

	ИспользоватьДвоичныеДанные = (ТипЗнч(СтрокаXML) = Тип("ДвоичныеДанные"));
	ЧтениеXML = Новый ЧтениеXML;

	Если ИспользоватьДвоичныеДанные Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("xml");
		СтрокаXML.Записать(ИмяФайла);
		ЧтениеXML.ОткрытьФайл(ИмяФайла, , , "UTF-8");
	Иначе
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
	КонецЕсли;

	УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка данных стартовала'"));

	ОшибкаФормата = Ложь;
	ТекстНеверныйФормат = НСтр("ru = 'Неверный формат файла выгрузки'");

	Попытка
		// Проверка формата
		Если ОшибкаФормата
			 Или Не ЧтениеXML.Прочитать()
			 Или ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			 Или ЧтениеXML.ЛокальноеИмя <> "_1CV8DtUD"
			 Или ЧтениеXML.URIПространстваИмен <> "http://www.1c.ru/V8/1CV8DtUD/" Тогда

			ОшибкаФормата = Истина;
		КонецЕсли;

		Если ОшибкаФормата
			 Или Не ЧтениеXML.Прочитать()
			 Или ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			 Или ЧтениеXML.ЛокальноеИмя <> "Data" Тогда

			ОшибкаФормата = Истина;
		КонецЕсли;

		Если ОшибкаФормата Или Не ЧтениеXML.Прочитать() Тогда

			ОшибкаФормата = Истина;
		КонецЕсли;

	Исключение
		ОшибкаФормата = Истина;
	КонецПопытки;

	Если ОшибкаФормата Тогда
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстНеверныйФормат, СтатусСообщения.Важное);
		ЧтениеXML.Закрыть();

		Если ИспользоватьДвоичныеДанные Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;

		Возврат;
	КонецЕсли;
	
	// параметры загрузки
	ЗагружатьВТранзакции = ПараметрыВыполнения.ЗагружатьВТранзакции;
	ЗагружатьВРежимеОбменДанными = ПараметрыВыполнения.ЗагружатьВРежимеОбменДанными;
	ПродолжатьЗагрузкуПриОшибке = ПараметрыВыполнения.ПродолжатьЗагрузкуПриОшибке;
	ИспользоватьДополнительныеСвойстваПриЗаписи = ПараметрыВыполнения.ИспользоватьДополнительныеСвойстваПриЗаписи;
	ИспользоватьПроцедуруПередЗаписью = ПараметрыВыполнения.ИспользоватьПроцедуруПередЗаписью;
	ДополнительныеСвойства = ПараметрыВыполнения.ДополнительныеСвойства;
	ПроцедураПередЗаписью = ПараметрыВыполнения.ПроцедураПередЗаписью;

	ПродолжатьЗагрузкуПриОшибке = ПродолжатьЗагрузкуПриОшибке И Не ЗагружатьВТранзакции;
	ИспользоватьДополнительныеСвойстваПриЗаписи = ИспользоватьДополнительныеСвойстваПриЗаписи
												   И ДополнительныеСвойства.Количество() <> 0;
	ИспользоватьПроцедуруПередЗаписью = ИспользоватьПроцедуруПередЗаписью И Не ПустаяСтрока(ПроцедураПередЗаписью);
	
	// чтение данных
	Если ЗагружатьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;

	Пока СериализаторXDTO.ВозможностьЧтенияXML(ЧтениеXML) Цикл
		Попытка
			ОбъектЗаписи = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			ОбъектЗаписи.ОбменДанными.Загрузка = ЗагружатьВРежимеОбменДанными;

			Если ИспользоватьДополнительныеСвойстваПриЗаписи Тогда
				Для Каждого Элем Из ДополнительныеСвойства Цикл
					ОбъектЗаписи.ДополнительныеСвойства.Вставить(Элем.Ключ, Элем.Значение);
				КонецЦикла;
			КонецЕсли;

			Если ИспользоватьПроцедуруПередЗаписью Тогда
				ВыполнитьПроцедуруВКонтекстеОбъекта(ОбъектЗаписи, ПроцедураПередЗаписью);
			КонецЕсли;

			ОбъектЗаписи.Записать();
		Исключение
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Если Не ПродолжатьЗагрузкуПриОшибке Тогда
				ОшибкаФормата = Истина;
				Прервать;
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;

	Если ОшибкаФормата Тогда
		Если ЗагружатьВТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;

		ЧтениеXML.Закрыть();
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка данных прервана'"), СтатусСообщения.Важное);

		Если ИспользоватьДвоичныеДанные Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;

		Возврат;
	Иначе
		Если ЗагружатьВТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
	// проверка формата
	Если ОшибкаФормата Или ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Или ЧтениеXML.ЛокальноеИмя <> "Data" Тогда

		ОшибкаФормата = Истина;
	КонецЕсли;

	Если ОшибкаФормата
		 Или Не ЧтениеXML.Прочитать()
		 Или ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента
		 Или ЧтениеXML.ЛокальноеИмя <> "_1CV8DtUD"
		 Или ЧтениеXML.URIПространстваИмен <> "http://www.1c.ru/V8/1CV8DtUD/" Тогда

		ОшибкаФормата = Истина;
	КонецЕсли;

	Если ОшибкаФормата Тогда
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстНеверныйФормат, СтатусСообщения.Важное);
		ЧтениеXML.Закрыть();
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка данных завершена'"));

		Если ИспользоватьДвоичныеДанные Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;

		Возврат;
	КонецЕсли;

	ЧтениеXML.Закрыть();

	Если ИспользоватьДвоичныеДанные Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;

	УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка данных завершена'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьВидОбъекта(Знач СсылкаНаОбъект)
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат УИ_ОбщегоНазначения.ВидОбъектаПоСсылке(СсылкаНаОбъект);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура вЗаполнитьЗависимыеОбъекты()

	ОчиститьЗависимыеОбъекты();

	_КоличествоЗависимых = 0;
	пОбщееКоличество = 0;

	пОбъектМД = Метаданные.НайтиПоПолномуИмени(ТипОбъектаРедактирования);
	Если пОбъектМД = Неопределено Тогда
		Возврат;
	КонецЕсли;

	пКорневойУзел = _ЗависимыеОбъекты.ПолучитьЭлементы().Добавить();
	пКорневойУзел.ВидУзла = 1;
	пКорневойУзел.Имя = пОбъектМД.Имя;
	пКорневойУзел.Представление = пОбъектМД.Представление();
	пКорневойУзел.ПолноеИмя = ТипОбъектаРедактирования;

	Поз = СтрНайти(ТипОбъектаРедактирования, ".");
	пТипДляПоиска = Тип(Лев(ТипОбъектаРедактирования, Поз - 1) + "Ссылка" + Сред(ТипОбъектаРедактирования, Поз));

	пНадоСмотретьПланСчетов = (Лев(ТипОбъектаРедактирования, Поз - 1) = "ПланСчетов");
	пНадоСмотретьПланВидовРасчета = (Лев(ТипОбъектаРедактирования, Поз - 1) = "ПланВидовРасчета");

	пНадоСмотретьВладельцев = (Лев(ТипОбъектаРедактирования, Поз - 1) = "Справочник");
	пНадоСмотретьРегистраторов = (Лев(ТипОбъектаРедактирования, Поз - 1) = "Документ");
	пНадоСмотретьВидыСубконтоПС = (Лев(ТипОбъектаРедактирования, Поз - 1) = "ПланВидовХарактеристик");
	пНадоСмотретьРодителя = (Лев(ТипОбъектаРедактирования, Поз - 1) = "Справочник") Или (Лев(ТипОбъектаРедактирования,
																							 Поз - 1)
																						 = "ПланВидовХарактеристик");

	Если пНадоСмотретьРодителя И Не пОбъектМД.Иерархический Тогда
		пНадоСмотретьРодителя = Ложь;
	КонецЕсли;

	ДанныеПоОбщимРеквизитам = УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
	пТабТипы = ДанныеПоОбщимРеквизитам.Скопировать( , "Тип");
	пТабТипы.Свернуть("Тип");
	пМассивОТ = Новый Массив;
	Для Каждого Стр Из пТабТипы Цикл
		Если Стр.Тип.СодержитТип(пТипДляПоиска) Тогда
			пМассивОТ.Добавить(Стр.Тип);
		КонецЕсли;
	КонецЦикла;

	пНадоСмотретьОбщиеРеквизиты = (пМассивОТ.Количество() <> 0);
	Если пНадоСмотретьОбщиеРеквизиты Тогда
		пТабОбщиеРеквизитыХХХ = Неопределено;
		Для Каждого Элем Из пМассивОТ Цикл
			Если пТабОбщиеРеквизитыХХХ = Неопределено Тогда
				пТабОбщиеРеквизитыХХХ = ДанныеПоОбщимРеквизитам.Скопировать(Новый Структура("Тип", Элем));
			Иначе
				Для Каждого Стр Из ДанныеПоОбщимРеквизитам.НайтиСтроки(Новый Структура("Тип", Элем)) Цикл
					ЗаполнитьЗначенияСвойств(пТабОбщиеРеквизитыХХХ.Добавить(), Стр);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		пТабОбщиеРеквизитыХХХ.Индексы.Добавить("Объект");
		ДанныеПоОбщимРеквизитам = Неопределено;
	КонецЕсли;

	пТабРезультат = Новый ТаблицаЗначений;
	пТабРезультат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	пТабРезультат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	пТабРезультат.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	пТабРезультат.Колонки.Добавить("ГдеНайдено", Новый ОписаниеТипов("Строка"));
	
	// ---
	пСтрукРазделы = Новый Структура("ПараметрыСеанса, ОпределяемыеТипы, Константы");

	пСоотв = Новый Соответствие;

	Для Каждого пЭлем Из пСтрукРазделы Цикл
		пТабРезультат.Очистить();

		пРазделМД = Метаданные[пЭлем.Ключ];

		Для Каждого ОбъектМД Из пРазделМД Цикл
			пПолноеИмя = ОбъектМД.ПолноеИмя();
			пГдеНайдено = "";
			пСчетчик = 0;

			Если ОбъектМД.Тип.Типы().Найти(пТипДляПоиска) <> Неопределено Тогда
				пПуть = "Объект.Тип";
				Если пСчетчик = 0 Тогда
					пГдеНайдено = пПуть;
				Иначе
					пГдеНайдено = пГдеНайдено + "," + пПуть;
				КонецЕсли;
				пСчетчик = пСчетчик + 1;

				пСоотв[пПолноеИмя] = 1;
			КонецЕсли;

			Если пСоотв[пПолноеИмя] <> Неопределено Тогда
				НС = пТабРезультат.Добавить();
				НС.Имя = ОбъектМД.Имя;
				НС.Представление = ОбъектМД.Представление();
				НС.ПолноеИмя = пПолноеИмя;
				НС.ГдеНайдено = пГдеНайдено;
			КонецЕсли;
		КонецЦикла;

		пКоличество = пТабРезультат.Количество();
		Если пКоличество <> 0 Тогда
			пОбщееКоличество = пОбщееКоличество + пКоличество;

			пТабРезультат.Сортировать("Имя");

			пУзелРаздела = пКорневойУзел.ПолучитьЭлементы().Добавить();
			пУзелРаздела.Имя = пЭлем.Ключ + " (" + пКоличество + ")";
			пУзелРаздела.ВидУзла = 2;
			пКоллекцияЭлементов = пУзелРаздела.ПолучитьЭлементы();

			Для Каждого Стр Из пТабРезультат Цикл
				ЗаполнитьЗначенияСвойств(пКоллекцияЭлементов.Добавить(), Стр);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// ---
	пСтрукРазделы = Новый Структура("ПланыОбмена, Справочники, Документы, ПланыВидовРасчета, ПланыВидовХарактеристик, ПланыСчетов,
									|РегистрыСведений, РегистрыНакопления, РегистрыБухгалтерии, РегистрыРасчета,
									|БизнесПроцессы, Задачи");

	пСтрукОбласти = Новый Структура("Измерения, Ресурсы, Реквизиты");

	пСоотв = Новый Соответствие;

	Для Каждого пЭлем Из пСтрукРазделы Цикл
		пТабРезультат.Очистить();

		пРазделМД = Метаданные[пЭлем.Ключ];

		пЭтоПланСчетов = (пЭлем.Ключ = "ПланыСчетов");
		пЭтоПланОбмена = (пЭлем.Ключ = "ПланыОбмена");
		пЭтоСправочник = (пЭлем.Ключ = "Справочники");
		пЭтоРегистр = (СтрНайти(пЭлем.Ключ, "Регистры") = 1);

		Для Каждого ОбъектМД Из пРазделМД Цикл
			пПолноеИмя = ОбъектМД.ПолноеИмя();
			пГдеНайдено = "";
			пСчетчик = 0;

			Если пЭтоРегистр Тогда
				Если пНадоСмотретьРегистраторов И пОбъектМД.Движения.Содержит(ОбъектМД) Тогда
					Если пСчетчик = 0 Тогда
						пГдеНайдено = "Объект.Реквизиты.Регистратор";
					Иначе
						пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты.Регистратор";
					КонецЕсли;
					пСчетчик = пСчетчик + 1;

					пСоотв[пПолноеИмя] = 1;
				КонецЕсли;

				Если пНадоСмотретьПланСчетов И СтрНайти(пПолноеИмя, "РегистрБухгалтерии") = 1 Тогда
					Если ОбъектМД.ПланСчетов = пОбъектМД Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.Реквизиты.Счет";
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты.Счет";
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЕсли;

				Если пНадоСмотретьПланВидовРасчета И СтрНайти(пПолноеИмя, "РегистрРасчета") = 1 Тогда
					Если ОбъектМД.ПланВидовРасчета = пОбъектМД Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.Реквизиты.ВидРасчета";
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты.ВидРасчета";
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЕсли;

				Для Каждого пОбласть Из пСтрукОбласти Цикл
					Для Каждого пРеквизит Из ОбъектМД[пОбласть.Ключ] Цикл
						Если пРеквизит.Тип.Типы().Найти(пТипДляПоиска) <> Неопределено Тогда
							пПуть = "Объект." + пОбласть.Ключ + "." + пРеквизит.Имя;
							Если пСчетчик = 0 Тогда
								пГдеНайдено = пПуть;
							Иначе
								пГдеНайдено = пГдеНайдено + "," + пПуть;
							КонецЕсли;
							пСчетчик = пСчетчик + 1;

							пСоотв[пПолноеИмя] = 1;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;

			Иначе // для не регистров

				Если пНадоСмотретьВладельцев И пЭтоСправочник Тогда
					Если ОбъектМД.Владельцы.Содержит(пОбъектМД) Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.Реквизиты.Владелец";
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты.Владелец";
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЕсли;

				Если пНадоСмотретьРодителя И пПолноеИмя = ТипОбъектаРедактирования Тогда
					Если пСчетчик = 0 Тогда
						пГдеНайдено = "Объект.Реквизиты.Родитель";
					Иначе
						пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты.Родитель";
					КонецЕсли;
					пСчетчик = пСчетчик + 1;

					пСоотв[пПолноеИмя] = 1;
				КонецЕсли;

				Для Каждого пРеквизит Из ОбъектМД.Реквизиты Цикл
					Если пРеквизит.Тип.Типы().Найти(пТипДляПоиска) <> Неопределено Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.Реквизиты." + пРеквизит.Имя;
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты." + пРеквизит.Имя;
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЦикла;

				Для Каждого пТабличнаяЧасть Из ОбъектМД.ТабличныеЧасти Цикл
					Для Каждого пРеквизит Из пТабличнаяЧасть.Реквизиты Цикл
						Если пРеквизит.Тип.Типы().Найти(пТипДляПоиска) <> Неопределено Тогда
							Если пСчетчик = 0 Тогда
								пГдеНайдено = "Объект." + пТабличнаяЧасть.Имя + ".Реквизиты." + пРеквизит.Имя;
							Иначе
								пГдеНайдено = пГдеНайдено
											  + ",Объект."
											  + пТабличнаяЧасть.Имя
											  + ".Реквизиты."
											  + пРеквизит.Имя;
							КонецЕсли;
							пСчетчик = пСчетчик + 1;

							пСоотв[пПолноеИмя] = 1;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;

				Если пЭтоПланОбмена Тогда
					Если ОбъектМД.Состав.Содержит(пОбъектМД) Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.Состав";
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.Состав";
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЕсли;

				Если пЭтоПланСчетов И пНадоСмотретьВидыСубконтоПС Тогда
					Если ОбъектМД.ВидыСубконто = пОбъектМД Тогда
						Если пСчетчик = 0 Тогда
							пГдеНайдено = "Объект.ВидыСубконто";
						Иначе
							пГдеНайдено = пГдеНайдено + ",Объект.ВидыСубконто";
						КонецЕсли;
						пСчетчик = пСчетчик + 1;

						пСоотв[пПолноеИмя] = 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если пНадоСмотретьОбщиеРеквизиты Тогда
				Для Каждого Стр Из пТабОбщиеРеквизитыХХХ.НайтиСтроки(Новый Структура("Объект", пПолноеИмя)) Цикл
					Если пСчетчик = 0 Тогда
						пГдеНайдено = "Объект.Реквизиты." + Стр.Имя;
					Иначе
						пГдеНайдено = пГдеНайдено + ",Объект.Реквизиты." + Стр.Имя;
					КонецЕсли;
					пСчетчик = пСчетчик + 1;

					пСоотв[пПолноеИмя] = 1;
				КонецЦикла;
			КонецЕсли;

			Если пСоотв[пПолноеИмя] <> Неопределено Тогда
				НС = пТабРезультат.Добавить();
				НС.Имя = ОбъектМД.Имя;
				НС.Представление = ОбъектМД.Представление();
				НС.ПолноеИмя = пПолноеИмя;
				НС.ГдеНайдено = пГдеНайдено;
			КонецЕсли;
		КонецЦикла;

		пКоличество = пТабРезультат.Количество();
		Если пКоличество <> 0 Тогда
			пОбщееКоличество = пОбщееКоличество + пКоличество;

			пТабРезультат.Сортировать("Имя");

			пУзелРаздела = пКорневойУзел.ПолучитьЭлементы().Добавить();
			пУзелРаздела.Имя = пЭлем.Ключ + " (" + пКоличество + ")";
			пУзелРаздела.ВидУзла = 2;
			пКоллекцияЭлементов = пУзелРаздела.ПолучитьЭлементы();

			Для Каждого Стр Из пТабРезультат Цикл
				ЗаполнитьЗначенияСвойств(пКоллекцияЭлементов.Добавить(), Стр);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	_КоличествоЗависимых = пОбщееКоличество;

	Если _КоличествоЗависимых > 0 Тогда
		Элементы.ДекорацияСсылкиНаОбъект.Заголовок = "Ссылки на объекты конфигурации (" + _КоличествоЗависимых + ")";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизацииСтрокиЗависимых()
	ТекущиеДанные = Элементы._ЗависимыеОбъекты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		_ГдеНайдено = СтрЗаменить(ТекущиеДанные.ГдеНайдено, ",", Символы.ПС);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаЗависимых()
	
	ТекущиеДанные = Элементы._ЗависимыеОбъекты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ВидУзла = 0 Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("мОбъектСсылка", мОбъектСсылка);
		ПараметрыФормы.Вставить("АдресаХранилищ", _АдресаХранилищ);
		ПараметрыФормы.Вставить("ПолноеИмя", ТекущиеДанные.ПолноеИмя);
		ПараметрыФормы.Вставить("ГдеНайдено", ТекущиеДанные.ГдеНайдено);
		ПараметрыФормы.Вставить("ОграничениеНаСписокЗависимых", ОграничениеНаСписокЗависимых);
		ПараметрыФормы.Вставить("АдресОбщихРеквизитов", АдресОбщихРеквизитов);
		ОткрытьФорму("Обработка.УИ_РедакторРеквизитовОбъекта.Форма.ФормаСпискаЗависимых", ПараметрыФормы, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция вСформироватьТаблицуСвойств()
	ТипСтрока = Новый ОписаниеТипов("Строка");

	ТабРезультат = Новый ТаблицаЗначений;
	ТабРезультат.Колонки.Добавить("Имя", ТипСтрока);
	ТабРезультат.Колонки.Добавить("Индексирование", ТипСтрока);
	ТабРезультат.Колонки.Добавить("Синоним", ТипСтрока);
	ТабРезультат.Колонки.Добавить("Комментарий", ТипСтрока);
	ТабРезультат.Колонки.Добавить("ТипСтрокой", ТипСтрока);
	ТабРезультат.Колонки.Добавить("ОбщийРеквизит", Новый ОписаниеТипов("Булево"));
	ТабРезультат.Колонки.Добавить("Расширение", Новый ОписаниеТипов("Булево"));
	ТабРезультат.Колонки.Добавить("ИзмененРасширениями", Новый ОписаниеТипов("Булево"));

	Возврат ТабРезультат;
КонецФункции

&НаСервереБезКонтекста
Функция вПолучитьСвойстовоИндексирование(Знач ОбъектМД)
	Структура = Новый Структура("Индексирование");
	СвойствоИндексирование = Метаданные.СвойстваОбъектов.Индексирование;

	ЗаполнитьЗначенияСвойств(Структура, ОбъектМД);
	Если Структура.Индексирование = Неопределено Тогда
		Значение = "";
	ИначеЕсли Структура.Индексирование = СвойствоИндексирование.НеИндексировать Тогда
		Значение = "";
	Иначе
		Значение = Структура.Индексирование;
	КонецЕсли;

	Возврат Значение;
КонецФункции

&НаСервере
Процедура вЗаполнитьСпецСвойствоОбъекта(ОбъектМД, УзелДЗ, ИмяСвойства)
	Если ОбъектМД[ИмяСвойства].Количество() <> 0 Тогда
		РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
		РазделДЗ.Имя = ИмяСвойства;
		Для Каждого Элем Из ОбъектМД[ИмяСвойства] Цикл
			СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
			СтрДЗ.Имя = Элем.Имя;
			СтрДЗ.Синоним = Элем.Представление();
			СтрДЗ.Комментарий = Элем.Комментарий;
			СтрДЗ.ТипСтрокой = Элем.ПолноеИмя();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСвойстваОбъекта(ОбъектМД, УзелДЗ, ПереченьСвойств)

	РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
	РазделДЗ.ВидУзла = 2;
	РазделДЗ.Имя = "Свойства";

	ТипОбъектМД = Тип("ОбъектМетаданных");
	ТипОписаниеТипов = Тип("ОписаниеТипов");

	пРасширениеКонфигурации = ОбъектМД.РасширениеКонфигурации();
	Если пРасширениеКонфигурации <> Неопределено Тогда
		СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
		СтрДЗ.Имя = "РасширениеКонфигурации";
		СтрДЗ.Синоним = пРасширениеКонфигурации.Имя;
		СтрДЗ.ТипСтрокой = "РасширениеКонфигурации";
		СтрДЗ.Комментарий = пРасширениеКонфигурации.Синоним;
	КонецЕсли;

	Струк = Новый Структура(ПереченьСвойств);
	ЗаполнитьЗначенияСвойств(Струк, ОбъектМД);
	Для Каждого Элем Из Струк Цикл
		СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
		СтрДЗ.Имя = Элем.Ключ;
		СтрДЗ.Синоним = Элем.Значение;
		Если Элем.Значение <> Неопределено Тогда
			пТипЗнч = ТипЗнч(Элем.Значение);
			Если пТипЗнч = ТипОбъектМД Тогда
				СтрДЗ.ТипСтрокой = Элем.Значение.ПолноеИмя();
			ИначеЕсли пТипЗнч = ТипОписаниеТипов Тогда
				СтрДЗ.ТипСтрокой = ПредставлениеОписанияТипа(Элем.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСтандартныеРеквизитыОбъекта(ОбъектМД, УзелДЗ)
	Если ОбъектМД.СтандартныеРеквизиты.Количество() <> 0 Тогда
		РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
		РазделДЗ.ВидУзла = 2;
		РазделДЗ.Имя = "СтандартныеРеквизиты";
		Для Каждого Элем Из ОбъектМД.СтандартныеРеквизиты Цикл
			СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
			СтрДЗ.Имя = Элем.Имя;
			СтрДЗ.Синоним = Элем.Представление();
			СтрДЗ.Комментарий = Элем.Комментарий;
			//СтрДЗ.ТипСтрокой = Элем.ПолноеИмя();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьТабличныеЧастиОбъекта(ОбъектМД, УзелДЗ)
	Список = Новый СписокЗначений;
	Для Каждого Элем Из ОбъектМД.ТабличныеЧасти Цикл
		Список.Добавить(Элем.Имя);
	КонецЦикла;
	Список.СортироватьПоЗначению();

	Для Каждого ЭлемХ Из Список Цикл
		Элем = ОбъектМД.ТабличныеЧасти[ЭлемХ.Значение];
		РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
		РазделДЗ.ВидУзла = 2;
		РазделДЗ.Имя = "ТЧ." + Элем.Имя;
		РазделДЗ.Расширение = (Элем.РасширениеКонфигурации() <> Неопределено);
		РазделДЗ.ИзмененРасширениями = Элем.ЕстьИзмененияРасширениямиКонфигурации();

		Таблица = вСформироватьТаблицуСвойств();
		Для Каждого ЭлемТЧ Из Элем.Реквизиты Цикл
			Стр = Таблица.Добавить();
			Стр.Имя = ЭлемТЧ.Имя;
			Стр.Индексирование = вПолучитьСвойстовоИндексирование(ЭлемТЧ);
			Стр.Синоним = ЭлемТЧ.Представление();
			Стр.Комментарий = ЭлемТЧ.Комментарий;
			Стр.ТипСтрокой = ПредставлениеОписанияТипа(ЭлемТЧ.Тип);
			Стр.Расширение = (Элем.РасширениеКонфигурации() <> Неопределено);
			Стр.ИзмененРасширениями = Элем.ЕстьИзмененияРасширениямиКонфигурации();
		КонецЦикла;
		Таблица.Сортировать("Имя");

		Для Каждого Стр Из Таблица Цикл
			СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрДЗ, Стр);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьСвойствоКоллекцияОбъекта(ОбъектМД, УзелДЗ, ИмяКоллекции, Сортировать = Истина,
	ПолеСортировки = "Имя", ЗаполнятьИндексирование = Ложь)
	Если ОбъектМД[ИмяКоллекции].Количество() <> 0 Тогда
		Таблица = вСформироватьТаблицуСвойств();
		Для Каждого Элем Из ОбъектМД[ИмяКоллекции] Цикл
			Стр = Таблица.Добавить();
			Стр.Имя = Элем.Имя;
			Если ЗаполнятьИндексирование Тогда
				Стр.Индексирование = вПолучитьСвойстовоИндексирование(Элем);
			КонецЕсли;
			Стр.Синоним = Элем.Представление();
			Стр.Комментарий = Элем.Комментарий;
			Стр.ТипСтрокой = Элем.ПолноеИмя();
			Стр.Расширение = (Элем.РасширениеКонфигурации() <> Неопределено);
			Стр.ИзмененРасширениями = Элем.ЕстьИзмененияРасширениямиКонфигурации();
		КонецЦикла;

		Если Сортировать Тогда
			Таблица.Сортировать(ПолеСортировки);
		КонецЕсли;

		РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
		РазделДЗ.ВидУзла = 2;
		РазделДЗ.Имя = ИмяКоллекции + " (" + Таблица.Количество() + ")";
		Для Каждого Элем Из Таблица Цикл
			СтрДЗ = РазделДЗ.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрДЗ, Элем);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьВладельцевОбъекта(ОбъектМД, УзелДЗ)
	вЗаполнитьСвойствоКоллекцияОбъекта(ОбъектМД, УзелДЗ, "Владельцы");
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьВводитсяНаОсновании(ОбъектМД, УзелДЗ)
	вЗаполнитьСвойствоКоллекцияОбъекта(ОбъектМД, УзелДЗ, "ВводитсяНаОсновании");
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьГруппуСвойствОбъекта(ОбъектМД, УзелДЗ, ИмяГруппы, Сортировать = Истина, ВыводитьКоличество = Ложь,
	ПроверитьНаВедущее = Ложь)
	Если ОбъектМД[ИмяГруппы].Количество() <> 0 Или ИмяГруппы = "Реквизиты" Тогда

		Таблица = вСформироватьТаблицуСвойств();
		Для Каждого Элем Из ОбъектМД[ИмяГруппы] Цикл
			Стр = Таблица.Добавить();
			Стр.Имя = Элем.Имя;
			Стр.Индексирование = вПолучитьСвойстовоИндексирование(Элем);
			Если ПроверитьНаВедущее И ПустаяСтрока(Стр.Индексирование) Тогда
				Если Элем.Ведущее Тогда
					Стр.Индексирование = "Ведущее";
				КонецЕсли;
			КонецЕсли;
			Стр.Синоним = Элем.Представление();
			Стр.Комментарий = Элем.Комментарий;
			Стр.ТипСтрокой = ПредставлениеОписанияТипа(Элем.Тип);
			Стр.Расширение = (Элем.РасширениеКонфигурации() <> Неопределено);
			Стр.ИзмененРасширениями = Элем.ЕстьИзмененияРасширениямиКонфигурации();
		КонецЦикла;

		Если ИмяГруппы = "Реквизиты" Тогда
			ДанныеПоОбщимРеквизитам = УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
			ОбщиеРеквизиты = ДанныеПоОбщимРеквизитам.НайтиСтроки(Новый Структура("Объект", ОбъектМД.ПолноеИмя()));
			Для Каждого Элем Из ОбщиеРеквизиты Цикл
				НС = Таблица.Добавить();
				НС.Имя = Элем.Имя;
				НС.Синоним = Элем.Представление;
				НС.ТипСтрокой = ПредставлениеОписанияТипа(Элем.Тип);
				НС.ОбщийРеквизит = Истина;
				НС.Комментарий = Элем.Комментарий;
				НС.Индексирование = Элем.Индексирование;
			КонецЦикла;

			Если Таблица.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;

		Если Сортировать Тогда
			Таблица.Сортировать("Имя");
		КонецЕсли;

		РазделДЗ = УзелДЗ.ПолучитьЭлементы().Добавить();
		РазделДЗ.ВидУзла = 2;
		РазделДЗ.Имя = ИмяГруппы;
		Если ВыводитьКоличество Тогда
			РазделДЗ.Имя = РазделДЗ.Имя + " (" + Таблица.Количество() + ")";
		КонецЕсли;

		Для Каждого Стр Из Таблица Цикл
			ЗаполнитьЗначенияСвойств(РазделДЗ.ПолучитьЭлементы().Добавить(), Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вЗаполнитьРеквизитыОбъекта(ОбъектМД, УзелДЗ)
	вЗаполнитьГруппуСвойствОбъекта(ОбъектМД, УзелДЗ, "Реквизиты", Истина, Истина);
КонецПроцедуры

&НаКлиенте
Функция вПолучитьМассивТиповМД(Знач ТипСтрокой)
	ПростыеТипы = "/Булево/Дата/ДатаВремя/Строка/Число/ХранилищеЗначения/УникальныйИдентификатор/";
	Результат = Новый Массив;

	Для Каждого Элем Из СтрРазделить(ТипСтрокой, ",", Ложь) Цикл
		Если СтрНайти(ПростыеТипы, Элем) = 0 Тогда
			Если СтрНайти(Элем, "Строка(") = 0 И СтрНайти(Элем, "Число(") = 0 Тогда
				Результат.Добавить(Элем);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура вПоказатьСвойстваОбъектаМД(ВыбранныйЭлемент, ФормаНавигатора) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПолноеИмя = ВыбранныйЭлемент.Значение;

		Попытка
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Операция", "ПоказатьСвойстваОбъектаМД");
			ПараметрыОткрытия.Вставить("Источник", "СДРОбъектУпр");
			ПараметрыОткрытия.Вставить("Параметры", Новый Структура("ПолноеИмя", ПолноеИмя));

			Результат = ФормаНавигатора.вОбработатьВнешнийВызов(ПараметрыОткрытия);
			Если Результат.Отказ Тогда
				УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПричинаОтказа);
			КонецЕсли;
		Исключение
			ТекстОшибки = НСтр("ru = '""Навигатор по метаданным"" не поддерживает внешние вызовы'");
			УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКомандуИнструментов(Команда) 
	УИ_ОбщегоНазначенияКлиент.Подключаемый_ВыполнитьОбщуюКомандуИнструментов(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НастроитьПараметрыЗаписи(Команда)
	УИ_ОбщегоНазначенияКлиент.РедактироватьПараметрыЗаписи(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
