

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	
	
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	УИ_Алгоритмы.Ссылка
	|ПОМЕСТИТЬ Алго
	|ИЗ
	|	Справочник.УИ_Алгоритмы КАК УИ_Алгоритмы";
	Запрос.Выполнить();
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|	УИ_Алгоритмы.Ссылка,
	|	УИ_Алгоритмы.ВерсияДанных,
	|	УИ_Алгоритмы.ПометкаУдаления,
	|	УИ_Алгоритмы.Родитель,
	|	УИ_Алгоритмы.ЭтоГруппа,
	|	УИ_Алгоритмы.Код,
	|	УИ_Алгоритмы.Наименование,
	|	УИ_Алгоритмы.ТекстАлгоритма,
	|	УИ_Алгоритмы.Хранилище,
	|	УИ_Алгоритмы.Комментарий,
	|	УИ_Алгоритмы.Кэшировать,
	|	УИ_Алгоритмы.НаКлиенте,
	|	УИ_Алгоритмы.ВыбрасыватьИсключение,
	|	УИ_Алгоритмы.ВыполнятьВТранзакции,
	|	УИ_Алгоритмы.ЗаписыватьОшибкиВЖР,
	|	УИ_Алгоритмы.ИдентификаторHTTP,
	|	УИ_Алгоритмы.ИдентификаторРегламентногоЗадания,
	|	УИ_Алгоритмы.ВыполнятьПоРасписанию,
	|	УИ_Алгоритмы.Параметры.(
	|		Ссылка,
	|		НомерСтроки,
	|		Вход,
	|		Имя,
	|		ТипПараметра,
	|		ПоУмолчанию,
	|		Ссылка,
	|		НомерСтроки,
	|		Вход,
	|		Имя,
	|		ТипПараметра,
	|		ПоУмолчанию),
	|	УИ_Алгоритмы.Предопределенный,
	|	УИ_Алгоритмы.ИмяПредопределенныхДанных,
	|	УИ_Алгоритмы.Представление,
	|	УИ_Алгоритмы.Ссылка,
	|	УИ_Алгоритмы.ВерсияДанных,
	|	УИ_Алгоритмы.ПометкаУдаления,
	|	УИ_Алгоритмы.Родитель,
	|	УИ_Алгоритмы.ЭтоГруппа,
	|	УИ_Алгоритмы.Код,
	|	УИ_Алгоритмы.Наименование,
	|	УИ_Алгоритмы.ТекстАлгоритма,
	|	УИ_Алгоритмы.Хранилище,
	|	УИ_Алгоритмы.Комментарий,
	|	УИ_Алгоритмы.Кэшировать,
	|	УИ_Алгоритмы.НаКлиенте,
	|	УИ_Алгоритмы.ВыбрасыватьИсключение,
	|	УИ_Алгоритмы.ВыполнятьВТранзакции,
	|	УИ_Алгоритмы.ЗаписыватьОшибкиВЖР,
	|	УИ_Алгоритмы.ИдентификаторHTTP,
	|	УИ_Алгоритмы.ИдентификаторРегламентногоЗадания,
	|	УИ_Алгоритмы.ВыполнятьПоРасписанию,
	|	УИ_Алгоритмы.Предопределенный,
	|	УИ_Алгоритмы.ИмяПредопределенныхДанных,
	|	УИ_Алгоритмы.Представление
	|ИЗ
	|	Справочник.УИ_Алгоритмы КАК УИ_Алгоритмы
	|ГДЕ
	|	УИ_Алгоритмы.ИдентификаторHTTP = &ИдентификаторHTTP";
	Запрос.УстановитьПараметр("ИдентификаторHTTP", "раз два");
	Запрос.УстановитьПараметр("Таблица", Новый ТаблицаЗначений);
	Запрос.УстановитьПараметр("Массив", Новый Массив);
	Запрос.УстановитьПараметр("Список", Новый СписокЗначений);
	Результат=Запрос.Выполнить();
	УИ.От(Запрос);
	
КонецПроцедуры
