&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Для Каждого Алгоритм Из ПараметрКоманды Цикл
		Ошибка = Ложь;
		СообщениеОбОшибке = "";

		Если АлгоритмВыполняетсяНаКлиенте(Алгоритм) Тогда
			УИ_ОбщегоНазначенияКлиент.ВыполнитьАлгоритм(Алгоритм, , Ошибка, СообщениеОбОшибке);
		Иначе
			УИ_ОбщегоНазначенияВызовСервера.ВыполнитьАлгоритм(Алгоритм, , Ошибка, СообщениеОбОшибке);
		КонецЕсли;
		Если Ошибка Тогда
			УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АлгоритмВыполняетсяНаКлиенте(Алгоритм)

	Возврат Алгоритм.НаКлиенте;

КонецФункции
