
#Область ПрограммныйИнтерфейс

// Формирует структуру параметров для открытия обработки "Навигатор по метаданным" для просмотра свойств объекта метаданных.
//
// Возвращаемое значение:
//   Структура:
//     * Операция - Строка - идентификатор операции ("ПоказатьСвойстваОбъектаМД")
//     * Источник - Строка - идентификатор источника вызова ("СДРОбъектУпр")
//     * Параметры - Структура - структура с параметром ПолноеИмя для передачи полного имени объекта метаданных
//
Функция НовыйПараметрыОткрытияОбработкиДляПросмотраСвойствОбъектаМетаданных() Экспорт

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Операция", "ПоказатьСвойстваОбъектаМД");
	ПараметрыОткрытия.Вставить("Источник", "СДРОбъектУпр");
	ПараметрыОткрытия.Вставить("Параметры", Новый Структура("ПолноеИмя", ""));
	Возврат ПараметрыОткрытия;
	
КонецФункции

#КонецОбласти
