
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		Значение = ЗначениеИзСтрокиВнутр(Параметры.ЗначениеВнутр);
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = истина;
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	_ЧислоЗаписей = Значение.Количество();
	
	//пТипТаблицаЗначений = Тип("ТаблицаЗначений");
	
	ТипХЗ = Тип("ХранилищеЗначения");
	ТипТЗ = Тип("ТаблицаЗначений");
	ТипТТ = Тип("Тип");
	ТипМВ = Тип("МоментВремени");
	
	РеквизитыКДобавлению = новый Массив;
	РеквизитыКУдалению = новый Массив;
	
	Для каждого Колонка из Значение.Колонки Цикл
		//Если не Колонка.ТипЗначения.СодержитТип(пТипТаблицаЗначений) Тогда
		//	РеквизитыКДобавлению.Добавить(новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаДанных", Колонка.Заголовок, ложь));
		//КонецЕсли;
		
		Если Колонка.ТипЗначения.СодержитТип(ТипХЗ) Тогда
			ТипЗначенияРеквизита = новый ОписаниеТипов;
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипТЗ) Тогда
			ТипЗначенияРеквизита = новый ОписаниеТипов;
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипТТ) Тогда
			ТипЗначенияРеквизита = новый ОписаниеТипов;
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипМВ) Тогда
			ТипЗначенияРеквизита = новый ОписаниеТипов;
		Иначе
			ТипЗначенияРеквизита = Колонка.ТипЗначения;
		КонецЕсли;
		
		РеквизитыКДобавлению.Добавить(новый РеквизитФормы(Колонка.Имя, ТипЗначенияРеквизита, "ТаблицаДанных", Колонка.Заголовок, ложь));
	КонецЦикла;
	
	ИзменитьРеквизиты(РеквизитыКДобавлению,РеквизитыКУдалению);
	ЗначениеВРеквизитФормы(Значение, "ТаблицаДанных");
	
	Для каждого Колонка из Значение.Колонки Цикл
		//Если не Колонка.ТипЗначения.СодержитТип(пТипТаблицаЗначений) Тогда
			ЭтаФорма.Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ЭтаФорма.Элементы.ТаблицаДанных);
			ЭтаФорма.Элементы[Колонка.Имя].ПутьКДанным = "ТаблицаДанных."+Колонка.Имя;
			ЭтаФорма.Элементы[Колонка.Имя].Вид = ВидПоляФормы.ПолеВвода;
			ЭтаФорма.Элементы[Колонка.Имя].ДоступныеТипы = Колонка.ТипЗначения;
		//КонецЕсли;
	КонецЦикла;
	
	Если не ПустаяСтрока(Параметры.Заголовок) Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Результат = новый Структура;
	Результат.Вставить("ТипЗначения", "ТаблицаЗначений");
	Результат.Вставить("СтрокаВнутр", вТаблицаДанныхКакСтрокаВнутр());
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьТаблицу(Команда)
	ТаблицаДанных.Очистить();
КонецПроцедуры

&НаСервере
Функция вТаблицаДанныхКакСтрокаВнутр()
	Возврат ЗначениеВСтрокуВнутр(РеквизитФормыВЗначение("ТаблицаДанных"));
КонецФункции
