
// Описание
// 
// Параметры:
// 	НаименованиеАлгоритма - Строка - Название элемента справочника Алгоритмы, поиск происходит по наименованию 
// 	ТекстАлгоритма - Строка - Значение реквизита "ТекстАлгоритма"
// 	ПараметрN - Произвольное значение
// Возвращаемое значение:
// 	Строка Результат выполнения сохранения алгоритма
Функция СозданиеАлгоритма(НаименованиеАлгоритма, ТекстАлгоритма = "", Знач Параметр1 = Неопределено, 
	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено, 
	Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено, Знач Параметр7 = Неопределено, 
	Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено, Знач МассивИменПараметров = Неопределено) Экспорт
	
	Возврат УИ_АлгоритмыСервер.СозданиеАлгоритма(НаименованиеАлгоритма, ТекстАлгоритма, Параметр1, Параметр2, Параметр3, 
		Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9, МассивИменПараметров);	

КонецФункции

Процедура ВыполнитьАлгоритм(Алгоритм) Экспорт
	УИ_АлгоритмыСервер.ВыполнитьАлгоритм(Алгоритм);
КонецПроцедуры

Функция ПолучитьПараметры(Алгоритм) Экспорт
	Возврат УИ_АлгоритмыСервер.ПолучитьПараметры(Алгоритм);
КонецФункции