
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_ВерсияПлатформы = "8.3.10";
	
	пОбработка = РеквизитФормыВЗначение("Объект");
	
	ПутьКФормам = пОбработка.Метаданные().ПолноеИмя() + ".Форма.";
	
	Попытка
		вПроверитьСовместимость(пОбработка);
	Исключение
		_Сообщение = "";
	КонецПопытки;
	
	Если не ПустаяСтрока(_Сообщение) Тогда
		ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(_Сообщение) Тогда
		Отказ = истина;
		ОткрытьФорму(ПутьКФормам + "Форма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ПродолжитьРаботу(Команда)
	Закрыть();
	ОткрытьФорму(ПутьКФормам + "Форма");
КонецПроцедуры


&НаСервере
Процедура вПроверитьСовместимость(пОбработка)
	пСистемнаяИнформация = новый СистемнаяИнформация();
	
	пМассивА = СтрРазделить(_ВерсияПлатформы, ".");
	пМассивБ = СтрРазделить(пСистемнаяИнформация.ВерсияПриложения, ".");
	
	пВГраница = Мин(пМассивА.ВГраница(), пМассивБ.ВГраница());
	пВерсияПлатформыХ = ложь;
	Для Сч = 0 по пВГраница Цикл
		Если Число(пМассивА[Сч]) > Число(пМассивБ[Сч]) Тогда
			пВерсияПлатформыХ = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если пВерсияПлатформыХ Тогда
		
		Попытка
			пСтрук = пОбработка.вСформироватьОписаниеРазработки();
		Исключение
			пСтрук = новый Структура;
		КонецПопытки;
		
		пМассив = новый Массив;
		
		пЗначение = Неопределено;
		
		Если пСтрук.Свойство("Наименование", пЗначение) Тогда
			пМассив.Добавить(пЗначение);
		Иначе
			пМассив.Добавить(пОбработка.Метаданные().Имя + " (" + пОбработка.Метаданные().Представление() + ")");
		КонецЕсли;
		Если пСтрук.Свойство("НомерВерсии", пЗначение) Тогда
			пМассив.Добавить("Версия: " + пЗначение);
		КонецЕсли;
		Если пСтрук.Свойство("ДатаВерсии", пЗначение) Тогда
			пМассив.Добавить("Дата версии: " + пЗначение);
		КонецЕсли;
		Если пСтрук.Свойство("Описание", пЗначение) Тогда
			пМассив.Добавить("Описание: " + пЗначение);
		КонецЕсли;
		
		пВысотаБлока = пМассив.Количество();
		
		пМассив.Добавить("");
		пМассив.Добавить("");
		
		пТекст = "МИНИМАЛЬНАЯ ВЕРСИЯ ПЛАТФОРМЫ 1С: %1";
		пМассив.Добавить(СтрШаблон(пТекст, _ВерсияПлатформы));
		
		пДлина = 0;
		Для Сч = 0 по пМассив.ВГраница() Цикл
			пДлина = Макс(пДлина, СтрДлина(пМассив[Сч]));
		КонецЦикла;
		
		пСтрока = вСтрПовторить("-", пДлина);
		
		Если пВысотаБлока > 1 Тогда
			пМассив.Вставить(пВысотаБлока, пСтрока);
		КонецЕсли;
		пМассив.Вставить(1, пСтрока);
		пМассив.Вставить(0, пСтрока);
		
		Если пМассив.Количество() > 3 Тогда
			пМассив.Вставить(пМассив.Количество()-1, пСтрока);
		КонецЕсли;
		
		пМассив.Добавить(пСтрока);
		
		_Сообщение = СтрСоединить(пМассив, Символы.ПС);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция вСтрПовторить(Знач пСтрока, Знач пЧислоПовторений)
	пЗначение = "";
	
	Для Сч = 1 по пЧислоПовторений Цикл
		пЗначение = пЗначение + пСтрока;
	КонецЦикла;
	
	Возврат пЗначение;
КонецФункции
