#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПрочитатьНастройки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СохранитьНастройки(Команда)

	НовыеНастройки = НовыеНастройкиКонсоли();
	ЗаполнитьЗначенияСвойств(НовыеНастройки, ЭтотОбъект);
	Закрыть(НовыеНастройки);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройки()

	НастройкиКонсоли = НовыеНастройкиКонсоли();

	Если Параметры.Свойство("НастройкиКонсоли") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиКонсоли, Параметры.НастройкиКонсоли);
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКонсоли);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеНастройкиКонсоли()

	Настройки = Новый Структура;
	Настройки.Вставить("ОпцияОбрабатывать__", Ложь);
	Настройки.Вставить("ОпцияИнтервалАвтосохранения", 0);
	Настройки.Вставить("ОпцияИнтервалОбновленияВыполненияАлгоритма", 0);
	Настройки.Вставить("ОпцияСохранятьКомментарии", Ложь);
	Настройки.Вставить("ОпцияАвтосохранениеПередВыполнениемЗапроса", Ложь);

	Возврат Настройки;

КонецФункции

#КонецОбласти
