#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрыватьБезВопроса; // Флаг, отвечающий за закрытие формы без диалогового окна.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не ЗавершениеРаботы И ЗакрыватьБезВопроса = Неопределено И Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ТипЗнч(Параметры.Куки) = Тип("Массив") Тогда
		Для Каждого СтрокаКуки Из Параметры.Куки Цикл
			НоваяСтрока = Куки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКуки);
		КонецЦикла;
	КонецЕсли;

	Если Параметры.ТолькоПросмотр Тогда
		Элементы.Куки.ТолькоПросмотр = Параметры.ТолькоПросмотр;
		Элементы.ФормаСохранить.Видимость = Не Параметры.ТолькоПросмотр;
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
		Элементы.КукиОчиститьКуки.Видимость = Не Параметры.ТолькоПросмотр;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКуки(Команда)

	Оповещение = Новый ОписаниеОповещения("ОчиститьКукиЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Вы действительно хотите очистить таблицу с куки?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьКукиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		Куки.Очистить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьИЗакрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрыватьБезВопроса = Истина;
		Закрыть();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть()

	ЗакрыватьБезВопроса = Истина;
	Закрыть(Куки);

КонецПроцедуры

#КонецОбласти