
#Область ПрограммныйИнтерфейс

// Начать выполнение обещания.
// 
// Параметры:
//  Обещание - Обещание, Произвольный -
//  ОписаниеОповещенияОЗавершении -ОписаниеОповещения -Описание оповещения о завершении
Асинх Процедура НачатьВыполнениеОбещания(Обещание, ОписаниеОповещенияОЗавершении) Экспорт
	Если ТипЗнч(Обещание) = Тип("Обещание") Тогда
		Попытка 
			Результат = Ждать Обещание;
		Исключение
			УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			
			Результат = Неопределено;
		КонецПопытки;
	Иначе
		Результат = Обещание;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Результат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
