#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Параметры.Заголовок;
	Значение.ТипЗначения = Новый ОписаниеТипов(Параметры.ТипЗначенияСписка);

	Для Каждого Строка Из Параметры.Значение Цикл
		Значение.Добавить(Строка.Значение);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьСписокВыбора(Команда)

	Закрыть(Значение);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)

	Закрыть();

КонецПроцедуры

#КонецОбласти