
#Область ОписаниеПеременных

&НаКлиенте
Перем СобытияПоляHTMLТерминалаКОбработке;// Массив из см. НовыйСобытиеПоляHTMLКОбработке

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьИнформациюОСервере();
	УстановитьТекущийКаталогПоУмолчанию();

	ПараметрыФормированияРедакторов = УИ_РедакторКодаСервер.ПараметрыФормированияРедакторов();
	ПолеHTMLПостроеноНаWebkit = ПараметрыФормированияРедакторов.ПолеHTMLПостроеноНаWebkit;

	Если ПолеHTMLПостроеноНаWebkit Тогда
		ТекущаяСтраница = Элементы.ГруппаСтраницаПолеHTML;
		ИнициализироватьПолеHTMLТерминала();
	Иначе
		ТекущаяСтраница = Элементы.ГруппаСтраницаПоля1С;
		Элементы.ВыполнитьКоманду.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

	Элементы.ГруппаСтраницыТерминала.ТекущаяСтраница = ТекущаяСтраница;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СобытияПоляHTMLТерминалаКОбработке = Новый Массив;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПолеHTMLТерминалаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ДанныеСобытия.Event.type <> "click" Тогда
		Возврат;
	КонецЕсли;
	ДанныеСобытияДля1С = ДанныеСобытия.Event.detail;

	Если ДанныеСобытияДля1С = Неопределено Или ТипЗнч(ДанныеСобытияДля1С) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	ИмяСобытия = ДанныеСобытияДля1С.name; //Строка
	ДополнительныеДанныеСобытия = ДанныеСобытияДля1С.data; // Неопределено, Строка
	Если Не ЗначениеЗаполнено(ИмяСобытия) Тогда
		Возврат;
	КонецЕсли;

	ДобавитьСобытиеПоляHTMLКОбработке(ИмяСобытия, ДополнительныеДанныеСобытия);
	ПодключитьОбработчикОжидания("ОтложеннаяОбработкаСобытияПоляHTMLТерминала", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLТерминалаДокументСформирован(Элемент)
	Если Не ПолеHTMLПостроеноНаWebkit Тогда
		Возврат;
	КонецЕсли;
	ТекущийЭлемент = Элементы.ПолеHTMLТерминала;
	ПодключитьОбработчикОжидания("ОтложеннаяОбработкаСобытияПоляHTMLТерминалаДокументСформирован", 0.2, Истина);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();
	Стр = СтрРазделить(ВыводКоманд, Символы.ПС);
	Элементы.ВыводКоманд.УстановитьГраницыВыделения(Стр.Количество(), 1, Стр.Количество(), 1);

	ТекущийЭлемент = Элементы.СтрокаВыполнения;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область АПИТерминалаHTML
&НаКлиенте
Процедура УстановитьТекущийКаталог(ДокументView, Каталог)
	ДокументView.appTo1C.setPath(Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполнениеКоманды(ДокументView, ВыводКоманды)
	ДокументView.appTo1C.endOperation(ВыводКоманды);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщиеКомандыСистемы(ДокументView, КомандыСистемыВPath)
	ДокументView.appTo1C.setCommonCommands(КомандыСистемыВPath);
КонецПроцедуры
#КонецОбласти

// Новый событие поля HTMLКОбработке.
//
// Возвращаемое значение:
//  Структура - Новый событие поля HTMLКОбработке:
// * Имя - Строка -
// * Данные - Строка -
&НаКлиенте
Функция НовыйСобытиеПоляHTMLКОбработке()
	Данные = Новый Структура;
	Данные.Вставить("Имя", "");
	Данные.Вставить("Данные", "");

	Возврат Данные;
КонецФункции

// Добавить событие поля HTMLКОбработке.
//
// Параметры:
//  Имя - Строка - Имя
//  Данные - Строка -Данные
&НаКлиенте
Процедура ДобавитьСобытиеПоляHTMLКОбработке(Имя, Данные)
	Событие = НовыйСобытиеПоляHTMLКОбработке();
	Событие.Имя = Имя;
	Событие.Данные = Данные;
	СобытияПоляHTMLТерминалаКОбработке.Добавить(Событие);
КонецПроцедуры

&НаКлиенте
Процедура ОтложеннаяОбработкаСобытияПоляHTMLТерминала()
	Для Каждого ТекСобытиеПоля Из СобытияПоляHTMLТерминалаКОбработке Цикл
		Если ТекСобытиеПоля.Имя = "ONE_TERMINAL_EVENT_START_COMMAND" Тогда
			ОбработатьСобытиеПоляHTMLТерминалаНачалоВыполненияКоманды(СокрЛП(СтрЗаменить(ТекСобытиеПоля.Данные,
																						 Символы.НПП,
																						 " ")));
		КонецЕсли;
	КонецЦикла;
	СобытияПоляHTMLТерминалаКОбработке.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтложеннаяОбработкаСобытияПоляHTMLТерминалаДокументСформирован()
	КомандыСистемыВPath = КомандыСистемыВКаталогеДляПоляHTML();

	ДокументView = ОбъектViewПоляHTML(Элементы.ПолеHTMLТерминала);
	Если ДокументView = Неопределено Тогда
		Возврат;
	КонецЕсли;

 	УстановитьТекущийКаталог(ДокументView, ТекущийКаталог);
	УстановитьОбщиеКомандыСистемы(ДокументView, КомандыСистемыВPath);
КонецПроцедуры

// Обработать событие поля HTMLТерминала начало выполнения команды.
//
// Параметры:
//  ТекстКоманды -Строка-Текст команды
&НаКлиенте
Процедура ОбработатьСобытиеПоляHTMLТерминалаНачалоВыполненияКоманды(ТекстКоманды)
	КаталогДоВыполнения = ТекущийКаталог;
	РезультатВыполненияКоманды = РезультатВыполненияКоманды(ТекстКоманды, ТекущийКаталог);

	ДокументView = ОбъектViewПоляHTML(Элементы.ПолеHTMLТерминала);
	Если ДокументView = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если КаталогДоВыполнения <> ТекущийКаталог Тогда
		УстановитьТекущийКаталог(ДокументView, ТекущийКаталог);
	КонецЕсли;
	ЗавершитьВыполнениеКоманды(ДокументView, РезультатВыполненияКоманды.ВыводКоманды);

КонецПроцедуры

&НаКлиенте
Функция ОбъектViewПоляHTML(Элемент)
	Документ = Элемент.Документ;
	Если Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Документ.defaultView;

КонецФункции

&НаСервере
Процедура ИнициализироватьПолеHTMLТерминала()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанныеJS = ОбработкаОбъект.ПолучитьМакет("AppJS");
	АдресJS = ПоместитьВоВременноеХранилище(ДвоичныеДанныеJS, УникальныйИдентификатор);

	ДвоичныеДанныеCSS = ОбработкаОбъект.ПолучитьМакет("AppCss");
	ТекстCSS = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеCSS, КодировкаТекста.UTF8);
	ПолеHTMLТерминала = "<!doctype html>
						|<html lang=""ru"">
						|<head>
						|<meta charset=""UTF-8""/>
						|<meta name=""viewport"" content=""width=device-width,initial-scale=1""/>
						|<meta http-equiv=""X-UA-Compatible"" content=""ie=edge""/>
						|<title>OneTerminal</title>
						|<style>
						|" + ТекстCSS + "
										|</style>
										|</head>
										|<body>
										|<div id=""app""></div>
										|<script defer=""defer"" src=""" + АдресJS + """>
																					 |</script>
																					 |</body>
																					 |</html>";
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийКаталогПоУмолчанию()
	Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
		КомандаОпределенияПутиПользователя = "cd %USERPROFILE%";
	Иначе
		КомандаОпределенияПутиПользователя = "cd $HOME";
	КонецЕсли;

	РезультатКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемыУпрощенно(КомандаОпределенияПутиПользователя);
	ТекущийКаталог = РезультатКоманды.ТекущийКаталог;

КонецПроцедуры

// Результат выполнения команды.
//
// Параметры:
//  СтрокаКоманды - Строка - Строка команды
//  Каталог - Строка - Каталог
//
// Возвращаемое значение:
//  см. УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемы
&НаСервере
Функция РезультатВыполненияКоманды(СтрокаКоманды, Знач Каталог)
	ПараметрыВыполненияКоманды = УИ_ОбщегоНазначенияКлиентСервер.НовыйПараметрыВыполненияКомандыСистемы();
	ПараметрыВыполненияКоманды.Каталог = Каталог;
	ПараметрыВыполненияКоманды.Команда = СтрокаКоманды;

	Для Каждого СтрокаТаблицы Из ПеременныеОкружения Цикл
		ПараметрыВыполненияКоманды.ПеременныеОкружения.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;

	РезультатВыполненияКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемы(ПараметрыВыполненияКоманды);
	ОбновитьЗначенияИзмененныхПеременныхОкруженияВТаблице(РезультатВыполненияКоманды);

	ТекущийКаталог = РезультатВыполненияКоманды.ТекущийКаталог;

	Возврат РезультатВыполненияКоманды;
КонецФункции

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	РезультатВыполненияКоманды = РезультатВыполненияКоманды(СтрокаВыполнения, ТекущийКаталог);

	ВыводКоманд = СтрШаблон("%1
							|$ %2
							|%3", ВыводКоманд, СтрокаВыполнения, РезультатВыполненияКоманды.ВыводКоманды);

	СтрокаВыполнения = "";
КонецПроцедуры

// Обновить значения измененных переменных окружения в таблице.
//
// Параметры:
//  РезультатВыполненияКоманды - см. УИ_ОбщегоНазначенияКлиентСервер.НовыйРезультатВыполненияКомандыСистемы
&НаСервере
Процедура ОбновитьЗначенияИзмененныхПеременныхОкруженияВТаблице(РезультатВыполненияКоманды)
	Для Каждого КлючЗначение Из РезультатВыполненияКоманды.ИзмененныеПеременныеОкружения Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Имя", КлючЗначение.Ключ);
		НайденныеСтроки = ПеременныеОкружения.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаПеременной = НайденныеСтроки[0];
		Иначе
			СтрокаПеременной = ПеременныеОкружения.Добавить();
			СтрокаПеременной.Имя = КлючЗначение.Ключ;
		КонецЕсли;
		СтрокаПеременной.Значение = КлючЗначение.Значение;

	КонецЦикла;
КонецПроцедуры

// Команды системы в каталоге для поля HTML.
//
// Параметры:
//  Каталог - Строка - Каталог
//
// Возвращаемое значение:
//  Строка - Команды системы в каталоге для поля HTML
&НаСервереБезКонтекста
Функция КомандыСистемыВКаталогеДляПоляHTML(Каталог = "")
	КомандыСистемы = КомандыСистемыВКаталоге(Каталог);

	Возврат УИ_ОбщегоНазначенияКлиентСервер.мЗаписатьJSON(КомандыСистемы);
КонецФункции

// Команды системы path.
//Параметры:
//	Каталог - Строка -
//
// Возвращаемое значение:
//  Массив Из Строка
&НаСервереБезКонтекста
Функция КомандыСистемыВКаталоге(Каталог = "")
	ВСтрокахВыводитсяПолныйПуть = Истина;
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		//Получаем общедоступные команды
		Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
			ВыполняемаяКоманда = "where *.exe";
		Иначе
			ВыполняемаяКоманда = "compgen -c";
			ВСтрокахВыводитсяПолныйПуть = Ложь;
		КонецЕсли;
	Иначе
		Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
			ВыполняемаяКоманда = СтрШаблон("where  ""%1:*.exe""", Каталог);
		Иначе
			ВыполняемаяКоманда = СтрШаблон("find ""%1"" -maxdepth 1  -type f -executable", Каталог);
		КонецЕсли;
	КонецЕсли;

	РезультатКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемыУпрощенно(ВыполняемаяКоманда);
	Если РезультатКоманды.КодВозврата <> 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	КомандыСистемы = Новый СписокЗначений();

	СтрокиКоманд = СтрРазделить(РезультатКоманды.ВыводКоманды, Символы.ПС, Ложь);

	РазделительПути = ПолучитьРазделительПути();

	Для Каждого ТекСтрокаКоманды Из СтрокиКоманд Цикл
		Если ВСтрокахВыводитсяПолныйПуть Тогда
			СоставныеЧастиКоманды = СтрРазделить(ТекСтрокаКоманды, РазделительПути);
			КомандаДляДобавления = СоставныеЧастиКоманды[СоставныеЧастиКоманды.Количество() - 1];

		Иначе
			КомандаДляДобавления = ТекСтрокаКоманды;
		КонецЕсли;
		Если КомандыСистемы.НайтиПоЗначению(КомандаДляДобавления) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		КомандыСистемы.Добавить(КомандаДляДобавления);
	КонецЦикла;

	КомандыСистемы.СортироватьПоЗначению();

	Возврат КомандыСистемы.ВыгрузитьЗначения();
КонецФункции

&НаСервере
Процедура ЗаполнитьИнформациюОСервере()
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ОперационнаяСистема = СистемнаяИнформация.ВерсияОС;
	ТипПлатформыОС = СистемнаяИнформация.ТипПлатформы;
КонецПроцедуры

#КонецОбласти

