
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьТекущийКаталогПоУмолчанию();

	Элементы.ВыполнитьКоманду.КнопкаПоУмолчанию = Истина;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();
	Стр = СтрРазделить(ВыводКоманд, Символы.ПС);
	Элементы.ВыводКоманд.УстановитьГраницыВыделения(Стр.Количество(), 1, Стр.Количество(), 1);

	ТекущийЭлемент = Элементы.СтрокаВыполнения;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекущийКаталогПоУмолчанию()
	Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
		КомандаОпределенияПутиПользователя = "cd %USERPROFILE%";
	Иначе
		КомандаОпределенияПутиПользователя = "cd $HOME";
	КонецЕсли;

	РезультатКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемыУпрощенно(КомандаОпределенияПутиПользователя);
	ТекущийКаталог = РезультатКоманды.ТекущийКаталог;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	ПараметрыВыполненияКоманды = УИ_ОбщегоНазначенияКлиентСервер.НовыйПараметрыВыполненияКомандыСистемы();
	ПараметрыВыполненияКоманды.Каталог = ТекущийКаталог;
	ПараметрыВыполненияКоманды.Команда = СтрокаВыполнения;

	РезультатВыполненияКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемы(ПараметрыВыполненияКоманды);
	ТекущийКаталог = РезультатВыполненияКоманды.ТекущийКаталог;

	ВыводКоманд = СтрШаблон("%1
							|$ %2
							|%3", ВыводКоманд, СтрокаВыполнения, РезультатВыполненияКоманды.ВыводКоманды);

	СтрокаВыполнения = "";
КонецПроцедуры



#КонецОбласти

