
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьИнформациюОСервере();
	УстановитьТекущийКаталогПоУмолчанию();
	КомандыСистемыВPath = КомандыСистемыВКаталоге();

	Элементы.ВыполнитьКоманду.КнопкаПоУмолчанию = Истина;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();
	Стр = СтрРазделить(ВыводКоманд, Символы.ПС);
	Элементы.ВыводКоманд.УстановитьГраницыВыделения(Стр.Количество(), 1, Стр.Количество(), 1);

	ТекущийЭлемент = Элементы.СтрокаВыполнения;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекущийКаталогПоУмолчанию()
	Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
		КомандаОпределенияПутиПользователя = "cd %USERPROFILE%";
	Иначе
		КомандаОпределенияПутиПользователя = "cd $HOME";
	КонецЕсли;

	РезультатКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемыУпрощенно(КомандаОпределенияПутиПользователя);
	ТекущийКаталог = РезультатКоманды.ТекущийКаталог;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	ПараметрыВыполненияКоманды = УИ_ОбщегоНазначенияКлиентСервер.НовыйПараметрыВыполненияКомандыСистемы();
	ПараметрыВыполненияКоманды.Каталог = ТекущийКаталог;
	ПараметрыВыполненияКоманды.Команда = СтрокаВыполнения;

	Для Каждого СтрокаТаблицы Из ПеременныеОкружения Цикл
		ПараметрыВыполненияКоманды.ПеременныеОкружения.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;

	РезультатВыполненияКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемы(ПараметрыВыполненияКоманды);
	ТекущийКаталог = РезультатВыполненияКоманды.ТекущийКаталог;
	ОбновитьЗначенияИзмененныхПеременныхОкруженияВТаблице(РезультатВыполненияКоманды);

	ВыводКоманд = СтрШаблон("%1
							|$ %2
							|%3", ВыводКоманд, СтрокаВыполнения, РезультатВыполненияКоманды.ВыводКоманды);

	СтрокаВыполнения = "";
КонецПроцедуры

// Обновить значения измененных переменных окружения в таблице.
//
// Параметры:
//  РезультатВыполненияКоманды - см. УИ_ОбщегоНазначенияКлиентСервер.НовыйРезультатВыполненияКомандыСистемы
&НаСервере
Процедура ОбновитьЗначенияИзмененныхПеременныхОкруженияВТаблице(РезультатВыполненияКоманды)
	Для Каждого КлючЗначение Из РезультатВыполненияКоманды.ИзмененныеПеременныеОкружения Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Имя", КлючЗначение.Ключ);
		НайденныеСтроки = ПеременныеОкружения.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаПеременной = НайденныеСтроки[0];
		Иначе
			СтрокаПеременной = ПеременныеОкружения.Добавить();
			СтрокаПеременной.Имя = КлючЗначение.Ключ;
		КонецЕсли;
		СтрокаПеременной.Значение = КлючЗначение.Значение;

	КонецЦикла;
КонецПроцедуры

// Команды системы path.
//Параметры:
//	Каталог - Строка -
//
// Возвращаемое значение:
//  Массив Из Строка
&НаСервереБезКонтекста
Функция КомандыСистемыВКаталоге(Каталог = "")
	ВСтрокахВыводитсяПолныйПуть = Истина;
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		//Получаем общедоступные команды
		Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
			ВыполняемаяКоманда = "where *.exe";
		Иначе
			ВыполняемаяКоманда = "compgen -c";
			ВСтрокахВыводитсяПолныйПуть = Ложь;
		КонецЕсли;
	Иначе
		Если УИ_ОбщегоНазначенияКлиентСервер.ЭтоWindows() Тогда
			ВыполняемаяКоманда = СтрШаблон("where  ""%1:*.exe""", Каталог);
		Иначе
			ВыполняемаяКоманда = СтрШаблон("find ""%1"" -maxdepth 1  -type f -executable", Каталог);
		КонецЕсли;
	КонецЕсли;

	РезультатКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемыУпрощенно(ВыполняемаяКоманда);
	Если РезультатКоманды.КодВозврата <> 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	КомандыСистемы = Новый СписокЗначений();

	СтрокиКоманд = СтрРазделить(РезультатКоманды.ВыводКоманды, Символы.ПС, Ложь);

	РазделительПути = ПолучитьРазделительПути();

	Для Каждого ТекСтрокаКоманды Из СтрокиКоманд Цикл
		Если ВСтрокахВыводитсяПолныйПуть Тогда
			СоставныеЧастиКоманды = СтрРазделить(ТекСтрокаКоманды, РазделительПути);
			КомандаДляДобавления = СоставныеЧастиКоманды[СоставныеЧастиКоманды.Количество() - 1];

		Иначе
			КомандаДляДобавления = ТекСтрокаКоманды;
		КонецЕсли;
		Если КомандыСистемы.НайтиПоЗначению(КомандаДляДобавления) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		КомандыСистемы.Добавить(КомандаДляДобавления);
	КонецЦикла;

	КомандыСистемы.СортироватьПоЗначению();

	Возврат КомандыСистемы.ВыгрузитьЗначения();
КонецФункции

&НаСервере
Процедура ЗаполнитьИнформациюОСервере()
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ОперационнаяСистема = СистемнаяИнформация.ВерсияОС;
	ТипПлатформыОС = СистемнаяИнформация.ТипПлатформы;
КонецПроцедуры

#КонецОбласти

