
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();
	Стр = СтрРазделить(ВыводКоманд, Символы.ПС);
	Элементы.ВыводКоманд.УстановитьГраницыВыделения(Стр.Количество(), 1, Стр.Количество(), 1);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	ПараметрыВыполненияКоманды = УИ_ОбщегоНазначенияКлиентСервер.НовыйПараметрыВыполненияКомандыСистемы();
	ПараметрыВыполненияКоманды.Каталог = ТекущийКаталог;
	ПараметрыВыполненияКоманды.Команда = СтрокаВыполнения;

	РезультатВыполненияКоманды = УИ_ОбщегоНазначения.РезультатВыполненияКомандыСистемы(ПараметрыВыполненияКоманды);
	ТекущийКаталог = РезультатВыполненияКоманды.ТекущийКаталог;

	ВыводКоманд = СтрШаблон("%1
							|$ %2
							|%3", ВыводКоманд, СтрокаВыполнения, РезультатВыполненияКоманды.ВыводКоманды);

КонецПроцедуры
#КонецОбласти

