
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	
	ПереданныйСписокЭлементов = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Параметры.Значение);
	ТипКонтейнера = Параметры.ТипКонтейнера;
	
	Если ТипКонтейнера = 2 Тогда
		Заголовок = Параметры.Заголовок + " (массив)";
		СписокЭлементов.ЗагрузитьЗначения(ПереданныйСписокЭлементов);
	Иначе
		Заголовок = Параметры.Заголовок + " (список значений)";
		СписокЭлементов = ПереданныйСписокЭлементов;
	КонецЕсли;
	
	СписокЭлементов.ТипЗначения = Параметры.ТипЗначения;
	
	маТипыБезПодбора = Новый Массив;
	маТипыБезПодбора.Добавить(Тип("Число"));
	маТипыБезПодбора.Добавить(Тип("Строка"));
	маТипыБезПодбора.Добавить(Тип("Дата"));
	маТипыБезПодбора.Добавить(Тип("Неопределено"));
	маТипыБезПодбора.Добавить(Тип("Тип"));
	маТипыБезПодбора.Добавить(Тип("ВидДвиженияНакопления"));
	маТипыБезПодбора.Добавить(Тип("ВидДвиженияБухгалтерии"));
	маТипыБезПодбора.Добавить(Тип("ВидСчета"));
	маТипыБезПодбора.Добавить(Тип("УникальныйИдентификатор"));
	маТипыБезПодбора.Добавить(Тип("NULL"));
	ТипыБезПодбора = Новый ОписаниеТипов(маТипыБезПодбора);
	
	маТипы = Параметры.ТипЗначения.Типы();
	Элементы.СписокЭлементовПодбор.Видимость = Истина;
	Для Каждого Тип Из маТипы Цикл
		Если ТипыБезПодбора.СодержитТип(Тип) Тогда
			Элементы.СписокЭлементовПодбор.Видимость = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолноеИмяФормы(ИмяФормы)
	Возврат СтрШаблон("%1.Форма.%2", Объект.ПутьМетаданных, ИмяФормы);
КонецФункции

&НаСервере
Функция ПолучитьВозвращаемоеЗначение()
	
	Если ТипКонтейнера = 2 Тогда
		Возврат РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(СписокЭлементов.ВыгрузитьЗначения());
	КонецЕсли;
	
	Возврат РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(СписокЭлементов);
	
КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)

	ВозвращаемоеЗначение = Новый Структура("Значение", ПолучитьВозвращаемоеЗначение());
	
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	СписокЭлементов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗначение()
	
	Значение = Элементы.СписокЭлементов.ТекущиеДанные.Значение;
	Если ТипЗнч(Значение) = Тип("Тип") Тогда

		ПараметрыОповещения = Новый Структура("Строка", Элементы.СписокЭлементов.ТекущаяСтрока);
		//@skip-warning
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияТипа", ЭтаФорма, ПараметрыОповещения);
		
		Если ТипЗнч(Значение) <> Тип("Тип") Тогда
			Значение = Тип("Неопределено");
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения", Объект, Значение);
		ОткрытьФорму(ПолноеИмяФормы("РедактированиеТипа"), ПараметрыОткрытия, ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда

		ПараметрыОповещения = Новый Структура("Строка", Элементы.СписокЭлементов.ТекущаяСтрока);
		//@skip-warning
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияТипа", ЭтаФорма, ПараметрыОповещения);
		
		ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, Значение);
		ОткрытьФорму(ПолноеИмяФормы("РедактированиеУникальногоИдентификатора"), ПараметрыОткрытия, ЭтаФорма, Истина, , , ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭлементовЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Значение = Элементы.СписокЭлементов.ТекущиеДанные.Значение;
	
	ТипРедактируемогоЗначения = ТипЗнч(Значение);
	
	Если ТипРедактируемогоЗначения = Тип("Тип") ИЛИ ТипРедактируемогоЗначения = Тип("УникальныйИдентификатор") Тогда
		РедактироватьЗначение();
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭлементовЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("Тип") Тогда
		СписокЭлементов.НайтиПоИдентификатору(Элементы.СписокЭлементов.ТекущаяСтрока).Значение = Тип("Неопределено");
		РедактироватьЗначение();
	ИначеЕсли ВыбранноеЗначение = Тип("УникальныйИдентификатор") Тогда
		СписокЭлементов.НайтиПоИдентификатору(Элементы.СписокЭлементов.ТекущаяСтрока).Значение = Новый УникальныйИдентификатор;
		РедактироватьЗначение();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОкончаниеРедактированияТипа(Результат, ПараметрыОповещения) Экспорт
	Перем Значение;
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Свойство("Значение", Значение) Тогда
			
			СписокЭлементов.НайтиПоИдентификатору(ПараметрыОповещения.Строка).Значение = Значение;
			
		Иначе
		
			СписокЭлементов.НайтиПоИдентификатору(ПараметрыОповещения.Строка).Значение = Тип(Результат.ОписаниеКонтейнера.ИмяТипа);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

