&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КопироватьДанныеФормы(Параметры.Объект, Объект);

	ПереданныйСписокЭлементов = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Параметры.Значение);
	ТипКонтейнера = Параметры.ТипКонтейнера;

	Если ТипКонтейнера = 2 Тогда
		Заголовок = Параметры.Заголовок + " (массив)";
		СписокЭлементов.ЗагрузитьЗначения(ПереданныйСписокЭлементов);
	Иначе
		Заголовок = Параметры.Заголовок + " (список значений)";
		СписокЭлементов = ПереданныйСписокЭлементов;
	КонецЕсли;

	СписокЭлементов.ТипЗначения = Параметры.ТипЗначения;

	маТипыБезПодбора = Новый Массив;
	маТипыБезПодбора.Добавить(Тип("Число"));
	маТипыБезПодбора.Добавить(Тип("Строка"));
	маТипыБезПодбора.Добавить(Тип("Дата"));
	маТипыБезПодбора.Добавить(Тип("Неопределено"));
	маТипыБезПодбора.Добавить(Тип("NULL"));
	ТипыБезПодбора = Новый ОписаниеТипов(маТипыБезПодбора);

	маТипы = Параметры.ТипЗначения.Типы();
	Элементы.СписокЭлементовПодбор.Видимость = Ложь;
	Для Каждого Тип Из маТипы Цикл
		Если Не ТипыБезПодбора.СодержитТип(Тип) Тогда
			Элементы.СписокЭлементовПодбор.Видимость = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьВозвращаемоеЗначение()

	Если ТипКонтейнера = 2 Тогда
		Возврат РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(СписокЭлементов.ВыгрузитьЗначения());
	КонецЕсли;

	Возврат РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(СписокЭлементов);

КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)

	ВозвращаемоеЗначение = Новый Структура("Значение", ПолучитьВозвращаемоеЗначение());

	Закрыть(ВозвращаемоеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	СписокЭлементов.Очистить();
КонецПроцедуры