&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Для Каждого Алгоритм Из ПараметрКоманды Цикл
		Ошибка = Ложь;
		СообщениеОбОшибке = "";

		Если АлгоритмВыполняетсяНаКлиенте(Алгоритм) Тогда
			UT_CommonClient.ВыполнитьАлгоритм(Алгоритм, , Ошибка, СообщениеОбОшибке);
		Иначе
			UT_CommonServerCall.ВыполнитьАлгоритм(Алгоритм, , Ошибка, СообщениеОбОшибке);
		КонецЕсли;
		Если Ошибка Тогда
			UT_CommonClientServer.MessageToUser(СообщениеОбОшибке);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АлгоритмВыполняетсяНаКлиенте(Алгоритм)

	Возврат Алгоритм.НаКлиенте;

КонецФункции
