&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.СвязьПоВладельцу.Видимость = ИспользоватьВладельца;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если УИ_ОбщегоНазначенияКлиентСервер.ВерсияПлатформыНеМладше("8.3.1") Тогда
		Элементы.ИскатьПо.КнопкаВыпадающегоСписка = Истина;
		Элементы.СвязьПоВладельцу.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)

	ОповеститьОВыборе(Новый Структура("Источник, Результат, ИскатьПо, СвязьПоВладельцу", "ФормаРедактированияСвязи",
		Истина, ИскатьПо, СвязьПоВладельцу));

КонецПроцедуры