#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Или ВнешнееСоединение Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	пСтрук = новый Структура("ДополнительныеОтчетыИОбработки, ДополнительныеОтчетыИОбработкиКлиентСервер");
	
	пТекст = "Проблемы с регистрацией внешней обработки!
	|Необходимо подправить функцию СведенияОВнешнейОбработке(...) в модуле объекта
	|в соответствии с текущей версией БСП";
	
	Попытка
		Для каждого Элем из пСтрук Цикл
			пСтрук[Элем.Ключ] = Вычислить(Элем.Ключ);
		КонецЦикла;
	Исключение
		ВызватьИсключение пТекст;
	КонецПопытки;
	
	пОписание = вСформироватьОписаниеРазработки();
	
	Попытка
		ПараметрыРегистрации = пСтрук.ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
		ПараметрыРегистрации.Вид = пСтрук.ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
		ПараметрыРегистрации.Версия = пОписание.НомерВерсии;
		ПараметрыРегистрации.БезопасныйРежим = ложь;
		
		Команда = ПараметрыРегистрации.Команды.Добавить();
		Команда.Представление = пОписание.Наименование;
		Команда.Идентификатор = "ВнешняяОбработка." + ЭтотОбъект.Метаданные().Имя;
		Команда.Использование = пСтрук.ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		Команда.ПоказыватьОповещение = ложь;
	Исключение
		ВызватьИсключение пТекст;
	КонецПопытки;
	
	Возврат ПараметрыРегистрации; 
КонецФункции

Функция вСформироватьОписаниеРазработки() Экспорт
	пСтрук = новый Структура;
	пСтрук.Вставить("Наименование", "СДР: Навигатор по конфигурации");
	пСтрук.Вставить("НомерВерсии", "1.1.0.113");
	пСтрук.Вставить("ДатаВерсии", "14.12.2025");
	пСтрук.Вставить("Описание", "https://infostart.ru/public/931586/");
	
	Возврат пСтрук;
КонецФункции

#КонецЕсли
