
#Область ПрограммныйИнтерфейс

#Область РедактированиеАлгоритмов

Процедура СоздатьАлгоритм(ОписаниеОповещенияОЗавершении = Неопределено,
	ИдентификаторАлгоритмаКопирования = Неопределено) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеКопирования", ИдентификаторАлгоритмаКопирования);

	Если ОписаниеОповещенияОЗавершении = Неопределено Тогда
		ОткрытьФорму("Обработка.УИ_Алгоритмы2.Форма.ФормаЭлемента", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Обработка.УИ_Алгоритмы2.Форма.ФормаЭлемента",
					 ПараметрыФормы,
					 ,
					 ,
					 ,
					 ,
					 ОписаниеОповещенияОЗавершении);

	КонецЕсли;
КонецПроцедуры

Процедура РедактироватьАлгоритм(Идентификатор, ОписаниеОповещенияОЗавершении = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
