#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантыРедактора = УИ_РедакторКодаКлиентСервер.ВариантыРедактораКода();
	
	Элементы.РедакторКода1С.СписокВыбора.Очистить();
	Для Каждого КлючЗначение ИЗ ВариантыРедактора Цикл
		Элементы.РедакторКода1С.СписокВыбора.Добавить(КлючЗначение.Значение);
	КонецЦикла;		
	
	РедакторКода1С = УИ_РедакторКодаСервер.ТекущийВариантРедактораКода1С();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Применить(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПрименитьНаСервере()
	УИ_РедакторКодаСервер.УстановитьВариантРедактораКода1С(РедакторКода1С);
КонецПроцедуры
#КонецОбласти