////////////////////////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS
//

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	VerifyAccessRights("Administration", Metadata);

	If Parameters.Property("AutoTests") Then // Return when a form is received for analysis.
		Return;
	EndIf;

	CurrentObject = ThisObject();
	CurrentObject.ReadSettings();
	CurrentObject.ReadSSLSupportFlags();
	ThisObject(CurrentObject);
	
	RegistrationObject = Parameters.RegistrationObject;
	Details       = "";
	
	If TypeOf(RegistrationObject) = Type("Structure") Then
		RegistrationTable = Parameters.RegistrationTable;
		ObjectAsString = RegistrationTable;
		For Each KeyValue In RegistrationObject Do
			Details = Details + "," + KeyValue.Value;
		EndDo;
		Details = " (" + Mid(Details,2) + ")";
	Else		
		RegistrationTable = "";
		ObjectAsString = RegistrationObject;
	EndIf;
	Title = NStr("ru = 'Регистрация '; en = 'Registration'") + CurrentObject.RefPresentation(ObjectAsString) + Details;

	ReadExchangeNodes();
EndProcedure

&НаКлиенте
Процедура OnOpen(Отказ)
	РазвернутьВсеУзлы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ExchangeNodesTree
//

&НаКлиенте
Процедура ExchangeNodesTreeSelection(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле = Элементы.ExchangeNodesTreeDescription Или Поле = Элементы.ExchangeNodesTreeCode Тогда
		ОткрытьФормуРедактированияДругихОбъектов();
		Возврат;
	ИначеЕсли Поле <> Элементы.ExchangeNodesTreeMessageNumber Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДаные = Элементы.ExchangeNodesTree.ТекущиеДанные;
	Оповещение = Новый ОписаниеОповещения("ДеревоУзловОбменаВыборЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Узел", ТекущиеДаные.Ссылка);

	Подсказка = НСтр("ru='Номер отправленного'");
	ПоказатьВводЧисла(Оповещение, ТекущиеДаные.НомерСообщения, Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура ExchangeNodesTreeCheckMarkOnChange(Элемент)
	ИзменениеПометки(Элементы.ExchangeNodesTree.ТекущаяСтрока);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура RereadNodeTree(Команда)
	ТекущийУзел = ТекущийВыбранныйУзел();
	ПрочитатьУзлыОбмена();
	РазвернутьВсеУзлы(ТекущийУзел);
КонецПроцедуры

&НаКлиенте
Процедура OpenEditFormFromNode(Команда)
	ОткрытьФормуРедактированияДругихОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура MarkAllNodes(Команда)
	Для Каждого СтрокаПлана Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
		СтрокаПлана.Check = Истина;
		ИзменениеПометки(СтрокаПлана.ПолучитьИдентификатор());
	КонецЦикла
	;
КонецПроцедуры

&НаКлиенте
Процедура UnmarkAllNodes(Команда)
	Для Каждого СтрокаПлана Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
		СтрокаПлана.Check = Ложь;
		ИзменениеПометки(СтрокаПлана.ПолучитьИдентификатор());
	КонецЦикла
	;
КонецПроцедуры

&НаКлиенте
Процедура InvertAllNodesChecks(Команда)
	Для Каждого СтрокаПлана Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаУзла Из СтрокаПлана.ПолучитьЭлементы() Цикл
			СтрокаУзла.Check = Не СтрокаУзла.Check;
			ИзменениеПометки(СтрокаУзла.ПолучитьИдентификатор());
		КонецЦикла
		;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура EditRegistration(Команда)

	ЗаголовокВопроса = НСтр("ru='Подтверждение'");
	Текст = НСтр("ru='Изменить регистрацию ""%1""
				 |на узлах?'");

	Текст = СтрЗаменить(Текст, "%1", ОбъектРегистрации);

	Оповещение = Новый ОписаниеОповещения("ИзменитьРегистрациюЗавершение", ЭтотОбъект);

	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРегистрациюЗавершение(Знач РезультатВопроса, Знач ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Колво = ИзменениеРегистрацииПоУзлам(ExchangeNodesTree);
	Если Колво > 0 Тогда
		Текст = НСтр("ru = 'Регистрация %1 была изменена на %2 узлах'");
		ЗаголовокОповещения = НСтр("ru = 'Изменение регистрации:'");

		Текст = СтрЗаменить(Текст, "%1", ОбъектРегистрации);
		Текст = СтрЗаменить(Текст, "%2", Колво);

		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ПолучитьНавигационнуюСсылку(ОбъектРегистрации), Текст,
			Элементы.HiddenPictureInformation32.Картинка);

		Если Параметры.ОповещатьОбИзменениях Тогда
			Оповестить("ИзменениеРегистрацииОбменаДаннымиОбъекта",
				Новый Структура("ОбъектРегистрации, ТаблицаРегистрации", ОбъектРегистрации, ТаблицаРегистрации),
				ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

	ТекущийУзел = ТекущийВыбранныйУзел();
	ПрочитатьУзлыОбмена(Истина);
	РазвернутьВсеУзлы(ТекущийУзел);
КонецПроцедуры

&НаКлиенте
Процедура OpenSettingsForm(Команда)
	ОткрытьФормуНастроекОбработки();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Процедура ДеревоУзловОбменаВыборЗавершение(Знач Число, Знач ДополнительныеПараметры) Экспорт
	Если Число = Неопределено Тогда 
		// Отказ от ввода
		Возврат;
	КонецЕсли;

	ИзменитьНомерСообщенияНаСервере(ДополнительныеПараметры.Узел, Число, ОбъектРегистрации, ТаблицаРегистрации);

	ТекущийУзел = ТекущийВыбранныйУзел();
	ПрочитатьУзлыОбмена(Истина);
	РазвернутьВсеУзлы(ТекущийУзел);

	Если Параметры.ОповещатьОбИзменениях Тогда
		Оповестить("ИзменениеРегистрацииОбменаДаннымиОбъекта", Новый Структура("ОбъектРегистрации, ТаблицаРегистрации",
			ОбъектРегистрации, ТаблицаРегистрации), ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТекущийВыбранныйУзел()
	ТекущиеДанные = Элементы.ExchangeNodesTree.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("Description, Ссылка", ТекущиеДанные.Description, ТекущиеДанные.Ссылка);
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастроекОбработки()
	ТекИмяФормы = ПолучитьИмяФормы() + "Форма.Настройки";
	ОткрытьФорму(ТекИмяФормы, , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияДругихОбъектов()
	ТекИмяФормы = ПолучитьИмяФормы() + "Форма.Форма";
	Данные = Элементы.ExchangeNodesTree.ТекущиеДанные;
	Если Данные <> Неопределено И Данные.Ссылка <> Неопределено Тогда
		ТекПараметры = Новый Структура("УзелОбмена, ИдентификаторКоманды, ОбъектыНазначения", Данные.Ссылка);
		ОткрытьФорму(ТекИмяФормы, ТекПараметры, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеУзлы(УзелФокуса = Неопределено)
	НайденныйУзел = Неопределено;

	Для Каждого Строка Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
		Идентификатор = Строка.ПолучитьИдентификатор();
		Элементы.ExchangeNodesTree.Развернуть(Идентификатор, Истина);

		Если УзелФокуса <> Неопределено И НайденныйУзел = Неопределено Тогда
			Если Строка.Description = УзелФокуса.Description И Строка.Ссылка = УзелФокуса.Ссылка Тогда
				НайденныйУзел = Идентификатор;
			Иначе
				Для Каждого Подстрока Из Строка.ПолучитьЭлементы() Цикл
					Если Подстрока.Description = УзелФокуса.Description И Подстрока.Ссылка = УзелФокуса.Ссылка Тогда
						НайденныйУзел = Подстрока.ПолучитьИдентификатор();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Если УзелФокуса <> Неопределено И НайденныйУзел <> Неопределено Тогда
		Элементы.ExchangeNodesTree.ТекущаяСтрока = НайденныйУзел;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИзменениеРегистрацииПоУзлам(Знач Данные)
	ТекущийОбъект = ЭтотОбъектОбработки();
	КолвоУзлов = 0;
	Для Каждого Строка Из Данные.ПолучитьЭлементы() Цикл
		Если Строка.Ссылка <> Неопределено Тогда
			флУже = ТекущийОбъект.ОбъектЗарегистрированНаУзле(Строка.Ссылка, ОбъектРегистрации, ТаблицаРегистрации);
			Если Строка.Check = 0 И флУже Тогда
				Результат = ТекущийОбъект.ИзменитьРегистрациюНаСервере(Ложь, Истина, Строка.Ссылка, ОбъектРегистрации,
					ТаблицаРегистрации);
				КолвоУзлов = КолвоУзлов + Результат.Успешно;
			ИначеЕсли Строка.Check = 1 И (Не флУже) Тогда
				Результат = ТекущийОбъект.ИзменитьРегистрациюНаСервере(Истина, Истина, Строка.Ссылка,
					ОбъектРегистрации, ТаблицаРегистрации);
				КолвоУзлов = КолвоУзлов + Результат.Успешно;
			КонецЕсли;
		КонецЕсли;
		КолвоУзлов = КолвоУзлов + ИзменениеРегистрацииПоУзлам(Строка);
	КонецЦикла;
	Возврат КолвоУзлов;
КонецФункции

&НаСервере
Функция ИзменитьНомерСообщенияНаСервере(Узел, НомерСообщения, Данные, ИмяТаблицы = Неопределено)
	Возврат ЭтотОбъектОбработки().ИзменитьРегистрациюНаСервере(НомерСообщения, Истина, Узел, Данные, ИмяТаблицы);
КонецФункции

&НаСервере
Функция ЭтотОбъектОбработки(ТекущийОбъект = Неопределено)
	Если ТекущийОбъект = Неопределено Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьИмяФормы(ТекущийОбъект = Неопределено)
	Возврат ЭтотОбъектОбработки().ПолучитьИмяФормы(ТекущийОбъект);
КонецФункции

&НаСервере
Процедура ИзменениеПометки(Строка)
	ЭлементДанных = ExchangeNodesTree.НайтиПоИдентификатору(Строка);
	ЭтотОбъектОбработки().ИзменениеПометки(ЭлементДанных);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьУзлыОбмена(ТолькоОбновить = Ложь)
	ТекущийОбъект = ЭтотОбъектОбработки();
	Дерево = ТекущийОбъект.СформироватьДеревоУзлов(ОбъектРегистрации, ТаблицаРегистрации);

	Если ТолькоОбновить Тогда
		// Обновляем некоторые поля текущим данным
		Для Каждого СтрокаПлана Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
			Для Каждого СтрокаУзла Из СтрокаПлана.ПолучитьЭлементы() Цикл
				СтрокаДерева = Дерево.Строки.Найти(СтрокаУзла.Ссылка, "Ссылка", Истина);
				Если СтрокаДерева <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаУзла, СтрокаДерева,
						"Check, ИсходнаяПометка, MessageNo, НеВыгружалось");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		// Переформируем полностью
		ЗначениеВРеквизитФормы(Дерево, "ExchangeNodesTree");
	КонецЕсли;

	Для Каждого СтрокаПлана Из ExchangeNodesTree.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаУзла Из СтрокаПлана.ПолучитьЭлементы() Цикл
			ТекущийОбъект.ИзменениеПометки(СтрокаУзла);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры