
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок  = Параметры.Заголовок;
	КонецЕсли;

	Если Параметры.Свойство("ВозвращатьТолькоВыбранныеЗначения") Тогда
		ВозвращатьТолькоВыбранныеЗначения=Параметры.ВозвращатьТолькоВыбранныеЗначения;
	КонецЕсли;

	СписокЗначений=Параметры.Список;
КонецПроцедуры


&НаКлиенте
Процедура Применить(Команда)
	Если Не ВозвращатьТолькоВыбранныеЗначения Тогда
		СписокВозврата=СписокЗначений;
	Иначе
		СписокВозврата=Новый СписокЗначений;
		
		Для Каждого Элемент Из СписокЗначений Цикл
			Если Не Элемент.Пометка Тогда
				Продолжить;
			КонецЕсли;
			СписокВозврата.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка, Элемент.Картинка);
		КонецЦикла;
	КонецЕсли;
	
	Закрыть(СписокВозврата);
КонецПроцедуры

