
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуАлгоритмов();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок //<ИмяТаблицыФормы>

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УИ_АлгоритмыКлиент.РедактироватьАлгоритм(ТекДанные.Идентификатор,
											 Новый ОписаниеОповещения("ПослеЗавершенияИзмененияАлгоритма", ЭтотОбъект));
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;

	КопируемыйАлгоритм = Неопределено;
	Если Копирование Тогда
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			КопируемыйАлгоритм = ТекДанные.Идентификатор;
		КонецЕсли;
	КонецЕсли;

	УИ_АлгоритмыКлиент.СоздатьАлгоритм(Новый ОписаниеОповещения("ПослеЗавершенияИзмененияАлгоритма", ЭтотОбъект),
									   КопируемыйАлгоритм);

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;
	
	УИ_АлгоритмыКлиент.РедактироватьАлгоритм(ТекДанные.Идентификатор,
											 Новый ОписаниеОповещения("ПослеЗавершенияИзмененияАлгоритма", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перечитать(Команда)
	ПеречитатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуАлгоритмов()
	Список.Очистить();
	
	СписокАлгоритмов = УИ_АлгоритмыСервер.СписокАлгоритмов();
	Для Каждого Стр Из СписокАлгоритмов Цикл
		НС = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияИзмененияАлгоритма(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьТаблицуАлгоритмов();
КонецПроцедуры



&НаСервере
Процедура ПеречитатьНаСервере()
	ЗаполнитьТаблицуАлгоритмов();
КонецПроцедуры

#КонецОбласти
