
#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
&НаКлиенте
Перем УИ_ПараметрыПриложения_Портативные Экспорт;
#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект=РеквизитФормыВЗначение("Объект");

	Файл=Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	КаталогИнструментов=Файл.Путь;

	СоздатьКомандыОткрытияИнструментовНаФорме();

	Заголовок=Версия();
	
	АлгоритмВызоваОтладкиНаСервере="ВнешниеОбработки.Создать(""УИ_"")._От(ПараметрыОтладки)";
	АлгоритмВызоваОтладкиНаКлиенте="ПолучитьФорму(""ВнешняяОбработка.УИ_.Форма"")._От(ПараметрыОтладки)";
	АлгоритмВызоваОтладкиЧерезОбработку="ВнешниеОбработки.Создать(""" + ОбработкаОбъект.ИспользуемоеИмяФайла
		+ """, Ложь)._От(Запрос)";

	АдресДвоичныхДанныхКомпонентыРаботыСБуферомОбмена = ПоместитьВоВременноеХранилище(ОбработкаОбъект.ПолучитьМакет(
		"УИ_КомпонентаДляРаботыСБуферомОбмена"), УникальныйИдентификатор);
		
	ПодключитьМодулиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УИ_ПараметрыПриложения_Портативные = Новый Соответствие;
	ПодключитьОбработчикОжидания("ПриОткрытииЗапускОбработчиковЗапускаИнструментов", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//УИ_ОбщегоНазначенияКлиент.ПриЗавершенииРаботыСистемы();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	ОбработатьПоиск("");
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтрокаПоиска=Текст;
	ОбработатьПоиск(Текст);
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиИнструментов(Команда)
	ОткрытьФорму("ОбщаяФорма.УИ_НастройкиИнструментов");
КонецПроцедуры

&НаКлиенте
Процедура ВопросРазработчику(Команда)
	УИ_ОбщегоНазначенияКлиент.ЗадатьВопросРазработчику();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаРазработки(Команда)
	УИ_ОбщегоНазначенияКлиент.ОткрытьСтраницуРазработки();
КонецПроцедуры

&НаКлиенте
Процедура ОсобенностиОтладкиВПортативныхИнструментах(Команда)
	УИ_ОбщегоНазначенияКлиент.ОткрытьСтраницуОсобенностейОтладкиПортативныхИнструметов();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьОбновления(Команда)
	УИ_ОбщегоНазначенияКлиент.ЗапуститьПроверкуОбновленияИнструментов();
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияДляТехподдержки(Команда)
	УИ_ОбщегоНазначенияКлиент.ОткрытьИнформациюДляПоддержки();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьКэшИнструментовНаКлиенте(Команда)
	УИ_ОбщегоНазначенияКлиент.НачатьОчисткуКэшаИнструментовНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьКомандуИнструмента(Команда)
	РазделительИмени = РазделительИмениЭлементаФормыКомандыИнструмента();
	Позиция=СтрНайти(Команда.Имя, РазделительИмени);
	ИмяИнструмента = Лев(Команда.Имя, Позиция - 1);

	ОписанияМодулей=ОписаниеМодулейИнструментовДляПодключения();
	ОписаниеМодуля=ОписанияМодулей[ИмяИнструмента];

	Если ОписаниеМодуля.Вид = "Отчет" Тогда
		ОткрытьФорму("ВнешнийОтчет." + ИмяИнструмента + ".Форма", , ЭтаФорма);
	Иначе
		ОткрытьФорму("ВнешняяОбработка." + ИмяИнструмента + ".Форма", , ЭтаФорма);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГенерируемыеМетоды

// Описание подсистем инструментов для подключения.
// 
// Возвращаемое значение:
//  Структура - см. НовыйОписаниеПодсистем
Функция ОписаниеПодсистемИнструментовДляПодключения()
	ОписаниеПодсистем = НовыйОписаниеПодсистем(); 

//ОписаниеПодсистем.Подсистемы.Вставить("УИ_УниверсальныеИнструменты","Инструменты");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Прочее","Прочее");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Отладка","Отладка");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Обмен","Обмен");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Поддержка","Поддержка");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_РаботаСДанными","Работа с данными");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Администрирование","Администрирование");
//ОписаниеПодсистем.Подсистемы.Вставить("УИ_Разработка","Разработка");
//
//ОписаниеПодсистем.Порядок.Добавить("УИ_УниверсальныеИнструменты");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Отладка");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Разработка");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Администрирование");
//ОписаниеПодсистем.Порядок.Добавить("УИ_РаботаСДанными");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Обмен");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Прочее");
//ОписаниеПодсистем.Порядок.Добавить("УИ_Поддержка");

	Возврат ОписаниеПодсистем;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеМодулейИнструментовДляПодключения()
	Описания=Новый Структура;
	
	// МЕТОД ГЕНЕРИРУЕТСЯ ПРИ СБОРКЕ
	
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	ОписаниеИнструмента.Имя="УИ_РедакторСКД";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);
//	
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	ОписаниеИнструмента.Имя="УИ_КонсольОтчетов";
//	ОписаниеИнструмента.Вид="Отчет";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);
//	
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	ОписаниеИнструмента.Имя="УИ_БуферОбменаКлиент";
//	ОписаниеИнструмента.Тип="ОбщийМодуль";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);
//	
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	ОписаниеИнструмента.Имя="УИ_ОбщегоНазначенияКлиент";
//	ОписаниеИнструмента.Тип="ОбщийМодуль";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	
//	ОписаниеИнструмента.Имя="УИ_ОбщегоНазначенияКлиентСервер";
//	ОписаниеИнструмента.Тип="ОбщийМодуль";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);
//	
//	ОписаниеИнструмента=НовыйОписаниеМодуля();
//	ОписаниеИнструмента.Имя="УИ_РаботаСФормами";
//	ОписаниеИнструмента.Тип="ОбщийМодуль";
//	Описания.Вставить(ОписаниеИнструмента.Имя,ОписаниеИнструмента);

	Возврат Описания;
КонецФункции



#КонецОбласти

&НаСервере
Процедура ПодключитьМодулиНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	МакетКартинок = ОбработкаОбъект.ПолучитьМакет("УИ_Портативный_ОбщиеКартинки");
	ЧтениеZIP = Новый ЧтениеZipФайла(МакетКартинок.ОткрытьПотокДляЧтения());

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременногоФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяВременногоФайла);
	ЧтениеZIP.Закрыть();
	ОписаниеМодулей=ОписаниеМодулейИнструментовДляПодключения();

	УИ_БиблиотекаКартинок=Новый Структура;
	МодулиДляПодключенияНаСервере=Новый Массив;

	Для Каждого КлючЗначение Из ОписаниеМодулей Цикл
		Описание = КлючЗначение.Значение;

		Если Описание.Тип = "ОбщаяКартинка" Тогда
			ИмяФайлаКартинки = ИмяВременногоФайла + ПолучитьРазделительПути() + Описание.ИмяФайла;
			УИ_БиблиотекаКартинок.Вставить(Описание.Имя, Новый Картинка(ИмяФайлаКартинки));
		Иначе
			ИмяМакета = Описание.Тип + "_" + Описание.Имя;
			ДДМакета = ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
			МодулиДляПодключенияНаСервере.Добавить(Новый Структура("ЭтоОтчет, Адрес", Описание.Вид = "Отчет",
				ПоместитьВоВременноеХранилище(ДДМакета, УникальныйИдентификатор)));

		КонецЕсли;

	КонецЦикла;
	ПодключитьВнешниеМодулиНаСервере(МодулиДляПодключенияНаСервере);

	АдресЛокальнойБиблиотекиКартинок=ПоместитьВоВременноеХранилище(УИ_БиблиотекаКартинок, УникальныйИдентификатор);
	ЗаписатьАдресЛокальнойБиблиотекиКартинокВХранилищеНастроек(АдресЛокальнойБиблиотекиКартинок);

	//@skip-check empty-except-statement
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокЭлементаИнструмента(Имя, Синоним, ТекстПоиска = "")
	Заголовок=Синоним;
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок=Имя;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстПоиска) Тогда
		ЗаголовокИзначальный=Заголовок;
		ЗаголовокДляПоиска=НРег(ЗаголовокИзначальный);
		НовыйЗаголовок="";
		ДлинаСтрокиПоиска=СтрДлина(ТекстПоиска);

		ПозицияСимвола=СтрНайти(ЗаголовокДляПоиска, ТекстПоиска);
		Пока ПозицияСимвола > 0 Цикл
			ФорматированнаяСтрокаПоиска=Новый ФорматированнаяСтрока(Сред(ЗаголовокИзначальный, ПозицияСимвола,
				ДлинаСтрокиПоиска), Новый Шрифт(, , , Истина), WebЦвета.Красный);
			НовыйЗаголовок=Новый ФорматированнаяСтрока(НовыйЗаголовок, Лев(ЗаголовокИзначальный, ПозицияСимвола - 1),
				ФорматированнаяСтрокаПоиска);

			ЗаголовокИзначальный=Сред(ЗаголовокИзначальный, ПозицияСимвола + ДлинаСтрокиПоиска);
			ЗаголовокДляПоиска=НРег(ЗаголовокИзначальный);

			ПозицияСимвола=СтрНайти(ЗаголовокДляПоиска, ТекстПоиска);

		КонецЦикла;

		Если ЗначениеЗаполнено(НовыйЗаголовок) Тогда
			НовыйЗаголовок=Новый ФорматированнаяСтрока(НовыйЗаголовок, ЗаголовокИзначальный);
			Заголовок=НовыйЗаголовок;
		КонецЕсли;
	КонецЕсли;
	Возврат Заголовок;
КонецФункции


&НаКлиенте
Процедура ОбработатьПоиск(СтрокаПоискаПереданная)
	СортированныйСписок=СортированныйСписокМодулейИнструментовДляКнопок();

	Поиск=СокрЛП(НРег(СтрокаПоискаПереданная));

	Для Каждого ЭлементСпискаИнструментов Из СортированныйСписок Цикл
		ОписаниеИнструмента = ЭлементСпискаИнструментов.Значение;

		ВидимостьЭлемента=Истина;
		Если ЗначениеЗаполнено(Поиск) Тогда
			ВидимостьЭлемента=СтрНайти(НРег(ОписаниеИнструмента.Имя), Поиск) > 0 Или СтрНайти(
				НРег(ОписаниеИнструмента.Синоним), Поиск) > 0;
		КонецЕсли;

		ИменаРазделовИнструмента = ИменаРазделовРазмещенияИнструмента(ОписаниеИнструмента);

		Для Каждого ТекИмяРаздела Из ИменаРазделовИнструмента Цикл
			ИмяЭлементаВРазделе = ИмяЭлементаИнструментаВРазделе(ОписаниеИнструмента.Имя, ТекИмяРаздела);
			Элементы[ИмяЭлементаВРазделе].Видимость=ВидимостьЭлемента;
			Элементы[ИмяЭлементаВРазделе].Заголовок=ЗаголовокЭлементаИнструмента(
			ОписаниеИнструмента.Имя, ОписаниеИнструмента.Синоним, Поиск);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьГруппыПодсистемИнструментов()
	ОписаниеПодсистем = ОписаниеПодсистемИнструментовДляПодключения();

	Для Каждого ТекПодсистема Из ОписаниеПодсистем.Порядок Цикл
		ЗаголовокПодсистемы = ОписаниеПодсистем.Подсистемы[ТекПодсистема];

		НоваяГруппа = Элементы.Добавить("Раздел_" + ТекПодсистема, Тип("ГруппаФормы"),
			Элементы.ГруппаКомандыИнструментовРазделы);
		НоваяГруппа.Заголовок = ЗаголовокПодсистемы;
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Истина;
		НоваяГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПерераспределитьРазделыПоКолонкам(ОбщееКоличествоКомандИнструментов)
	КоличествоКолонок = 2;
	КоличествоКомандВКаждойКолонке = Цел(ОбщееКоличествоКомандИнструментов / КоличествоКолонок);

	БазовоеИмяКолонки = "ГруппаКомандыИнструментовРазделы";

	РаспределениеПоРазделам = Новый Структура;

	Для Н = 0 По КоличествоКолонок - 1 Цикл
		Если ЗначениеЗаполнено(Н) Тогда
			ИмяРаздела = БазовоеИмяКолонки + Н;
		Иначе
			ИмяРаздела = БазовоеИмяКолонки;
		КонецЕсли;

		РаспределениеПоРазделам.Вставить(ИмяРаздела, Новый Массив);
	КонецЦикла;

	ГруппыРазделов = Элементы.ГруппаКомандыИнструментовРазделы.ПодчиненныеЭлементы;

	ОстатокРаздела = КоличествоКомандВКаждойКолонке;
	ТекущийНомерРаздела = 0;
	ТекущееИмяРаздела = БазовоеИмяКолонки;
	Для Каждого ТекРаздел Из ГруппыРазделов Цикл
		Если ТипЗнч(ТекРаздел) <> Тип("ГруппаФормы") Тогда
			КоличествоЭлементовВРазделе = 1;
		Иначе
			КоличествоЭлементовВРазделе = ТекРаздел.ПодчиненныеЭлементы.Количество();
		КонецЕсли;      
		
		//Если текущий раздел не влазиет более чем на половину переносим его на следующий раздел, если он не крайний      
		Если (КоличествоЭлементовВРазделе / ОстатокРаздела > 2 Или ОстатокРаздела < 0) И ТекущийНомерРаздела + 1
			<> КоличествоКолонок Тогда
			ТекущийНомерРаздела = ТекущийНомерРаздела + 1;
			ТекущееИмяРаздела = БазовоеИмяКолонки + ТекущийНомерРаздела;
			ОстатокРаздела = КоличествоКомандВКаждойКолонке;
		КонецЕсли;

		ОстатокРаздела = ОстатокРаздела - КоличествоЭлементовВРазделе;

		РаспределениеПоРазделам[ТекущееИмяРаздела].Добавить(ТекРаздел);
	КонецЦикла;

	Для Каждого КлючЗначение Из РаспределениеПоРазделам Цикл
		ГруппаРаздела = Элементы[КлючЗначение.Ключ];

		Для Каждого ТекРаздел Из КлючЗначение.Значение Цикл
			Если ТекРаздел.Родитель = ГруппаРаздела Тогда
				Продолжить;
			КонецЕсли;
			Элементы.Переместить(ТекРаздел, ГруппаРаздела);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьКомандыОткрытияИнструментовНаФорме()
	СоздатьГруппыПодсистемИнструментов();

	ОписаниеИнструментов=СортированныйСписокМодулейИнструментовДляКнопок();


	//Четный=Ложь;  
	КоличествоКомандИнструментов = 0;
	Для Каждого ЭлементСписка Из ОписаниеИнструментов Цикл
		Описание=ЭлементСписка.Значение;

		Если Описание.НеВыводитьВИнтерфейс Тогда
			Продолжить;
		КонецЕсли;

		РодителиДляДобавления = ИменаРазделовРазмещенияИнструмента(Описание);

		Для Каждого ТекИмяРодителя Из РодителиДляДобавления Цикл
			ТекРодитель = Элементы[ТекИмяРодителя];

			Элемент=Элементы.Добавить(ИмяЭлементаИнструментаВРазделе(Описание.Имя, ТекРодитель.Имя), Тип(
				"ДекорацияФормы"), ТекРодитель);
			//Элемент.ИмяКоманды=Описание.Имя;
			Элемент.Заголовок=ЗаголовокЭлементаИнструмента(Описание.Имя, Описание.Синоним);
			Элемент.Вид=ВидДекорацииФормы.Надпись;
			Элемент.Гиперссылка=Истина;
			Элемент.Подсказка=Описание.Подсказка;
			Элемент.ОтображениеПодсказки=ОтображениеПодсказки.ОтображатьСнизу;
			Элемент.УстановитьДействие("Нажатие", "Подключаемый_ОткрытьКомандуИнструмента");

			КоличествоКомандИнструментов = КоличествоКомандИнструментов + 1;
		КонецЦикла;
	КонецЦикла;

	ПерераспределитьРазделыПоКолонкам(КоличествоКомандИнструментов);
КонецПроцедуры

// Новый описание подсистем.
// 
// Возвращаемое значение:
//  Структура - Новый описание подсистем:
// * Подсистемы - Структура - 
// * Порядок - Массив из Строка- 
&НаКлиентеНаСервереБезКонтекста
Функция НовыйОписаниеПодсистем()
	ОписаниеПодсистем = Новый Структура;
	ОписаниеПодсистем.Вставить("Подсистемы", Новый Структура);
	ОписаниеПодсистем.Вставить("Порядок", Новый Массив);

	Возврат ОписаниеПодсистем;
КонецФункции

// Новый описание модуля.
// 
// Возвращаемое значение:
//  Структура - Новый описание модуля:
// * Имя - Строка - 
// * Синоним - Строка - 
// * ИмяФайла - Строка - 
// * Подсказка - Строка - 
// * НеВыводитьВИнтерфейс - Булево - 
// * Тип - Строка - 
// * Вид - Строка - 
// * Команды - Неопределено - 
// * Подсистемы - Массив из Строка- 
&НаКлиентеНаСервереБезКонтекста
Функция НовыйОписаниеМодуля() 
	Описание=Новый Структура;
	Описание.Вставить("Имя", "");
	Описание.Вставить("Синоним", "");
	Описание.Вставить("ИмяФайла", "");
	Описание.Вставить("Подсказка", "");
	Описание.Вставить("НеВыводитьВИнтерфейс", Ложь);
	Описание.Вставить("Тип", "Инструмент");
	Описание.Вставить("Вид", "Обработка");
	Описание.Вставить("Команды", Неопределено);
	Описание.Вставить("Подсистемы", Новый Массив);

	Возврат Описание;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СортированныйСписокМодулейИнструментовДляКнопок()
	ОписаниеМодулей=ОписаниеМодулейИнструментовДляПодключения();
	
	СписокМодулей=Новый СписокЗначений();
	
	Для Каждого КлючЗначение Из ОписаниеМодулей Цикл
		Описание=КлючЗначение.Значение;
		Если Описание.Тип <> "Инструмент" Тогда
			Продолжить;
		КонецЕсли;
		Если Описание.НеВыводитьВИнтерфейс Тогда
			Продолжить;
		КонецЕсли;
		
		СписокМодулей.Добавить(Описание, Описание.Синоним);
	КонецЦикла;
	
	СписокМодулей.СортироватьПоПредставлению();
	Возврат СписокМодулей;
КонецФункции

&НаСервере
Процедура ПодключитьВнешниеМодулиНаСервере(МодулиДляПодключенияНаСервере)
	Для Каждого ВнешнийМодуль ИЗ МодулиДляПодключенияНаСервере Цикл
		ПодключитьВнешнююОбработку(ВнешнийМодуль.Адрес, ВнешнийМодуль.ЭтоОтчет);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗапускОбработчиковЗапускаИнструментов()

	УИ_ОбщегоНазначенияКлиент.ПриНачалеРаботыСистемы();

	УИ_ПараметрыПриложения_Портативные["ОбщийМакет.УИ_КомпонентаДляРаботыСБуферомОбмена"] = АдресДвоичныхДанныхКомпонентыРаботыСБуферомОбмена;	
	
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница=Элементы.ГруппаСтраницаРаботыСИнструментами;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОбщийМакетВоВременноеХранилищеКомпонентуРаботыСБуферомОбмена()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
КонецФункции

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища, ЭтоОтчет)

	ОписаниеЗащитыОтОпасныхДействий =Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях=Ложь;
	Если ЭтоОтчет Тогда
		Возврат ВнешниеОтчеты.Подключить(АдресХранилища, , Ложь, ОписаниеЗащитыОтОпасныхДействий);
	Иначе
		Возврат ВнешниеОбработки.Подключить(АдресХранилища, , Ложь, ОписаниеЗащитыОтОпасныхДействий);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьАдресЛокальнойБиблиотекиКартинокВХранилищеНастроек(Адрес)
	УИ_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		УИ_ОбщегоНазначенияКлиентСервер.КлючОбъектаВХранилищеНастроек(), "АдресЛокальнойБиблиотекиКартинок", Адрес, ,
		ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Функция ВерсияПлатформыНеМладше(ВерсияДляСравнения) Экспорт
	ВерсияБезСборки=ВерсияКонфигурацииБезНомераСборки(ТекущаяВерсияПлатформы1СПредприятие());

	Возврат СравнитьВерсииБезНомераСборки(ВерсияБезСборки, ВерсияДляСравнения)>=0;
КонецФункции

&НаКлиенте
Функция ВерсияКонфигурацииБезНомераСборки(Знач Версия) Экспорт

	Массив = СтрРазделить(Версия, ".");

	Если Массив.Количество() < 3 Тогда
		Возврат Версия;
	КонецЕсли;

	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]", Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]", Массив[2]);

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТекущаяВерсияПлатформы1СПредприятие() Экспорт

	СистИнфо = Новый СистемнаяИнформация;
	Возврат СистИнфо.ВерсияПриложения;

КонецФункции

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
&НаКлиенте
Функция СравнитьВерсииБезНомераСборки(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт

	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0", СтрокаВерсии2);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 3 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 3 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;

	Результат = 0;
	Для Разряд = 0 По 2 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Версия() Экспорт

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Поставщик() Экспорт

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделительИмениЭлементаФормыКомандыИнструмента()
	Возврат "___Родитель___";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИменаРазделовРазмещенияИнструмента(ОписаниеИнструмента)
	РодителиДляДобавления = Новый Массив;
	Если ОписаниеИнструмента.Подсистемы.Количество() = 0 Тогда
		РодителиДляДобавления.Добавить("ГруппаКомандыИнструментовРазделы");
	Иначе
		Для Каждого ТекПодсистема Из ОписаниеИнструмента.Подсистемы Цикл
			РодителиДляДобавления.Добавить("Раздел_" + ТекПодсистема);
		КонецЦикла;
	КонецЕсли;

	Возврат РодителиДляДобавления;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяЭлементаИнструментаВРазделе(ИмяИнструмента, ИмяЭлементаРаздела)
	Возврат ИмяИнструмента + РазделительИмениЭлементаФормыКомандыИнструмента() + ИмяЭлементаРаздела;
КонецФункции

#КонецОбласти



