#Область ПрограммныйИнтерфейс

// Возращает значение, является ли команда CURL.
// 
// Параметры:
//  Команда - Строка - Проверяемая команда
//  		- Массив из Строка - Токены команды см. УИ_РаботаСКоманднойСтрокойКлиентСервер.ОбработатьКоманду
// 
// Возвращаемое значение:
//  Булево - Это команда CURL
Функция ЭтоКомандаCURL(Знач Команда) Экспорт

	Результат = Ложь;
	ИспольняемаяПрограмма = УИ_РаботаСКоманднойСтрокойКлиентСервер.ИспольняемаяПрограмма(Команда);
	РазделительВиндовс = "\";
	РазделительЛинукс = "/";
	ИспольняемаяПрограмма = СтрЗаменить(ИспольняемаяПрограмма, РазделительВиндовс, РазделительЛинукс);
	ЧастиТокена = СтрРазделить(ИспольняемаяПрограмма, РазделительЛинукс);
	ПоследнийЭлемент = ЧастиТокена.ВГраница();
	Если ПоследнийЭлемент > -1 Тогда
		ИсполняемаяПрограмма = НРег(ЧастиТокена[ПоследнийЭлемент]);
		Результат = (ИсполняемаяПрограмма = "curl" Или ИсполняемаяПрограмма = "curl.exe");
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Обрабатывает команду curl, выполняет парсинг токенов, проверку на валидность и перенаправление вывода.
//
// Параметры:
//   Команда - Строка - текст команды shell для обработки
//
// Возвращаемое значение:
//   Структура - результат обработки команды curl:
//     * ИсполняемаяПрограмма - Строка - имя исполняемой программы (curl)
//     * ПараметрыВыполнения - Массив из Строка - параметры выполнения curl
//     * Метод - Строка, Неопределено - HTTP метод запроса
//     * СсылкиЗапроса - Массив из Строка - ссылки для запроса
//     * Заголовки - Массив из Структура - заголовки запроса
//     * Куки - Массив из Строка - cookies для запроса
//     * ТелоЗапроса - Структура, Неопределено - тело запроса
//     * Формы - Массив из Структура - данные форм
//     * Аутентификация - Структура, Неопределено - параметры аутентификации
//     * ФайлДляСохранения - Строка, Неопределено - путь к файлу для сохранения результата
//     * Флаги - Массив из Строка - флаги выполнения
//     * ПеренаправленияШелл - Массив из Структура - параметры перенаправления вывода shell
//     * ТолькоЗаголовки - Булево - признак загрузки только заголовков
//     * НеопознанныеАргументы - Массив из Строка - неопознанные аргументы
//     * НеопознанныеПараметрыВыполнения - Массив из Строка - неопознанные параметры
//     * Ошибки - Массив из Строка - список ошибок обработки
Функция ОбработатьКоманду(Знач Команда) Экспорт

	Результат = НовыйРезультатОбработки();
	ТокеныКоманды = УИ_РаботаСКоманднойСтрокойКлиентСервер.ОбработатьКоманду(Команда);
	ОбработкаПеренаправленияШелл = ОбработатьПеренаправлениеШелл(ТокеныКоманды);
	ТокеныКоманды = ОбработкаПеренаправленияШелл.ТокеныБезПеренаправления;
	Если ТокеныКоманды.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Передана пустая команда.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	ИспольняемаяПрограмма = УИ_РаботаСКоманднойСтрокойКлиентСервер.ИспольняемаяПрограмма(ТокеныКоманды);
	Если Не ЭтоКомандаCURL(ТокеныКоманды) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ожидалась команда curl, получено: %1'"), ИспольняемаяПрограмма);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	ЗаполнитьРезультатОбработки(Результат, ТокеныКоманды, ОбработкаПеренаправленияШелл, ИспольняемаяПрограмма);

	Возврат Результат;

КонецФункции

// Возвращает доступные типы аутентификации для использования в HTTP запросах через CURL.
//
// Возвращаемое значение:
//   Структура:
//     * Базовый - Строка - идентификатор типа аутентификации basic
Функция ТипыАутентификации() Экспорт
	
	Типы = Новый Структура;
	Типы.Вставить("Базовый", "basic");
	Возврат Типы;
	
КонецФункции

Функция ТипыТелаЗапроса()

	Типы = Новый Структура;
	Типы.Вставить("Строка", "data");	
	Возврат Типы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРезультатОбработки()

	Результат = Новый Структура;
	Результат.Вставить("ИсполняемаяПрограмма", "curl");
	Результат.Вставить("ПараметрыВыполнения", Новый Массив);
	Результат.Вставить("Метод", Неопределено);
	Результат.Вставить("СсылкиЗапроса", Новый Массив);
	Результат.Вставить("Заголовки", Новый Массив);
	Результат.Вставить("Куки", Новый Массив);
	Результат.Вставить("ТелоЗапроса", Неопределено);
	Результат.Вставить("Формы", Новый Массив);
	Результат.Вставить("Аутентификация", Неопределено);
	Результат.Вставить("ФайлДляСохранения", Неопределено);
	Результат.Вставить("Флаги", Новый Массив);
	Результат.Вставить("ПеренаправленияШелл", Новый Массив);
	Результат.Вставить("ТолькоЗаголовки", Ложь);
	Результат.Вставить("НеопознанныеАргументы", Новый Массив);
	Результат.Вставить("НеопознанныеПараметрыВыполнения", Новый Массив);
	Результат.Вставить("Ошибки", Новый Массив);
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьРезультатОбработки(Результат, ТокеныКоманды, ОбработкаПеренаправленияШелл, ИспольняемаяПрограмма)

	Результат.ПеренаправленияШелл = ОбработкаПеренаправленияШелл.Перенаправления;
	Результат.ИсполняемаяПрограмма = ИспольняемаяПрограмма;

	ОписаниеПараметровВыполнения = ОписаниеПараметровВыполнения();
	ВспомогательныеДанные = Новый Структура;
	ВспомогательныеДанные.Вставить("ДлинныеОпцииСоЗначением", ДлинныеОпцииСоЗначением(ОписаниеПараметровВыполнения));
	ВспомогательныеДанные.Вставить("ДлинныеОпцииБезЗначений", ДлинныеОпцииБезЗначений(ОписаниеПараметровВыполнения));
	ВспомогательныеДанные.Вставить("КороткиеОпцииСоЗначением", КороткиеОпцииСоЗначением(ОписаниеПараметровВыполнения));
	ВспомогательныеДанные.Вставить("КороткиеОпцииБезЗначений", КороткиеОпцииБезЗначений(ОписаниеПараметровВыполнения));
	ВспомогательныеДанные.Вставить("ТипыПараметровВыполненияТребующиеЗначение",
								   ТипыПараметровВыполненияТребующиеЗначение(ОписаниеПараметровВыполнения));

	Счетчик = 1;
	КоличествоТокенов = ТокеныКоманды.Количество();
	КонецПараметров = Ложь;
	Пока Счетчик < КоличествоТокенов Цикл

		Токен = ТокеныКоманды[Счетчик];

		Если КонецПараметров Тогда
			Результат.СсылкиЗапроса.Добавить(Токен);
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;

		Если Токен = "--" Тогда
			КонецПараметров = Истина;
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;

		Если СтрНачинаетсяС(Токен, "--") Тогда
			ОбработатьДлинныйПараметр(ТокеныКоманды, Счетчик, Результат, ВспомогательныеДанные);
			Продолжить;
		КонецЕсли;

		Если СтрНачинаетсяС(Токен, "-") И Токен <> "-" Тогда
			ОбработатьКороткийПараметр(ТокеныКоманды, Счетчик, Результат, ВспомогательныеДанные);
			Продолжить;
		КонецЕсли;

		Если ЭтоСсылкаЗапроса(Токен) Тогда
			Результат.СсылкиЗапроса.Добавить(Токен);
		Иначе
			Результат.НеопознанныеАргументы.Добавить(Токен);
		КонецЕсли;
		Счетчик = Счетчик + 1;

	КонецЦикла;

	Если Результат.Метод = Неопределено Тогда
		Если Результат.ТелоЗапроса <> Неопределено Тогда
			Результат.Метод = "POST";
		ИначеЕсли Результат.Формы.Количество() > 0 Тогда
			Результат.Метод = "POST";
		Иначе
			Результат.Метод = "GET";
		КонецЕсли;
	КонецЕсли;

	Если Результат.СсылкиЗапроса.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'URL не найден'");
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьДлинныйПараметр(ТокеныКоманды, Счетчик, Результат, ВспомогательныеДанные)

	ДлинныеОпцииСоЗначением = ВспомогательныеДанные.ДлинныеОпцииСоЗначением;
	ДлинныеОпцииБезЗначений = ВспомогательныеДанные.ДлинныеОпцииБезЗначений;
	ТипыПараметровВыполненияТребующиеЗначение = ВспомогательныеДанные.ТипыПараметровВыполненияТребующиеЗначение;

	Токен = ТокеныКоманды[Счетчик];
	НачалоТокена = 3;
	ТелоТокена = Сред(Токен, НачалоТокена);

	РазделительЗначения = "=";
	Если СтрНайти(ТелоТокена, РазделительЗначения) > 0 Тогда
		ОписаниеПараметров = УИ_СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(ТелоТокена, "");
		Для Каждого КлючЗначение Из ОписаниеПараметров Цикл
			ТипПараметра = ДлинныеОпцииСоЗначением[КлючЗначение.Ключ];
			ДобавитьПараметрВРезультат(Результат,
									   КлючЗначение.Ключ,
									   ТипПараметра,
									   КлючЗначение.Значение,
									   ТипыПараметровВыполненияТребующиеЗначение);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	ДваТокена = 2;
	ТипПараметра = ДлинныеОпцииСоЗначением[ТелоТокена];
	Если ТипПараметра <> Неопределено Тогда
		Если Счетчик + 1 < ТокеныКоманды.Количество() Тогда
			ДобавитьПараметрВРезультат(Результат,
									   ТелоТокена,
									   ТипПараметра,
									   ТокеныКоманды[Счетчик + 1],
									   ТипыПараметровВыполненияТребующиеЗначение);
			Счетчик = Счетчик + ДваТокена;
			Возврат;
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Параметр ""%1"" требует значение.'"), Токен);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;

	ТипПараметра = ДлинныеОпцииБезЗначений[ТелоТокена];
	Если ТипПараметра <> Неопределено Тогда
		ДобавитьПараметрВРезультат(Результат,
								   ТелоТокена,
								   ТипПараметра,
								   Неопределено,
								   ТипыПараметровВыполненияТребующиеЗначение);
		Счетчик = Счетчик + 1;
		Возврат;
	КонецЕсли;

	Результат.НеопознанныеПараметрыВыполнения.Добавить(ТелоТокена);
	Счетчик = Счетчик + 1;

КонецПроцедуры

Процедура ОбработатьКороткийПараметр(ТокеныКоманды, Счетчик, Результат, ВспомогательныеДанные)

	КороткиеОпцииСоЗначением = ВспомогательныеДанные.КороткиеОпцииСоЗначением;
	КороткиеОпцииБезЗначений = ВспомогательныеДанные.КороткиеОпцииБезЗначений;
	ТипыПараметровВыполненияТребующиеЗначение = ВспомогательныеДанные.ТипыПараметровВыполненияТребующиеЗначение;

	Токен = ТокеныКоманды[Счетчик];
	НачалоТокена = 2;
	ТелоТокена = Сред(Токен, НачалоТокена);
	ПоследнийСимвол = СтрДлина(ТелоТокена);

	НомерСимвола = 1;
	Пока НомерСимвола <= ПоследнийСимвол Цикл

		Параметр = Сред(ТелоТокена, НомерСимвола, 1);
		ТипПараметра = КороткиеОпцииБезЗначений[Параметр];
		Если ТипПараметра <> Неопределено Тогда
			ДобавитьПараметрВРезультат(Результат,
									   Параметр,
									   ТипПараметра,
									   Неопределено,
									   ТипыПараметровВыполненияТребующиеЗначение);
			НомерСимвола = НомерСимвола + 1;
			Продолжить;
		КонецЕсли;

		ТипПараметра = КороткиеОпцииСоЗначением[Параметр];
		Если ТипПараметра <> Неопределено Тогда
            
            // Всё, что осталось в этом же токене, становится значением.
            // Например:
            //   -XPOST => -X POST
            //   -HX    => -H X
			ЗначениеПараметра = Сред(ТелоТокена, НомерСимвола + 1);
			Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
				ДобавитьПараметрВРезультат(Результат,
										   Параметр,
										   ТипПараметра,
										   ЗначениеПараметра,
										   ТипыПараметровВыполненияТребующиеЗначение);
				НомерСимвола = НомерСимвола + 1;
				Прервать;
			КонецЕсли;

			Если Счетчик + 1 >= ТокеныКоманды.Количество() Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Параметр ""-%1"" требует значение.'"), Параметр);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;

			ДобавитьПараметрВРезультат(Результат,
									   Параметр,
									   ТипПараметра,
									   ТокеныКоманды[Счетчик + 1],
									   ТипыПараметровВыполненияТребующиеЗначение);
			Счетчик = Счетчик + 1;
			Прервать;
		КонецЕсли;

		Результат.НеопознанныеПараметрыВыполнения.Добавить(Параметр);
		НомерСимвола = НомерСимвола + 1;

	КонецЦикла;
	Счетчик = Счетчик + 1;

КонецПроцедуры

Функция ОбработатьКуки(ЗначениеКуки)

	Результат = Новый Массив;
	ЗначенияКуки = СтрРазделить(ЗначениеКуки, ";", Ложь);
	Для Каждого Элемент Из ЗначенияКуки Цикл
		Если ПустаяСтрока(Элемент) Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеКуки = Новый Структура("Ключ, Значение", "", "");
		КлючЗначение = РазделитьСтроку(Элемент, "=", 1);
		ОписаниеКуки.Ключ = СокрЛП(КлючЗначение[0]);
		Если КлючЗначение.Количество() > 1 Тогда
			ОписаниеКуки.Значение = СокрЛП(КлючЗначение[1]);
		КонецЕсли;
		Результат.Добавить(ОписаниеКуки);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура ДобавитьПараметрВРезультат(Результат, ИмяПараметра, ТипПараметра, ЗначениеПараметра,
	ТипыПараметровВыполненияТребующиеЗначение)

	Если ЗначениеЗаполнено(ТипПараметра) Тогда
		ЭтоПараметрВыполнения = ТипыПараметровВыполненияТребующиеЗначение[ТипПараметра];
		Если ЭтоПараметрВыполнения Тогда
			Если ЗначениеПараметра = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Параметр ""%1"" требует значение.'"), ИмяПараметра);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			Результат.ПараметрыВыполнения.Добавить(ИмяПараметра);
		Иначе
			Результат.Флаги.Добавить(ИмяПараметра);
		КонецЕсли;
	КонецЕсли;

	ТипыПараметровВыполнения = ТипыПараметровВыполнения();
	Если ТипПараметра = ТипыПараметровВыполнения.Заголовок Тогда
		ДобавитьЗаголовок(Результат, ЗначениеПараметра);
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.Метод Тогда
		Результат.Метод = ЗначениеПараметра;
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.ТелоЗапроса Тогда
		ОписаниеТелаЗапроса = Новый Структура("Тип, Значение", ИмяПараметра, ЗначениеПараметра);
		Результат.ТелоЗапроса = ОписаниеТелаЗапроса;
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.Куки Тогда
		ДобавитьКуки(Результат, ЗначениеПараметра);
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.АгентПользователя Тогда
		НовыйЗаголовок = СтрШаблон("%1:%2", "User-Agent", ЗначениеПараметра);
		ДобавитьЗаголовок(Результат, НовыйЗаголовок);
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.Аутентификация Тогда
		Результат.Аутентификация = ОбработатьАутентиификацию(ЗначениеПараметра);
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.Форма Тогда
		ОписаниеФормы = ОбработатьФорму(ЗначениеПараметра);
		Результат.Формы.Добавить(ОписаниеФормы);
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.ТолькоЗаголовки Тогда
		Результат.ТолькоЗаголовки = Истина;
	ИначеЕсли ТипПараметра = ТипыПараметровВыполнения.ФайлДляСохранения Тогда
		Результат.ФайлДляСохранения = ЗначениеПараметра;
	Иначе
		ОписаниеПараметра = ИмяПараметра;
		Если ЗначениеПараметра <> Неопределено Тогда
			ОписаниеПараметра = СтрШаблон("%1=%2", ОписаниеПараметра, ЗначениеПараметра);
		КонецЕсли;
		Результат.НеопознанныеПараметрыВыполнения.Добавить(ОписаниеПараметра);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьЗаголовок(Результат, Значение)

	РезультатДеления = РазделитьСтроку(Значение, ":", 1);
	ИмяЗаголовка = СокрЛП(РезультатДеления[0]);
	Если РезультатДеления.Количество() > 1 Тогда
		ЗначениеЗаголовка = СокрЛП(РезультатДеления[1]);
	Иначе
		ЗначениеЗаголовка = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаголовка = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Некорректный заголовок без двоеточия: ""%1""'"), ИмяЗаголовка);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;

	Если НРег(ИмяЗаголовка) = "cookie" Тогда
		ДобавитьКуки(Результат, ЗначениеЗаголовка);
	Иначе
		СтруктураЗаголовка = Новый Структура("Имя, Значение", ИмяЗаголовка, ЗначениеЗаголовка);
		Результат.Заголовки.Добавить(СтруктураЗаголовка);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьКуки(Результат, Значение)

	НовыеКуки = ОбработатьКуки(Значение);
	УИ_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.Куки, НовыеКуки);

КонецПроцедуры

Функция ОбработатьАутентиификацию(ЗначениеПараметра)
	
	ТипыАутентификации = ТипыАутентификации();
	Результат = Новый Структура("Тип, Логин, Пароль", ТипыАутентификации.Базовый);
	Список = РазделитьСтроку(ЗначениеПараметра, ":", 1);
	Если Список.Количество() = 1 Тогда
		Результат.Логин = Список[0];
	Иначе
		Результат.Логин = Список[0];
		Результат.Пароль = Список[1];
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ОбработатьФорму(ЗначениеПараметра)

	КлючИЗначение = РазделитьСтроку(ЗначениеПараметра, "=", 1);
	
	ОписаниеФормы = Новый Структура("Имя", КлючИЗначение[0]);
	Значение = ?(КлючИЗначение.Количество() > 1, КлючИЗначение[1], Неопределено);
	ОписаниеФормы.Вставить("Значение", Значение);
	Возврат ОписаниеФормы;
	
КонецФункции

Функция РазделитьСтроку(Знач СтрокаПоиска, Знач Разделитель, Знач МаксимальноеКоличествоДелений)

	Результат = Новый Массив;
	ПозицияРазделителя = СтрНайти(СтрокаПоиска, Разделитель);
	Пока ПозицияРазделителя > 0 И МаксимальноеКоличествоДелений > 0 Цикл
		Результат.Добавить(Лев(СтрокаПоиска, ПозицияРазделителя - 1));
		МаксимальноеКоличествоДелений = МаксимальноеКоличествоДелений - 1;
		СтрокаПоиска = Сред(СтрокаПоиска, ПозицияРазделителя + 1);
		ПозицияРазделителя = СтрНайти(СтрокаПоиска, Разделитель);
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Результат.Добавить(СтрокаПоиска);
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ЭтоСсылкаЗапроса(Токен)

	Результат = (СтрНачинаетсяС(Токен, "http://") Или СтрНачинаетсяС(Токен, "https://"));
	Возврат Результат;

КонецФункции

Функция ОбработатьПеренаправлениеШелл(ТокеныКоманды)

	Результат = Новый Структура;
	ТокеныБезПеренаправления = Новый Массив;
	Перенаправления = Новый Массив;
	ОператорыПеренаправленияШелл = ОператорыПеренаправленияШелл();
	КоличествоТокенов = ТокеныКоманды.Количество();
	Счетчик = 0;
	ДваТокена = 2;
	Пока Счетчик < КоличествоТокенов Цикл
		Токен = ТокеныКоманды[Счетчик];

		Если ОператорыПеренаправленияШелл.Найти(Токен) <> Неопределено Тогда
			ЦельПеренаправления = ?(Счетчик + 1 < КоличествоТокенов, ТокеныКоманды[Счетчик + 1], Неопределено);
			ОписаниеПеренаправления = НовоеПеренаправлениеШелл(Токен, ЦельПеренаправления);
			Перенаправления.Добавить(ОписаниеПеренаправления);
			Счетчик = Счетчик + ДваТокена;
			Продолжить;
		КонецЕсли;

		ОператорНайден = Ложь;
		Для Каждого Оператор Из ОператорыПеренаправленияШелл Цикл
			Если СтрНачинаетсяС(Токен, Оператор) Тогда
				ЦельПеренаправления = Прав(Токен, СтрДлина(Токен) - СтрДлина(Оператор));
				ОписаниеПеренаправления = НовоеПеренаправлениеШелл(Оператор, ЦельПеренаправления);
				ОператорНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ОператорНайден Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;

		ТокеныБезПеренаправления.Добавить(Токен);
		Счетчик = Счетчик + 1;

	КонецЦикла;
	Результат.Вставить("Перенаправления", Перенаправления);
	Результат.Вставить("ТокеныБезПеренаправления", ТокеныБезПеренаправления);
	Возврат Результат;

КонецФункции

Функция НовоеПеренаправлениеШелл(Операция, ЦельПеренаправления)
	ОписаниеПеренаправления = Новый Структура("Операция, ЦельПеренаправления", Операция, ЦельПеренаправления);
	Возврат ОписаниеПеренаправления;
КонецФункции

Функция ОператорыПеренаправленияШелл()

	Операторы = Новый Массив;
	Операторы.Добавить("<");
	Операторы.Добавить(">");
	Операторы.Добавить("<<");
	Операторы.Добавить(">>");
	Операторы.Добавить("<&");
	Операторы.Добавить(">&");
	Операторы.Добавить("2>");
	Операторы.Добавить("2>>");
	Возврат Операторы;

КонецФункции

Функция ОписаниеПараметровВыполнения()

	ТипыПараметровВыполнения = ТипыПараметровВыполнения();
	ОписаниеПараметров = Новый Структура;
	
	// Заголовки
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("H");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("header");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.Заголовок, НовоеОписание);
	
	// Метод
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("X");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("request");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.Метод, НовоеОписание);
	
	// Тело запроса
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("d");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("data");
	ДлинныеОпции.Добавить("data-raw");
	ДлинныеОпции.Добавить("data-binary");
	ДлинныеОпции.Добавить("data-ascii");
	ДлинныеОпции.Добавить("data-urlencode");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.ТелоЗапроса, НовоеОписание);
	
	// Куки
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("b");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("cookie");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.Куки, НовоеОписание);

	// Агент пользователя
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("A");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("user-agent");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.АгентПользователя, НовоеОписание);

	// Аутентификация
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("u");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("user");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.Аутентификация, НовоеОписание);

	// Форма
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("F");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("form");
	ДлинныеОпции.Добавить("form-string");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.Форма, НовоеОписание);

	// Файл для сохранения
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("o");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("output");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Истина);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.ФайлДляСохранения, НовоеОписание);

	// Только заголовки
	КороткиеОпции = Новый Массив;
	КороткиеОпции.Добавить("I");
	ДлинныеОпции = Новый Массив;
	ДлинныеОпции.Добавить("head");
	НовоеОписание = ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, Ложь);
	ОписаниеПараметров.Вставить(ТипыПараметровВыполнения.ТолькоЗаголовки, НовоеОписание);

	Возврат ОписаниеПараметров;

КонецФункции

Функция ОписаниеПараметраВыполнения(КороткиеОпции, ДлинныеОпции, ТребуетЗначение)

	ОписаниеПараметра = Новый Структура;
	ОписаниеПараметра.Вставить("КороткиеОпции", КороткиеОпции);
	ОписаниеПараметра.Вставить("ДлинныеОпции", ДлинныеОпции);
	ОписаниеПараметра.Вставить("ТребуетЗначение", ТребуетЗначение);
	Возврат ОписаниеПараметра;

КонецФункции

Функция ТипыПараметровВыполнения()

	Результат = Новый Структура;
	Результат.Вставить("Заголовок", "Заголовок");
	Результат.Вставить("Метод", "Метод");
	Результат.Вставить("ТелоЗапроса", "ТелоЗапроса");
	Результат.Вставить("Куки", "Куки");
	Результат.Вставить("АгентПользователя", "АгентПользователя");
	Результат.Вставить("Аутентификация", "Аутентификация");
	Результат.Вставить("Форма", "Форма");
	Результат.Вставить("ФайлДляСохранения", "ФайлДляСохранения");
	Результат.Вставить("ТолькоЗаголовки", "ТолькоЗаголовки");
	Возврат Результат;

КонецФункции

Функция ДлинныеОпцииСоЗначением(ОписаниеПараметровВыполнения)

	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ОписаниеПараметровВыполнения Цикл
		ТипПараметра = КлючЗначение.Ключ;
		ОписаниеПараметра = КлючЗначение.Значение;
		Если ОписаниеПараметра.ТребуетЗначение Тогда
			Для Каждого ИмяПараметра Из КлючЗначение.Значение.ДлинныеОпции Цикл
				Результат.Вставить(ИмяПараметра, ТипПараметра);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ДлинныеОпцииБезЗначений(ОписаниеПараметровВыполнения)

	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ОписаниеПараметровВыполнения Цикл
		ТипПараметра = КлючЗначение.Ключ;
		ОписаниеПараметра = КлючЗначение.Значение;
		Если Не ОписаниеПараметра.ТребуетЗначение Тогда
			Для Каждого ИмяПараметра Из КлючЗначение.Значение.ДлинныеОпции Цикл
				Результат.Вставить(ИмяПараметра, ТипПараметра);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция КороткиеОпцииСоЗначением(ОписаниеПараметровВыполнения)

	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ОписаниеПараметровВыполнения Цикл
		ТипПараметра = КлючЗначение.Ключ;
		ОписаниеПараметра = КлючЗначение.Значение;
		Если ОписаниеПараметра.ТребуетЗначение Тогда
			Для Каждого ИмяПараметра Из КлючЗначение.Значение.КороткиеОпции Цикл
				Результат.Вставить(ИмяПараметра, ТипПараметра);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция КороткиеОпцииБезЗначений(ОписаниеПараметровВыполнения)

	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ОписаниеПараметровВыполнения Цикл
		ТипПараметра = КлючЗначение.Ключ;
		ОписаниеПараметра = КлючЗначение.Значение;
		Если Не ОписаниеПараметра.ТребуетЗначение Тогда
			Для Каждого ИмяПараметра Из КлючЗначение.Значение.КороткиеОпции Цикл
				Результат.Вставить(ИмяПараметра, ТипПараметра);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ТипыПараметровВыполненияТребующиеЗначение(ОписаниеПараметровВыполнения)

	Результат = Новый Соответствие;
	Для Каждого КлючЗначение Из ОписаниеПараметровВыполнения Цикл
		ТипПараметра = КлючЗначение.Ключ;
		ОписаниеПараметра = КлючЗначение.Значение;
		Результат.Вставить(ТипПараметра, ОписаниеПараметра.ТребуетЗначение);
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти