
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_РазделМД = Параметры.РазделМД;
	
	Заголовок = _РазделМД;
	
	Для каждого Элем из Метаданные[_РазделМД] Цикл
		НС = _Список.Добавить();
		
		НС.Имя = Элем.Имя;
		НС.Представление = Элем.Представление();
		НС.РасширениеКонфигурации = (Элем.РасширениеКонфигурации() <> Неопределено);
	КонецЦикла;
	
	_Список.Сортировать("Имя");
	
	Если _Список.Количество() = 0 Тогда
		Отказ = истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	_Выбрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура _Выбрать(Команда)
	ТекДанные = Элементы._Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОповеститьОВыборе(ТекДанные.Имя);
	КонецЕсли;
КонецПроцедуры
