
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресХранилища = Параметры.АдресХранилища;
	
	Заголовок  = Параметры.Заголовок;
	ЗаполнитьСписокВыбораСпособаПомещения();

	АдресХранилищаПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(СпособПомещения) Тогда
		СпособПомещения = СпособыПомещенияЗначенияВоВременноеХранилище().ОднократноеПолучение.Имя;
		СпособПомещенияПриИзмененииНаСервере();
	КонецЕсли;
	УстановитьВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.Значение = Значение;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.НаборТипов = УИ_ОбщегоНазначенияКлиентСервер.ВсеНаборыТиповДляРедактирования();

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);

КонецПроцедуры


&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияПриИзменении(ЭтотОбъект,
																								  Элемент,
																								  "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикПриИзменении(ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура АдресХранилищаПриИзменении(Элемент)
	АдресХранилищаПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СпособПомещенияПриИзменении(Элемент)
	СпособПомещенияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокФормыДляПомещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;

	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл
		Для Каждого ЭлементСодержимого Из ОткрытоеОкно.Содержимое Цикл
			Если ТипЗнч(ЭлементСодержимого) <> УИ_ОбщегоНазначенияКлиентСервер.ТипУправляемойФормы() Тогда
				Продолжить;
			КонецЕсли;
			ЭлементВыбора= НовыйЭлементВыбораФормы();
			ЭлементВыбора.Идентификатор = ЭлементСодержимого.УникальныйИдентификатор;
			ЭлементВыбора.Представление = ОткрытоеОкно.Заголовок + ":" + ЭлементСодержимого.ИмяФормы;
	
			ДанныеВыбора.Добавить(ЭлементВыбора, ЭлементВыбора.Представление);
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокФормыДляПомещенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторФормыДляПомещения = ВыбранноеЗначение.Идентификатор;
	ЗаголовокФормыДляПомещения = ВыбранноеЗначение.Представление;		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеречитатьИзВременногоХранилища(Команда)
	УстановитьЗначениеВременногоХранилищаВКонтейнерФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗначениеИзВременногоХранилища(Команда)
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	ТекстВопроса = НСтр("ru = 'Данные по указанному адресу будут удалены из временного хранилища!
						|
						|Продолжить?'");

	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗначениеИзВременногоХранилищаЗавершение", ЭтотОбъект);

	ПараметрыВопроса = УИ_ОбщегоНазначенияКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
	ПараметрыВопроса.КнопкаТаймаута = КодВозвратаДиалога.Нет;
	ПараметрыВопроса.Таймаут = 30;

	УИ_ОбщегоНазначенияКлиент.ПоказатьВопросПользователю(ОписаниеОповещения,
														 ТекстВопроса,
														 РежимДиалогаВопрос.ДаНет,
														 ПараметрыВопроса);
КонецПроцедуры

&НаКлиенте
Процедура Поместить(Команда)
	ПоместитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьИЗакрыть(Команда)
	Результат = РезультатПомещенияЗначенияКонтейнераФормыВоВременноеХранилище();
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;

	Закрыть(АдресХранилища);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФормуДляПомещения(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый способ помещения.
// 
// Возвращаемое значение:
//  Структура - Новый способ помещения:
// * Имя - Строка - 
// * Представление - Строка - 
&НаКлиентеНаСервереБезКонтекста
Функция НовыйСпособПомещения()
	Данные = Новый Структура;
	Данные.Вставить("Имя", "");
	Данные.Вставить("Представление", "");
	
	Возврат Данные;
КонецФункции

// Способ помещения.
// 
// Параметры:
//  Имя -Строка-Имя
//  Представление-Строка- Представление
// 
// Возвращаемое значение:
//  см. НовыйСпособПомещения
&НаКлиентеНаСервереБезКонтекста
Функция СпособПомещения(Имя, Представление)
	Способ = НовыйСпособПомещения();
	Способ.Имя = Имя;
	Способ.Представление = Представление;
	
	Возврат Способ;
КонецФункции


// Новый элемент выбора формы.
// 
// Возвращаемое значение:
//  Структура - Новый элемент выбора формы:
// * Идентификатор - УникальныйИдентификатор - 
// * Представление - Строка - 
&НаКлиентеНаСервереБезКонтекста
Функция НовыйЭлементВыбораФормы()
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", УИ_ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Данные.Вставить("Представление", "");
	
	Возврат Данные;
КонецФункции

// Идентификатор способа помещения форма.
// 
// Возвращаемое значение:
//  Строка - Идентификатор способа помещения форма
&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторСпособаПомещенияФорма()
	Возврат "Форма";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторСпособаПомещенияДругойАдрес()
	Возврат "ДругойАдрес";
КонецФункции

// Способы помещения значения во временное хранилище.
// 
// Возвращаемое значение:
//  Структура - Способы помещения значения во временное хранилище:
// * Адрес - см. НовыйСпособПомещения 
// * ДругойАдрес - см. НовыйСпособПомещения 
// * Форма - см. НовыйСпособПомещения  
// * Сеанс - см. НовыйСпособПомещения  
// * ОднократноеПолучение - см. НовыйСпособПомещения 
&НаКлиентеНаСервереБезКонтекста
Функция СпособыПомещенияЗначенияВоВременноеХранилище()
	Способы = Новый Структура;
	Способы.Вставить("Адрес", СпособПомещения("Адрес", "По редактируемому адресу"));
	Способы.Вставить("ДругойАдрес", СпособПомещения(ИдентификаторСпособаПомещенияДругойАдрес(), "Указать другой адрес"));
	Способы.Вставить("Форма", СпособПомещения(ИдентификаторСпособаПомещенияФорма(), "Указанная форма"));
	Способы.Вставить("Сеанс", СпособПомещения("Сеанс", "Текущий сеанс"));
	Способы.Вставить("ОднократноеПолучение", СпособПомещения("ОднократноеПолучение", "Для однократного получения"));

	Возврат Способы;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораСпособаПомещения()
	Способы = СпособыПомещенияЗначенияВоВременноеХранилище();
	
	Элементы.СпособПомещения.СписокВыбора.Очистить();
	
	Для Каждого КлючЗначение Из Способы Цикл
		Способ = КлючЗначение.Значение;
		Элементы.СпособПомещения.СписокВыбора.Добавить(Способ.Имя, Способ.Представление);
	КонецЦикла;
	
	Элементы.СпособПомещения.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

// Удалить значение из временного хранилища завершение.
// 
// Параметры:
//  Результат - КодВозвратаДиалога, Неопределено-Результат
//  ДополнительныеПараметры -Неопределено-Дополнительные параметры
&НаКлиенте
Процедура УдалитьЗначениеИзВременногоХранилищаЗавершение(Результат, ДополнительныеПараметры ) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗначениеИзВременногоХранилищаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресХранилищаПриИзмененииНаКлиенте()
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		АдресХранилища = "";
	КонецЕсли;
	АдресХранилищаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура АдресХранилищаПриИзмененииНаСервере()
	УстановитьЗначениеВременногоХранилищаВКонтейнерФормы();
	
	Если ЗначениеЗаполнено(АдресХранилища) И Не ЗначениеЗаполнено(СпособПомещения) Тогда
		Способы = СпособыПомещенияЗначенияВоВременноеХранилище();
		СпособПомещения = Способы.Адрес.Имя;
		СпособПомещенияПриИзмененииНаСервере();
	КонецЕсли;
	
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Функция РезультатПомещенияЗначенияКонтейнераФормыВоВременноеХранилище()
	СтруктураХраненияПоля = УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером("Значение");
	ЗначениеИзКонтейнера = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(ЭтотОбъект,
																							СтруктураХраненияПоля);
	
	АдресПомещения = АдресХранилища;
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		АдресПомещения = Неопределено;
	КонецЕсли;

	Результат = Истина;
	Попытка
		АдресХранилища = ПоместитьВоВременноеХранилище(ЗначениеИзКонтейнера, АдресПомещения);
	Исключение
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка помещения значения во временное хранилище :"
															 + ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;

	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьЗначениеВременногоХранилищаВКонтейнерФормы()
	Если Не ЗначениеЗаполнено(АдресХранилища) Тогда
		Возврат;
	ИначеЕсли Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введенный адрес не является адресом временного хранилища");
		ЗначениеХранилища = Неопределено;
	Иначе
		ЗначениеХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
	
	СтруктураХраненияПоля = УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером("Значение");

	УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(ЭтотОбъект,
																	   СтруктураХраненияПоля,
																	   ЗначениеХранилища);
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗначениеИзВременногоХранилищаНаСервере()
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УдалитьИзВременногоХранилища(АдресХранилища);
	Исключение
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка при удалении данных из временного хранилища: %1",
																	   ОписаниеОшибки()));
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПоместитьНаСервере()
	РезультатПомещенияЗначенияКонтейнераФормыВоВременноеХранилище();
	
КонецПроцедуры

&НаСервере
Процедура СпособПомещенияПриИзмененииНаСервере()
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	Элементы.ЗаголовокФормыДляПомещения.Видимость = СпособПомещения = ИдентификаторСпособаПомещенияФорма();
	Элементы.НовыйАдресДляПомещения.Видимость = СпособПомещения = ИдентификаторСпособаПомещенияДругойАдрес();
КонецПроцедуры
#КонецОбласти
