
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресХранилища = Параметры.АдресХранилища;
	
	Заголовок  = Параметры.Заголовок;

	АдресХранилищаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.Значение = Значение;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.НаборТипов = УИ_ОбщегоНазначенияКлиентСервер.ВсеНаборыТиповДляРедактирования();

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);

КонецПроцедуры


&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияПриИзменении(ЭтотОбъект,
																								  Элемент,
																								  "Значение");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикПриИзменении(ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура АдресХранилищаПриИзменении(Элемент)
	АдресХранилищаПриИзмененииНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеречитатьИзВременногоХранилища(Команда)
	УстановитьЗначениеВременногоХранилищаВКонтейнерФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗначениеИзВременногоХранилища(Команда)
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	ТекстВопроса = НСтр("ru = 'Данные по указанному адресу будут удалены из временного хранилища!
						|
						|Продолжить?'");

	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗначениеИзВременногоХранилищаЗавершение", ЭтотОбъект);

	ПараметрыВопроса = УИ_ОбщегоНазначенияКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
	ПараметрыВопроса.КнопкаТаймаута = КодВозвратаДиалога.Нет;
	ПараметрыВопроса.Таймаут = 30;

	УИ_ОбщегоНазначенияКлиент.ПоказатьВопросПользователю(ОписаниеОповещения,
														 ТекстВопроса,
														 РежимДиалогаВопрос.ДаНет,
														 ПараметрыВопроса);
КонецПроцедуры

&НаКлиенте
Процедура Поместить(Команда)
	ПоместитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьИЗакрыть(Команда)
	Результат = РезультатПомещенияЗначенияКонтейнераФормыВоВременноеХранилище();
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;

	Закрыть(АдресХранилища);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Удалить значение из временного хранилища завершение.
// 
// Параметры:
//  Результат - КодВозвратаДиалога, Неопределено-Результат
//  ДополнительныеПараметры -Неопределено-Дополнительные параметры
&НаКлиенте
Процедура УдалитьЗначениеИзВременногоХранилищаЗавершение(Результат, ДополнительныеПараметры ) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗначениеИзВременногоХранилищаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресХранилищаПриИзмененииНаКлиенте()
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		АдресХранилища = "";
	КонецЕсли;
	АдресХранилищаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура АдресХранилищаПриИзмененииНаСервере()
	УстановитьЗначениеВременногоХранилищаВКонтейнерФормы();
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Функция РезультатПомещенияЗначенияКонтейнераФормыВоВременноеХранилище()
	СтруктураХраненияПоля = УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером("Значение");
	ЗначениеИзКонтейнера = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(ЭтотОбъект,
																							СтруктураХраненияПоля);
	
	АдресПомещения = АдресХранилища;
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		АдресПомещения = Неопределено;
	КонецЕсли;

	Результат = Истина;
	Попытка
		АдресХранилища = ПоместитьВоВременноеХранилище(ЗначениеИзКонтейнера, АдресПомещения);
	Исключение
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка помещения значения во временное хранилище :"
															 + ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;

	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьЗначениеВременногоХранилищаВКонтейнерФормы()
	Если Не ЗначениеЗаполнено(АдресХранилища) Тогда
		ЗначениеХранилища = Неопределено;
	ИначеЕсли Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введенный адрес не является адресом временного хранилища");
		ЗначениеХранилища = Неопределено;
	Иначе
		ЗначениеХранилища = ПолучитьИзВременногоХранилища(АдресХранилища);

	КонецЕсли;
	
	
	СтруктураХраненияПоля = УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером("Значение");

	УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(ЭтотОбъект,
																	   СтруктураХраненияПоля,
																	   ЗначениеХранилища);
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗначениеИзВременногоХранилищаНаСервере()
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УдалитьИзВременногоХранилища(АдресХранилища);
	Исключение
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка при удалении данных из временного хранилища: %1",
																	   ОписаниеОшибки()));
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПоместитьНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти
