
#Область ОписаниеПеременных

&НаКлиенте
Перем мЗакрытьФормуБезВопросов;

&НаКлиенте
Перем мТекСтрокаТаблицыРегистров;

&НаКлиенте
Перем мТекСтрокаТаблицыРегистровСтарая;

&НаКлиенте
Перем мПоследнийUUID;

&НаКлиенте
Перем мОбработкаВыбора;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мОбъектСсылка = Параметры.мОбъектСсылка;
	мОбъектСсылкаПредыдущий = Неопределено;

	_ПоказыватьИтогиПоЧисловымКолонкамРД = Ложь;
	_ИспользоватьЖирныйШрифтДляИтогов = Истина;

	Если ТипЗнч(Параметры.Настройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.Настройки);
	КонецЕсли;

	АдресОбщихРеквизитов = Параметры.АдресОбщихРеквизитов;
	Если ПустаяСтрока(АдресОбщихРеквизитов) Тогда
		УИ_ОбщегоНазначения.ДанныеПоОбщимРеквизитам(АдресОбщихРеквизитов);
	КонецЕсли;

	_БыстрыйВызовСервера = Истина;
	_ПриЗаполненииОбрабатыватьТолькоВыделенныеСтроки = Истина;

	УИ_ОбщегоНазначения.ФормаИнструментаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если мЗакрытьФормуБезВопросов = Истина Или _ЗадаватьВопросПриЗакрытии = Ложь Тогда
		Возврат;
	КонецЕсли;

	Если _ТабРегистры.НайтиСтроки(Новый Структура("Изменен", Истина)).Количество() <> 0 Тогда
		Если ЗавершениеРаботы = Неопределено Тогда
			// для старых версии платформы
			Отказ = Истина;
			вПоказатьВопрос("вЗакрытьФорму", НСтр("ru = 'Редактор движений будет закрыт. Продолжить?'"));
			Возврат;
		КонецЕсли;

		Если ЗавершениеРаботы = Ложь Тогда
			Отказ = Истина;
			вПоказатьВопрос("вЗакрытьФорму", НСтр("ru = 'Редактор движений будет закрыт. Продолжить?'"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мТекСтрокаТаблицыРегистров = Неопределено;
	мТекСтрокаТаблицыРегистровСтарая = Неопределено;

	ПодключитьОбработчикОжидания("вПослеОткрытия", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если мОбработкаВыбора <> Неопределено Тогда
		Элементы[мОбработкаВыбора.Таблица].ТекущиеДанные[мОбработкаВыбора.Поле] = ВыбранноеЗначение;
		мОбработкаВыбора = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура мОбъектСсылкаПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура мОбъектСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеНаборыТипов = УИ_ОбщегоНазначенияКлиентСервер.ДоступныеНаборыТиповДляРедактирования();
	
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "мОбъектСсылка");
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.Значение = мОбъектСсылка;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;
	ПараметрыОбработчика.НаборТипов = ДоступныеНаборыТипов.Ссылки;
	ПараметрыОбработчика.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработчика.ОповещениеОЗавершении = Новый ОписаниеОповещения("мОбъектСсылкаНачалоВыбораЗавершениеВыбораЗначения",
		ЭтотОбъект);

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура мОбъектСсылкаОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "мОбъектСсылка");
	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура _ЗначениеДляЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыОбработкиСобытия = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																											   Элемент,
																											   "_ЗначениеДляЗаполнения");
																											   
	ПараметрыОбработкиСобытия.ДоступенКонтейнер = Ложь;																											   
	ПараметрыОбработкиСобытия.Значение = _ЗначениеДляЗаполнения;
	ПараметрыОбработкиСобытия.ИспользоватьДинамическийСписокДляВыбораСсылочногоЗначения = _ИспользоватьНеСтандартнуюФормуДляВыбора;
	ПараметрыОбработкиСобытия.СтруктураХраненияЗначения = ЭтотОбъект;
	
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработкиСобытия, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура _ЗначениеДляЗаполненияОчистка(Элемент, СтандартнаяОбработка)
	ПараметрыОбработкиСобытия = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																								  Элемент,
																								  "_ЗначениеДляЗаполнения");

	ПараметрыОбработкиСобытия.ДоступенКонтейнер = Ложь;																											   
	ПараметрыОбработкиСобытия.СтруктураХраненияЗначения = ЭтотОбъект;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработкиСобытия, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТабРегистры

&НаКлиенте
Процедура _ТабРегистрыПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элемент.ТекущаяСтрока;
	Если ТекСтрока <> мТекСтрокаТаблицыРегистров Тогда
		мТекСтрокаТаблицыРегистровСтарая = мТекСтрокаТаблицыРегистров;
		мТекСтрокаТаблицыРегистров = ТекСтрока;
		ПодключитьОбработчикОжидания("вПриАктивизацииСтрокиТаблицыРегистров", 0.1, истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура _Записать(Команда)
	Если Не вПроверитьРегистратора() Тогда
		Возврат;
	КонецЕсли;

	Значение = _ТабРегистры.НайтиСтроки(Новый Структура("Записать", Истина)).Количество();
	Если Значение = 0 Тогда
		вПоказатьПредупреждение(НСтр("ru = 'Не отмечены регистры для записи.'"));
		Возврат;
	КонецЕсли;

	ТекстВопроса = СтрШаблон(НСтр("ru = 'Отмеченные регистры (%1 шт) будут записаны в базу. Продолжить?'"), Значение);
	вПоказатьВопрос("_ЗаписатьДалее", ТекстВопроса);
КонецПроцедуры

&НаКлиенте
Процедура _СортироватьРегистрыСтандартно(Команда)
	СортироватьРегистрыПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура _СнятьФлажки(Команда)
	Для Каждого Стр Из _ТабРегистры.НайтиСтроки(Новый Структура("Записать", Истина)) Цикл
		Стр.Записать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _УстановитьФлажки(Команда)
	Для Каждого Стр Из _ТабРегистры.НайтиСтроки(Новый Структура("Записать", Ложь)) Цикл
		Стр.Записать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _УстановитьФлажкиДляИзмененных(Команда)
	Для Каждого Стр Из _ТабРегистры.НайтиСтроки(Новый Структура("Записать, Изменен", Ложь, Истина)) Цикл
		Стр.Записать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _ОчиститьДвижения(Команда)
	Если Не вПроверитьРегистратора() Тогда
		Возврат;
	КонецЕсли;

	Значение = Элементы._ТабРегистры.ВыделенныеСтроки;
	Если Значение.Количество() = 0 Тогда
		вПоказатьПредупреждение(НСтр("ru = 'Не отмечены регистры для очистки.'"));
		Возврат;
	КонецЕсли;
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Выбранные регистры (%1 шт.) будут очищены. Продолжить?'"), Значение.Количество());
	вПоказатьВопрос("_ОчиститьДвиженияДалее", ТекстВопроса);
КонецПроцедуры

&НаКлиенте
Процедура _ОбновитьНабор(Команда)
	ОбновитьДанныеНабора();
КонецПроцедуры

&НаКлиенте
Процедура _ЗаписатьНабор(Команда)
	Если Не вПроверитьРегистратора() Тогда
		Возврат;
	КонецЕсли;

	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		вПоказатьПредупреждение(НСтр("ru = 'Не задан набор записей для сохранения'"));
		Возврат;
	КонецЕсли;
	вПоказатьВопрос("_ЗаписатьНаборДалее", НСтр("ru = 'Набор записей будет записан в базу. Продолжить?'"));
КонецПроцедуры

&НаКлиенте
Процедура _ПереключитьАктивностьЗаписей(Команда)
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
		Если ЭтотОбъект[ИмяРеквизита].Количество() <> 0 Тогда

			Для Каждого Стр Из ЭтотОбъект[ИмяРеквизита] Цикл
				Стр.Активность = Не Стр.Активность;
			КонецЦикла;

			НаборЗаписейПриИзменении(Элементы[ИмяРеквизита]);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ОткрытьОбъект(Команда)
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
		ТекТаб = ЭтотОбъект[ИмяРеквизита];

		Если ТекТаб.Количество() > 0 Тогда
			ТекТабЭФ = Элементы[ИмяРеквизита];
			ТекПолеЭФ = ТекТабЭФ.ТекущийЭлемент;

			ИмяПоля = Сред(ТекПолеЭФ.Имя, СтрДлина(ИмяРеквизита) + 2);
			Значение = ТекТабЭФ.ТекущиеДанные[ИмяПоля];

			Если ЗначениеЗаполнено(Значение) Тогда

				Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
					вПоказатьЗначениеХЗ(Значение);

				ИначеЕсли вЭтоОбъектМетаданных(ТипЗнч(Значение)) Тогда
					УИ_ОбщегоНазначенияКлиент.РедактироватьОбъект(Значение, АдресОбщихРеквизитов);

				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ПоказатьТипЗначения(Команда)
	_ТипЗначенияТекущегоПоля = "";
	
	Значение = Неопределено;
	
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
		ТекТаб = ЭтотОбъект[ИмяРеквизита];
		
		Если ТекТаб.Количество() > 0 Тогда
			ТекТабЭФ = Элементы[ИмяРеквизита];
			ТекПолеЭФ = ТекТабЭФ.ТекущийЭлемент;
			
			ИмяПоля = Сред(ТекПолеЭФ.Имя, СтрДлина(ИмяРеквизита)+2);
			Значение = ТекТабЭФ.ТекущиеДанные[ИмяПоля];
			
		КонецЕсли;
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		ИмяТипа = "Неопределено";
	Иначе
		ИмяТипа = вСформироватьИмяТипаПоЗначению(Значение);
	КонецЕсли;
	
	_ТипЗначенияТекущегоПоля = ИмяТипа;
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнитьДанныеТекущейКолонки(Команда)
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
		ТекТаб = ЭтотОбъект[ИмяРеквизита];

		Если ТекТаб.Количество() > 0 Тогда

			Значение = _ЗначениеДляЗаполнения;

			ТекДанные.Записать = Истина;
			ТекДанные.Изменен = Истина;

			ТекТабЭФ = Элементы[ИмяРеквизита];
			ТекПолеЭФ = ТекТабЭФ.ТекущийЭлемент;

			ИмяПоля = Сред(ТекПолеЭФ.Имя, СтрДлина(ИмяРеквизита) + 2);

			Если _ПриЗаполненииОбрабатыватьТолькоВыделенныеСтроки Тогда
				Для Каждого Элем Из ТекТабЭФ.ВыделенныеСтроки Цикл
					Стр = ТекТаб.НайтиПоИдентификатору(Элем);
					Стр[ИмяПоля] = Значение;
				КонецЦикла;
			Иначе
				Для Каждого Стр Из ТекТаб Цикл
					Стр[ИмяПоля] = Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ВставитьУникальныйИдентификатор(Команда)
	ТекТаблица = ТекущийЭлемент;

	Если ТекТаблица.Имя = "_ЗначениеДляЗаполнения" Тогда
		ДополнительныеПараметры = Новый Структура("Таблица", ТекТаблица.Имя);
		ПоказатьВводСтроки(Новый ОписаниеОповещения("вОбработатьВвод_UUID", ЭтотОбъект, ДополнительныеПараметры), мПоследнийUUID,
			"Введите уникальный идентификатор", , Ложь);
		Возврат;
	ИначеЕсли ТипЗнч(ТекТаблица) <> Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;

	ТекКолонка = ТекТаблица.ТекущийЭлемент;
	Если ТекКолонка = Неопределено Или ТекКолонка.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	Попытка
		пДоступныеТипы = ТекКолонка.ДоступныеТипы.Типы();
		Если пДоступныеТипы.Количество() <> 0 И пДоступныеТипы.Найти(Тип("УникальныйИдентификатор")) <> 0 Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;

	ТекущиеДанные = Элементы[ТекТаблица.Имя].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДополнительныеПараметры = Новый Структура("Таблица", ТекТаблица.Имя);

		ДополнительныеПараметры.Вставить("Поле", Сред(ТекКолонка.Имя, СтрДлина(ТекТаблица.Имя) + 2));

		ПоказатьВводСтроки(Новый ОписаниеОповещения("вОбработатьВвод_UUID", ЭтотОбъект, ДополнительныеПараметры), мПоследнийUUID,
			НСтр("ru = 'Введите уникальный идентификатор'"), , Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ПересчитатьИтогиПоКолонкам(Команда)
	Если _ПоказыватьИтогиПоЧисловымКолонкамРД Тогда
		ТекущиеДанные = Элементы._ТабРегистры.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			вПересчитатьИтогиПоКолонкам(ТекущиеДанные.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанные()
	мТекСтрокаТаблицыРегистров = Неопределено;
	мТекСтрокаТаблицыРегистровСтарая = Неопределено;
	вОчиститьНаборыЗаписей();
	ОбновитьДанныеНаСервере();
	Элементы.ГруппаРегистры.Заголовок = СтрШаблон(НСтр("ru = 'Движения документа (%1)'"), _ТабРегистры.Количество());
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНабора()
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);

		Если _БыстрыйВызовСервера И _ПоказыватьИтогиПоЧисловымКолонкамРД = Ложь Тогда
			Массив = вПрочитатьНаборЗаписейВКоллекцию(мОбъектСсылка, ТекДанные.ВидРегистра, ТекДанные.Имя);

			Коллекция = ЭтотОбъект[ИмяРеквизита];
			Коллекция.Очистить();

			Для Каждого Элем Из Массив Цикл
				ЗаполнитьЗначенияСвойств(Коллекция.Добавить(), Элем);
			КонецЦикла;
		Иначе
			вОбновитьНаборЗаписей(ТекДанные.ВидРегистра, ТекДанные.Имя);
		КонецЕсли;

		ТекДанные.Изменен = Ложь;
		ТекДанные.Записать = Ложь;
		ТекДанные.ЧислоЗаписей = ЭтотОбъект[ИмяРеквизита].Количество();
		ТекДанные.ЕстьЗаписи = (ТекДанные.ЧислоЗаписей <> 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вПоказатьПредупреждение(ТекстСообщения)
	ПоказатьПредупреждение( , ТекстСообщения, 20);
КонецПроцедуры

&НаКлиенте
Процедура вПоказатьВопрос(ИмяПроцедуры, ТекстВопроса, ДопПараметры = Неопределено)
	ПоказатьВопрос(Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект, ДопПараметры),
				   ТекстВопроса,
				   РежимДиалогаВопрос.ДаНетОтмена,
				   20);
КонецПроцедуры

&НаКлиенте
Процедура вЗакрытьФорму(РезультатВопроса, ДопПараметры = Неопределено) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		мЗакрытьФормуБезВопросов = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вПослеОткрытия() Экспорт
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура мОбъектСсылкаНачалоВыбораЗавершениеВыбораЗначения(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Функция вПроверитьРегистратора()
	Если Не ЗначениеЗаполнено(мОбъектСсылка) Тогда
		вПоказатьПредупреждение(НСтр("ru = 'Не задан объект для записи движений!'"));
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура _ЗаписатьДалее(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		вЗаписать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ОчиститьДвиженияДалее(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыделенныеСтроки = Элементы._ТабРегистры.ВыделенныеСтроки;
		Для каждого Элем из ВыделенныеСтроки Цикл
			СтрДанные = _ТабРегистры.НайтиПоИдентификатору(Элем);
			Если СтрДанные <> Неопределено Тогда
				ИмяРеквизита = вПолучитьИмяРеквизита(СтрДанные.ПолноеИмя);
				
				Попытка
					ТабДанные = ЭтотОбъект[ИмяРеквизита];
					Если ТабДанные.Количество() <> 0 Тогда
						ТабДанные.Очистить();
						СтрДанные.Записать = истина;
						СтрДанные.Изменен = истина;
						СтрДанные.ЕстьЗаписи = ложь;
						СтрДанные.ЧислоЗаписей = 0;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьРегистрыПоУмолчанию()
	_ТабРегистры.Сортировать("Изменен УБЫВ, Записать УБЫВ, ЧислоЗаписей УБЫВ, ПолноеИмя");
КонецПроцедуры

&НаКлиенте
Процедура _ЗаписатьНаборДалее(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			Если вЗаписатьНаборЗаписей(ТекДанные.ВидРегистра, ТекДанные.Имя) Тогда
				ОбновитьДанныеНабора();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вПоказатьЗначениеХЗ(Значение)
	УИ_ОбщегоНазначенияКлиент.РедактироватьХранилищеЗначения(ЭтотОбъект, Значение);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция вПолучитьИмяРеквизита(Знач ПолноеИмя)
	Возврат СтрЗаменить(ПолноеИмя, ".", "_");
КонецФункции

&НаКлиенте
Процедура вОчиститьНаборыЗаписей()
	Для Каждого Стр Из _ТабРегистры.НайтиСтроки(Новый Структура("ЕстьРеквизитФормы", Истина)) Цикл
		ИмяРеквизита = вПолучитьИмяРеквизита(Стр.ПолноеИмя);
		ЭтотОбъект[ИмяРеквизита].Очистить();
		Стр.ЕстьЗаписи = Ложь;
		Стр.ЧислоЗаписей = 0;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура вУдалитьРеквизитыНаборовЗаписей()
	МассивКСозданию = Новый Массив;
	МассивКУдалению = Новый Массив;

	Для Каждого Стр Из _ТабРегистры.НайтиСтроки(Новый Структура("ЕстьРеквизитФормы", Истина)) Цикл
		ИмяРеквизита = вПолучитьИмяРеквизита(Стр.ПолноеИмя);

		Если вПроверитьНаличиеРеквизита(ИмяРеквизита) Тогда
			МассивКУдалению.Добавить(ИмяРеквизита);
		КонецЕсли;
		Стр.ЕстьРеквизитФормы = Ложь;

		ЭФ = Элементы.Найти("Стр_" + ИмяРеквизита);
		Если ЭФ <> Неопределено Тогда
			Элементы.Удалить(ЭФ);
		КонецЕсли;
	КонецЦикла;

	ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
КонецПроцедуры

&НаСервереБезКонтекста
Функция вЭтоОбъектМетаданных(Знач Тип)
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	Возврат (ОбъектМетаданных <> Неопределено И Не Метаданные.Перечисления.Содержит(ОбъектМетаданных));
КонецФункции

&НаСервереБезКонтекста
Функция вСформироватьИмяТипаПоЗначению(Знач Значение)
	ТипЗначения = ТипЗнч(Значение);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если ОбъектМетаданных <> Неопределено Тогда
		ИмяТипа = ОбъектМетаданных.ПолноеИмя();
	Иначе
		ИмяТипа = Строка(ТипЗначения);
	КонецЕсли;

	Возврат ИмяТипа;
КонецФункции

&НаСервереБезКонтекста
Функция вПрочитатьНаборЗаписей(Знач Регистратор, Знач ВидРегистра, Знач ИмяРегистра)
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистратор", Регистратор);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.*
		|ИЗ
		|	&ИмяТаблицы КАК т
		|ГДЕ
		|	т.ДокументРегистратор = &ДокументРегистратор";
	
	ИмяТаблицы = СтрШаблон("%1.%2", ВидРегистра, ИмяРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	Возврат ТабРезультат;
КонецФункции

&НаСервереБезКонтекста
Функция вСоздатьНаборЗаписей(Регистратор, ВидРегистра, ИмяРегистра)
	Если ВидРегистра = "РегистрСведений" Тогда
		Менеджер = РегистрыСведений[ИмяРегистра];
	ИначеЕсли ВидРегистра = "РегистрНакопления" Тогда
		Менеджер = РегистрыНакопления[ИмяРегистра];
	ИначеЕсли ВидРегистра = "РегистрРасчета" Тогда
		Менеджер = РегистрыРасчета[ИмяРегистра];
	ИначеЕсли ВидРегистра = "РегистрБухгалтерии" Тогда
		Менеджер = РегистрыБухгалтерии[ИмяРегистра];
	Иначе
		Менеджер = Неопределено;
	КонецЕсли;

	Набор = Менеджер.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);

	Возврат Набор;
КонецФункции

&НаСервереБезКонтекста
Функция вПрочитатьНаборЗаписейВКоллекцию(Знач Регистратор, Знач ВидРегистра, Знач ИмяРегистра)
	ТабРезультат = вПрочитатьНаборЗаписей(Регистратор, ВидРегистра, ИмяРегистра);

	Струк = Новый Структура;

	Для Каждого Элем Из ТабРезультат.Колонки Цикл
		Струк.Вставить(Элем.Имя);
	КонецЦикла;

	Массив = Новый Массив;

	Для Каждого Стр Из ТабРезультат Цикл
		НС = Новый Структура;
		Для Каждого Элем Из Струк Цикл
			НС.Вставить(Элем.Ключ);
		КонецЦикла;

		ЗаполнитьЗначенияСвойств(НС, Стр);
		Массив.Добавить(НС);
	КонецЦикла;

	Возврат Массив;
КонецФункции

&НаСервере
Процедура вОбновитьНаборЗаписей(Знач ВидРегистра, Знач ИмяРегистра)
	ТабРезультат = вПрочитатьНаборЗаписей(мОбъектСсылка, ВидРегистра, ИмяРегистра);
	ЗначениеВРеквизитФормы(ТабРезультат, вПолучитьИмяРеквизита(ВидРегистра + "." + ИмяРегистра));
	
	Если _ПоказыватьИтогиПоЧисловымКолонкамРД Тогда
		вПересчитатьИтогиПоКолонкам(ВидРегистра + "." + ИмяРегистра, ТабРезультат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция вЗаписатьНаборЗаписей(Знач ВидРегистра, Знач ИмяРегистра)
	ИмяТаблицы = СтрШаблон("%1.%2", ВидРегистра, ИмяРегистра);
	ИмяРеквизита = вПолучитьИмяРеквизита(ИмяТаблицы);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", мОбъектСсылка);

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаДокумента.Дата КАК Дата
		|ИЗ
		|	&ИмяТаблицы КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
	Выборка = Запрос.Выполнить().Выбрать();
	Период = ?(Выборка.Следующий(), Выборка.Дата, Неопределено);
	Если Период = Неопределено Тогда
		УИ_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не найден указанный документ!'"));
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистратор", мОбъектСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.*
		|ИЗ
		|	&ИмяТаблицы КАК т
		|ГДЕ
		|	т.ДокументРегистратор = &ДокументРегистратор";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);

	ТабЗаписиА = Запрос.Выполнить().Выгрузить();
	ТабРегистраторыА = ТабЗаписиА.Скопировать( , "Регистратор");
	ТабРегистраторыА.Свернуть("Регистратор");
	ТабЗаписиА.Индексы.Добавить("Регистратор");

	ТабЗаписиБ = РеквизитФормыВЗначение(ИмяРеквизита);
	ТабРегистраторыБ = ТабЗаписиБ.Скопировать( , "Регистратор");
	ТабРегистраторыБ.Свернуть("Регистратор");
	ТабЗаписиБ.Индексы.Добавить("Регистратор");

	ТабРегистраторыБ.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));
	ТабРегистраторыБ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));

	НачатьТранзакцию();

	Для Каждого СтрА Из ТабРегистраторыА Цикл
		Набор = вСоздатьНаборЗаписей(СтрА.Регистратор, ВидРегистра, ИмяРегистра);

		Набор.Прочитать();
		ТабНабор = Набор.Выгрузить();
		ТабНабор.Индексы.Добавить("ДокументРегистратор");

		Для Каждого Стр Из ТабНабор.НайтиСтроки(Новый Структура("ДокументРегистратор", мОбъектСсылка)) Цикл
			ТабНабор.Удалить(Стр);
		КонецЦикла;

		Для Каждого СтрБ Из ТабЗаписиБ.НайтиСтроки(Новый Структура("Регистратор", СтрА.Регистратор)) Цикл
			НС = ТабНабор.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрБ);
			НС.Регистратор = СтрА.Регистратор;
			НС.ДокументРегистратор = мОбъектСсылка;
			НС.Период = Период;
		КонецЦикла;

		Набор.Загрузить(ТабНабор);

		СтрБ = ТабРегистраторыБ.Найти(СтрА.Регистратор, "Регистратор");
		Если СтрБ <> Неопределено Тогда
			СтрБ.Обработан = Истина;
		КонецЕсли;

		Попытка
			Если _ЗаписьВРежимеЗагрузки Тогда
				Набор.ОбменДанными.Загрузка = Истина;
			КонецЕсли;
			Набор.Записать();
		Исключение
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОтменитьТранзакцию();

			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;

	Для Каждого СтрА Из ТабРегистраторыБ.НайтиСтроки(Новый Структура("Обработан", Ложь)) Цикл
		Набор = вСоздатьНаборЗаписей(СтрА.Регистратор, ВидРегистра, ИмяРегистра);

		Набор.Прочитать();
		ТабНабор = Набор.Выгрузить();

		Для Каждого СтрБ Из ТабЗаписиБ.НайтиСтроки(Новый Структура("Регистратор", СтрА.Регистратор)) Цикл
			НС = ТабНабор.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрБ);
			НС.Регистратор = СтрА.Регистратор;
			НС.ДокументРегистратор = мОбъектСсылка;
			НС.Период = Период;
		КонецЦикла;

		Набор.Загрузить(ТабНабор);

		Попытка
			Если _ЗаписьВРежимеЗагрузки Тогда
				Набор.ОбменДанными.Загрузка = Истина;
			КонецЕсли;
			Набор.Записать();
		Исключение
			УИ_ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОтменитьТранзакцию();

			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;

	ЗафиксироватьТранзакцию();

	Возврат Истина;
КонецФункции

&НаСервере
Функция вЗаписать()
	НайденныеСтроки = _ТабРегистры.НайтиСтроки(Новый Структура("Записать", Истина));
	ЕстьТранзакция = (НайденныеСтроки.Количество() > 1);

	Если ЕстьТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;

	Для Каждого Стр Из НайденныеСтроки Цикл
		Если Не вЗаписатьНаборЗаписей(Стр.ВидРегистра, Стр.Имя) Тогда
			Если ЕстьТранзакция Тогда
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьТранзакция Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Для Каждого Стр Из НайденныеСтроки Цикл
		ИмяРеквизита = вПолучитьИмяРеквизита(Стр.ПолноеИмя);

		вОбновитьНаборЗаписей(Стр.ВидРегистра, Стр.Имя);

		Стр.Изменен = Ложь;
		Стр.Записать = Ложь;
		Стр.ЧислоЗаписей = ЭтотОбъект[ИмяРеквизита].Количество();
		Стр.ЕстьЗаписи = (Стр.ЧислоЗаписей <> 0);
	КонецЦикла;

	Возврат Истина;
КонецФункции

&НаСервере
Процедура вСоздатьРеквизитыНаборовЗаписей(НадоСоздаватьРеквизиты = Истина)

	ТипХЗ = Тип("ХранилищеЗначения");
	ТипТТ = Тип("Тип");
	ТипМВ = Тип("МоментВремени");
	
	ТипЧисло = Тип("Число");

	СоотвДанные = Новый Соответствие;

	МассивКСозданию = Новый Массив;
	МассивКУдалению = Новый Массив;

	Для Каждого Стр Из _ТабРегистры Цикл
		Стр.ЕстьРеквизитФормы = Истина;

		ИмяРеквизита = вПолучитьИмяРеквизита(Стр.ПолноеИмя);

		Если НадоСоздаватьРеквизиты Тогда
			МассивКСозданию.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ТаблицаЗначений"), ,
				Стр.ПолноеИмя, Ложь));
		КонецЕсли;

		ТабРезультат = вПрочитатьНаборЗаписей(мОбъектСсылка, Стр.ВидРегистра, Стр.Имя);
		СоотвДанные.Вставить(ИмяРеквизита, ТабРезультат);

		Стр.ЧислоЗаписей = ТабРезультат.Количество();
		Стр.ЕстьЗаписи = (Стр.ЧислоЗаписей <> 0);
		Стр.Изменен = Ложь;
		Стр.Записать = Ложь;

		Если НадоСоздаватьРеквизиты Тогда
			Для Каждого Колонка Из ТабРезультат.Колонки Цикл
				Если Колонка.ТипЗначения.СодержитТип(ТипХЗ) Тогда
					ТипЗначенияРеквизита = Новый ОписаниеТипов;
				ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипТТ) Тогда
					ТипЗначенияРеквизита = Новый ОписаниеТипов;
				ИначеЕсли Колонка.ТипЗначения.СодержитТип(ТипМВ) Тогда
					ТипЗначенияРеквизита = Новый ОписаниеТипов;
				Иначе
					ТипЗначенияРеквизита = Колонка.ТипЗначения;
				КонецЕсли;
				МассивКСозданию.Добавить(Новый РеквизитФормы(Колонка.Имя, ТипЗначенияРеквизита, ИмяРеквизита,
					Колонка.Заголовок, Ложь));
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Если НадоСоздаватьРеквизиты Тогда
		ИзменитьРеквизиты(МассивКСозданию, МассивКУдалению);
	КонецЕсли;

	_ТабРегистры.Сортировать("Изменен УБЫВ, ЧислоЗаписей УБЫВ, ПолноеИмя");
	
	// создание элементов формы
	//СтрукСпецКолонки = новый Структура("Регистратор, МоментВремени");
	СтрукСпецКолонки = Новый Структура("НомерСтроки, МоментВремени, ДокументРегистратор");

	Для Каждого ЭлемХ Из СоотвДанные Цикл
		ТабРезультат = ЭлемХ.Значение;
		ИмяРеквизита = ЭлемХ.Ключ;

		ЗначениеВРеквизитФормы(ЭлемХ.Значение, ЭлемХ.Ключ);

		Если Не НадоСоздаватьРеквизиты Тогда
			Если _ПоказыватьИтогиПоЧисловымКолонкамРД Тогда
				вПересчитатьИтогиПоКолонкам(ИмяРеквизита, ТабРезультат);
			КонецЕсли;
			Продолжить;
		КонецЕсли;

		НоваяСтраница = Элементы.Добавить("Стр_" + ИмяРеквизита, Тип("ГруппаФормы"), Элементы.СтраницыНаборыЗаписей);
		НоваяСтраница.Вид = ВидГруппыФормы.Страница;
		НоваяСтраница.Заголовок = "";
		НоваяСтраница.Видимость = Истина;

		ЭлемТЗ = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), НоваяСтраница);
		ЭлемТЗ.ПутьКДанным = ИмяРеквизита;
		ЭлемТЗ.УстановитьДействие("ПриИзменении", "НаборЗаписейПриИзменении");

		Элем = Элементы.Добавить("_" + ИмяРеквизита + "_ПереключитьАктивностьЗаписей",
											Тип("КнопкаФормы"),
											ЭлемТЗ.КоманднаяПанель);
		Элем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элем.ИмяКоманды = "_ПереключитьАктивностьЗаписей";
		Элем.Видимость = Ложь;

		Элем = Элементы.Добавить("_" + ИмяРеквизита + "_ОткрытьОбъект",
											Тип("КнопкаФормы"),
											ЭлемТЗ.КоманднаяПанель);
		Элем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элем.ИмяКоманды = "_ОткрытьОбъект";

		Элем = Элементы.Добавить("_" + ИмяРеквизита + "_ОбновитьНабор",
											Тип("КнопкаФормы"),
											ЭлемТЗ.КоманднаяПанель);
		Элем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элем.ИмяКоманды = "_ОбновитьНабор";

		Элем = Элементы.Добавить("_" + ИмяРеквизита + "_ЗаписатьНабор",
											Тип("КнопкаФормы"),
											ЭлемТЗ.КоманднаяПанель);
		Элем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элем.ИмяКоманды = "_ЗаписатьНабор";

		ГруппаКнопок = Элементы.Добавить("Группа_" + ЭлемТЗ.Имя, Тип("ГруппаФормы"), ЭлемТЗ.КонтекстноеМеню);
		ГруппаКнопок.Вид = ВидГруппыФормы.ГруппаКнопок;

		Кнопка = Элементы.Добавить("_ВставитьУникальныйИдентификатор_" + ЭлемТЗ.Имя, Тип("КнопкаФормы"), ГруппаКнопок);
		Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Кнопка.ИмяКоманды = "_ВставитьУникальныйИдентификатор";

		пЕстьЧисловыеКолонки = Ложь;

		Для Каждого Колонка Из ТабРезультат.Колонки Цикл
			Если СтрукСпецКолонки.Свойство(Колонка.Имя) Тогда
				Продолжить;
			КонецЕсли;

			Элем = Элементы.Добавить(ИмяРеквизита + "_" + Колонка.Имя, Тип("ПолеФормы"), ЭлемТЗ);
			Элем.ПутьКДанным = ИмяРеквизита + "." + Колонка.Имя;
			Элем.Вид = ВидПоляФормы.ПолеВвода;
			Элем.ДоступныеТипы = Колонка.ТипЗначения;

			Если Колонка.ТипЗначения.СодержитТип(ТипХЗ) Тогда // версия 033
				Элем.ТолькоПросмотр = Истина;
			Иначе
				Элем.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
			КонецЕсли;

			Если Колонка.Имя = "Активность" Тогда
				Элем.ТолькоПросмотр = Истина;
			КонецЕсли;

			Если _ПоказыватьИтогиПоЧисловымКолонкамРД
				 И Колонка.ТипЗначения.СодержитТип(ТипЧисло)
				 И Колонка.Имя <> "НомерСтроки" Тогда
				пЕстьЧисловыеКолонки = Истина;
				Элем.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
				Элем.ЦветТекстаПодвала = ЦветаСтиля.ЦветФонаВыделенияПоля;
				Если _ИспользоватьЖирныйШрифтДляИтогов Тогда
					Элем.ШрифтПодвала = Новый Шрифт(Элем.Шрифт, , , Истина);
				КонецЕсли;
				Элем.ТекстПодвала = Строка(ТабРезультат.Итог(Колонка.Имя));
			КонецЕсли;
		КонецЦикла;

		Если _ПоказыватьИтогиПоЧисловымКолонкамРД И пЕстьЧисловыеКолонки Тогда
			ЭлемТЗ.Подвал = Истина;
			Элем = Элементы.Добавить("_" + ИмяРеквизита + "_ПересчитатьИтогиПоКолонкам",
												Тип("КнопкаФормы"),
												ЭлемТЗ.КоманднаяПанель);
			Элем.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Элем.ИмяКоманды = "_ПересчитатьИтогиПоКолонкам";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция вПроверитьНаличиеРеквизита(ИмяРеквизита)
	Струк = Новый Структура(ИмяРеквизита);
	ЗаполнитьЗначенияСвойств(Струк, ЭтотОбъект);
	Возврат (Струк[ИмяРеквизита] <> Неопределено);
КонецФункции

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	НадоСоздаватьРеквизиты = (ТипЗнч(мОбъектСсылка) <> ТипЗнч(мОбъектСсылкаПредыдущий));
	
	мОбъектСсылкаПредыдущий = мОбъектСсылка;
	
	Если НадоСоздаватьРеквизиты Тогда
		вУдалитьРеквизитыНаборовЗаписей();
		
		_ТабРегистры.Очистить();
		Если мОбъектСсылка <> Неопределено Тогда
			ОбъектМД = мОбъектСсылка.Метаданные();
			_ПолноеИмяДокумента = ОбъектМД.ПолноеИмя();
			
			Результат = вОпределитьДополнительныеРегистрыДокумента(_ПолноеИмяДокумента);
			Если Результат.ЕстьДанные Тогда
				Для каждого Элемент из Результат.ДополнительныеРегистры Цикл
					НС = _ТабРегистры.Добавить();
					НС.Имя = Сред(Элемент.Ключ, СтрНайти(Элемент.Ключ, ".")+1);
					НС.Представление = Элемент.Значение;
					НС.ПолноеИмя = Элемент.Ключ;
					НС.ВидРегистра = Лев(НС.ПолноеИмя, СтрНайти(НС.ПолноеИмя, ".")-1);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		_ТабРегистры.Сортировать("ПолноеИмя");
	КонецЕсли;
	
	вСоздатьРеквизитыНаборовЗаписей(НадоСоздаватьРеквизиты);
КонецПроцедуры

&НаСервереБезКонтекста
Функция вОпределитьДополнительныеРегистрыДокумента(Знач ПолноеИмяДокумента)
	ДополнительныеРегистры = Новый Соответствие;

	Результат = Новый Структура;
	Результат.Вставить("ЕстьДанные", Ложь);
	Результат.Вставить("ДополнительныеРегистры", ДополнительныеРегистры);

	МетаданныеРегистратора = Метаданные.Документы.Найти("РегистраторРасчетов");
	Если МетаданныеРегистратора = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Если ТипЗнч(ПолноеИмяДокумента) <> Тип("Строка") Тогда
		ПолноеИмяДокумента = ПолноеИмяДокумента.Метаданные().ПолноеИмя();
		Если СтрНайти(ПолноеИмяДокумента, "Документ.") <> 1 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Для Каждого ЭлемМД Из МетаданныеРегистратора.Движения Цикл
		пРеквизитМД = ЭлемМД.Реквизиты.Найти("ДокументРегистратор");
		Если пРеквизитМД <> Неопределено Тогда
			пИмяРегистра = ЭлемМД.ПолноеИмя();

			Для Каждого пТип Из пРеквизитМД.Тип.Типы() Цикл
				пДокМД = Метаданные.НайтиПоТипу(пТип);

				Если пДокМД <> Неопределено Тогда
					пИмяДокумента = пДокМД.ПолноеИмя();

					Если пИмяДокумента = ПолноеИмяДокумента И пИмяДокумента <> "Документ.РегистраторРасчетов" Тогда
						ДополнительныеРегистры[пИмяРегистра] = ЭлемМД.Представление();
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Результат.ЕстьДанные = (ДополнительныеРегистры.Количество() <> 0);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура НаборЗаписейПриИзменении(Элемент)
	ТекДанные = Элементы._ТабРегистры.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Изменен = Истина;
		ТекДанные.Записать = Истина;
		ТекДанные.ЧислоЗаписей = ЭтотОбъект[Элемент.Имя].Количество();
		ТекДанные.ЕстьЗаписи = (ТекДанные.ЧислоЗаписей <> 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вПриАктивизацииСтрокиТаблицыРегистров() Экспорт
	Если мЗакрытьФормуБезВопросов = Истина Тогда
		Возврат;
	КонецЕсли;

	Если мТекСтрокаТаблицыРегистровСтарая <> Неопределено Тогда
		ТекДанные = _ТабРегистры.НайтиПоИдентификатору(мТекСтрокаТаблицыРегистровСтарая);
		Если ТекДанные <> Неопределено Тогда
			ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;

	ТекДанные = Неопределено;
	Если мТекСтрокаТаблицыРегистров <> Неопределено Тогда
		ТекДанные = _ТабРегистры.НайтиПоИдентификатору(мТекСтрокаТаблицыРегистров);
		Если ТекДанные <> Неопределено Тогда
			ИмяРеквизита = вПолучитьИмяРеквизита(ТекДанные.ПолноеИмя);
			ТекущаяСтраница = Элементы.Найти("Стр_" + ИмяРеквизита);
			Если ТекущаяСтраница <> Неопределено Тогда
				Элементы.СтраницыНаборыЗаписей.ТекущаяСтраница = ТекущаяСтраница;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ТекДанные = Неопределено Тогда
		Элементы.СтраницыНаборыЗаписей.ТекущаяСтраница = Элементы.СтрПример;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вОбработатьВвод_UUID(Строка, ДополнительныеПараметры = Неопределено) Экспорт
	Если Строка <> Неопределено И Не ПустаяСтрока(Строка) Тогда
		Попытка
			Значение = Новый УникальныйИдентификатор(Строка);
			мПоследнийUUID = Строка;
		Исключение
			ПоказатьПредупреждение( , НСтр("ru = 'Значение не может быть преобразовано в Уникальный идентификатор!'"), 20);
			Возврат;
		КонецПопытки;

		Если ДополнительныеПараметры.Таблица = "_ЗначениеДляЗаполнения" Тогда
			_ЗначениеДляЗаполнения = Значение;
		Иначе
			ТекДанные = Элементы[ДополнительныеПараметры.Таблица].ТекущиеДанные;
			Если ТекДанные <> Неопределено Тогда
				ТекДанные[ДополнительныеПараметры.Поле] = Значение;

				ТекДанныеРег = Элементы._ТабРегистры.ТекущиеДанные;
				ТекДанныеРег.Записать = Истина;
				ТекДанныеРег.Изменен = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура вПересчитатьИтогиПоКолонкам(Знач ПолноеИмя, Знач ТабРезультат = Неопределено)
	ТипЧисло = Тип("Число");
	
	ИмяРеквизита = вПолучитьИмяРеквизита(ПолноеИмя);
	
	Если ТабРезультат = Неопределено Тогда
		ТабРезультат = РеквизитФормыВЗначение(ИмяРеквизита);
	КонецЕсли;
	
	Для каждого пКолонка из ТабРезультат.Колонки Цикл
		Если пКолонка.ТипЗначения.СодержитТип(ТипЧисло) и пКолонка.Имя <> "НомерСтроки" Тогда
			ЭФ = Элементы.Найти(ИмяРеквизита + "_" + пКолонка.Имя);
			Если ЭФ <> Неопределено Тогда
				ЭФ.ТекстПодвала = Строка(ТабРезультат.Итог(пКолонка.Имя));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
