&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок  = Параметры.Заголовок;
	КонецЕсли;

	Если Параметры.Свойство("ВозвращатьТолькоВыбранныеЗначения") Тогда
		ВозвращатьТолькоВыбранныеЗначения=Параметры.ВозвращатьТолькоВыбранныеЗначения;
	КонецЕсли;

	СписокЗначений=Параметры.Список;
	Если Параметры.Свойство("ТипЭлементов") Тогда
		СписокЗначений.ТипЗначения=Параметры.ТипЭлементов;
	КонецЕсли;

	Если Параметры.Свойство("ВидимостьПометки") Тогда
		Элементы.СписокЗначенийПометка.Видимость=Параметры.ВидимостьПометки;
	КонецЕсли;
	Если Параметры.Свойство("ВидимостьПредставления") Тогда
		Элементы.СписокЗначенийПредставление.Видимость=Параметры.ВидимостьПредставления;
	КонецЕсли;

	Если Параметры.Свойство("РежимПодбора") Тогда
		РежимПодбора=Параметры.РежимПодбора;
	Иначе
		РежимПодбора=Ложь;
	КонецЕсли;
	
	Элементы.СписокЗначений.ИзменятьПорядокСтрок=РежимПодбора;
	Элементы.СписокЗначений.ИзменятьСоставСтрок=РежимПодбора;
	Элементы.СписокЗначенийЗначение.ТолькоПросмотр=НЕ РежимПодбора;
	Если Не РежимПодбора Тогда
		Элементы.СписокЗначений.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Применить(Команда)
	Если Не ВозвращатьТолькоВыбранныеЗначения Тогда
		СписокВозврата=СписокЗначений;
	Иначе
		СписокВозврата=Новый СписокЗначений;

		Для Каждого Элемент Из СписокЗначений Цикл
			Если Не Элемент.Пометка Тогда
				Продолжить;
			КонецЕсли;
			СписокВозврата.Добавить(Элемент.Значение, Элемент.Представление, Элемент.Пометка, Элемент.Картинка);
		КонецЦикла;
	КонецЕсли;

	Закрыть(СписокВозврата);
КонецПроцедуры