#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура СохранитьФайл(РасположениеФайла, АдресФайлаВХранилище, Интерактивно, ОписаниеОповещения = Неопределено) Экспорт

	Если ОписаниеОповещения = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект);
	КонецЕсли;

	ПолучаемыеФайлы = Новый Массив;
	НовыйФайл = Новый ОписаниеПередаваемогоФайла(РасположениеФайла, АдресФайлаВХранилище);
	ПолучаемыеФайлы.Добавить(НовыйФайл);

	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, , Интерактивно);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(РасположениеФайла, Интерактивно, ВыполняемоеОповещение) Экспорт

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПомещениеФайла(ОписаниеОповещения, , РасположениеФайла, Интерактивно);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-warning
&НаКлиенте
Процедура СохранитьФайлЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	// Заглушка	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Адрес);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти