#Область ПрограммныйИнтерфейс

Функция ОписнаиеМетаданныйДляИнициализацииРедактораMonaco() Экспорт
	Возврат УИ_РедакторКодаСервер.ОписнаиеМетаданныйДляИнициализацииРедактораMonaco();
КонецФункции

Функция ОписаниеОбъектаМетаданныхКонфигурацииПоИмени(ВидОбъекта, ИмяОбъекта) Экспорт
	Возврат УИ_РедакторКодаСервер.ОписаниеОбъектаМетаданныхКонфигурацииПоИмени(ВидОбъекта, ИмяОбъекта);
КонецФункции

Функция ОписаниеМетаданныхКонфигурации(ВключатьОписаниеРеквизитов = Истина) Экспорт
	Возврат УИ_РедакторКодаСервер.ОписаниеМетаданныхКонфигурации(ВключатьОписаниеРеквизитов);
КонецФункции

Функция СписокМетаданныхПоВиду(ВидМетаданных) Экспорт
	Возврат УИ_РедакторКодаСервер.СписокМетаданныхПоВиду(ВидМетаданных);
КонецФункции

Функция СоответствиеСсылочныхТипов() Экспорт
	Возврат УИ_РедакторКодаСервер.СоответствиеСсылочныхТипов();
КонецФункции

// Редакторы для сборки с преобразованным текстом модуля.
// 
// Параметры:
//  РедакторыДляСборки - Массив из см. УИ_РедакторКодаКлиентСервер.НовыйДанныеРедактораДляСборкиОбработки - Редакторы для сборки
// 
// Возвращаемое значение:
// Массив из см. УИ_РедакторКодаКлиентСервер.НовыйДанныеРедактораДляСборкиОбработки 
Функция РедакторыДляСборкиСПреобразованнымТекстомМодуля(РедакторыДляСборки) Экспорт
	Возврат УИ_РедакторКодаСервер.РедакторыДляСборкиСПреобразованнымТекстомМодуля(РедакторыДляСборки);	
КонецФункции

// Ссылка на код в сервисе после загрузки.
// 
// Параметры:
//  ТекстАлгоритма -Строка-Текст алгоритма
//  РежимЗапроса -Булево -Режим запроса
// 
// Возвращаемое значение:
//  Строка -  Ссылка на код в сервисе после загрузки
Функция СсылкаНаКодВСервисеПослеЗагрузки(ТекстАлгоритма, РежимЗапроса) Экспорт
	РезультатОтправки = УИ_Paste1CAPI.РезультатЗагрузкиАлгоритмаВСервис(ТекстАлгоритма, РежимЗапроса);
	Если РезультатОтправки = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось загрузить алгоритм в сервис");
		Возврат "";
	КонецЕсли;
	
	Если Не РезультатОтправки.Успешно Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось загрузить алгоритм в сервис: "
															 + РезультатОтправки.Ошибки);
		Возврат "";

	КонецЕсли;

	Возврат РезультатОтправки.Ссылка;
КонецФункции

// Данные алгоритма в сервисе.
// 
// Параметры:
//  Ссылка -Строка- Ссылка
// 
// Возвращаемое значение:
// см. УИ_Paste1CAPI.НовыйДанныеАлгоритма
// Возвращаемое значение:
// Неопределено - Получить данные из сервиса не удалось
Функция ДанныеАлгоритмаВСервисе(Ссылка) Экспорт
	СтруктураСсылки = УИ_КоннекторHTTP.РазобратьURL(Ссылка);	
	
	МассивПути = СтрРазделить(СтруктураСсылки.Путь, "/", Ложь);
	Если МассивПути.Количество() = 0 Тогда
		УИ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указан невалидный адрес кода");
		Возврат Неопределено;
	КонецЕсли;
		
	ИдентификаторАлгоритма = МассивПути[МассивПути.Количество()-1];	
	
	Возврат  УИ_Paste1CAPI.ДанныеАлгоритмаСервиса(ИдентификаторАлгоритма);
	
КонецФункции

// Данные библиотеки общего макета.
// 
// Параметры:
//  ИмяМакета - Строка -Имя макета
//  ИдентификаторФормы - УникальныйИдентификатор
//  ДляИзвлеченияНаКлиенте - Булево
// 
// Возвращаемое значение:
//  см. УИ_РедакторКодаКлиентСервер.НовыйДанныеБиблиотекиРедактора
Функция ДанныеБиблиотекиОбщегоМакета(ИмяМакета, ИдентификаторФормы, ДляИзвлеченияНаКлиенте) Экспорт
	Возврат УИ_РедакторКодаСервер.ДанныеБиблиотекиОбщегоМакета(ИмяМакета, ИдентификаторФормы, ДляИзвлеченияНаКлиенте);
КонецФункции

#КонецОбласти