#Область ПрограммныйИнтерфейс

Функция ОписнаиеМетаданныйДляИнициализацииРедактораMonaco() Экспорт
	Возврат УИ_РедакторКодаСервер.ОписнаиеМетаданныйДляИнициализацииРедактораMonaco();
КонецФункции

Функция ОписаниеОбъектаМетаданныхКонфигурацииПоИмени(ВидОбъекта, ИмяОбъекта) Экспорт
	Возврат УИ_РедакторКодаСервер.ОписаниеОбъектаМетаданныхКонфигурацииПоИмени(ВидОбъекта, ИмяОбъекта);
КонецФункции

Функция ОписаниеМетаданныхКонфигурации(ВключатьОписаниеРеквизитов = Истина) Экспорт
	Возврат УИ_РедакторКодаСервер.ОписаниеМетаданныхКонфигурации(ВключатьОписаниеРеквизитов);
КонецФункции

Функция СписокМетаданныхПоВиду(ВидМетаданных) Экспорт
	Возврат УИ_РедакторКодаСервер.СписокМетаданныхПоВиду(ВидМетаданных);
КонецФункции

Функция СоответствиеСсылочныхТипов() Экспорт
	Возврат УИ_РедакторКодаСервер.СоответствиеСсылочныхТипов();
КонецФункции

// Редакторы для сборки с преобразованным текстом модуля.
// 
// Параметры:
//  РедакторыДляСборки - Массив из см. УИ_РедакторКодаКлиентСервер.НовыйДанныеРедактораДляСборкиОбработки - Редакторы для сборки
// 
// Возвращаемое значение:
// Массив из см. УИ_РедакторКодаКлиентСервер.НовыйДанныеРедактораДляСборкиОбработки 
Функция РедакторыДляСборкиСПреобразованнымТекстомМодуля(РедакторыДляСборки) Экспорт
	Возврат УИ_РедакторКодаСервер.РедакторыДляСборкиСПреобразованнымТекстомМодуля(РедакторыДляСборки);	
КонецФункции

#КонецОбласти