&НаСервере
Процедура ПолучитьСтруктуру()

	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);

	Если СтруктураБазы = Неопределено Тогда

		СтруктураБазы = ПолучитьСтруктуруХраненияБазыДанных();
		ПоместитьВоВременноеХранилище(СтруктураБазы, АдресСтруктурыБазы);

	КонецЕсли;

	ЗаполнитьТаблицуРезультата(СтруктураБазы);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРезультата(СтруктураБазы,НайденныеСтроки=Неопределено)
	Результат.Очистить();

	Если НайденныеСтроки=Неопределено Тогда
		СтрокиДляРезультата=СтруктураБазы;
	Иначе
		СтрокиДляРезультата=НайденныеСтроки;
	КонецЕсли;

	Для каждого Строка из СтрокиДляРезультата Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИмяТаблицы = Строка.ИмяТаблицы;
		НоваяСтрока.Метаданные = Строка.Метаданные;
		НоваяСтрока.Назначение = Строка.Назначение;
		НоваяСтрока.ИмяТаблицыХранения = Строка.ИмяТаблицыХранения;

		Для каждого Поле ИЗ Строка.Поля Цикл
			НоваяСтрокаПолей = НоваяСтрока.Поля.Добавить();
			НоваяСтрокаПолей.ИмяПоляХранения = Поле.ИмяПоляХранения;
			НоваяСтрокаПолей.ИмяПоля = Поле.ИмяПоля;
			НоваяСтрокаПолей.Метаданные = Поле.Метаданные;
		КонецЦикла;

		Для каждого Индекс ИЗ Строка.Индексы Цикл
			НоваяСтрокаИндексов = НоваяСтрока.Индексы.Добавить();
			НоваяСтрокаИндексов.ИмяИндексаХранения = Индекс.ИмяИндексаХранения;

			// Поля индекса
			Для каждого Поле ИЗ Индекс.Поля Цикл
				НоваяСтрокаПолейИндекса = НоваяСтрокаИндексов.ПоляИндекса.Добавить();
				НоваяСтрокаПолейИндекса.ИмяПоляХранения = Поле.ИмяПоляХранения;
				НоваяСтрокаПолейИндекса.ИмяПоля = Поле.ИмяПоля;
				НоваяСтрокаПолейИндекса.Метаданные = Поле.Метаданные;
			КонецЦикла;

		КонецЦикла;

	КонецЦикла;	
	
	Результат.Сортировать("Метаданные ВОЗР,ИмяТаблицы ВОЗР");
КонецПроцедуры

&НаСервере
Процедура НайтиПоИмениТаблицыХранения()

	СтруктураБазы = ПолучитьИзВременногоХранилища(АдресСтруктурыБазы);

	ИмяДляПоиска = ВРЕГ(СокрЛП(Отбор));
	Если Не ТочноеСоответствие И Лев(ИмяДляПоиска, 1) = "_" Тогда
		ИмяДляПоиска = Сред(ИмяДляПоиска, 2);
	КонецЕсли;
	НайденныеСтроки = Новый Массив();

	Если ПустаяСтрока(ИмяДляПоиска) Тогда
		Возврат;
	КонецЕсли;

	Для каждого Строка из СтруктураБазы Цикл

		Если ВключаяПоля Тогда
			Для каждого СтрокаПоле Из Строка.Поля Цикл
				Если ТочноеСоответствие Тогда
					Если ВРЕГ(СтрокаПоле.ИмяПоляХранения) = ИмяДляПоиска
							ИЛИ ВРЕГ(СтрокаПоле.ИмяПоля) = ИмяДляПоиска Тогда
						НайденныеСтроки.Добавить(Строка);
					КонецЕсли;
				Иначе

					Если Найти(ВРЕГ(СтрокаПоле.ИмяПоляХранения), ИмяДляПоиска) > 0
							ИЛИ Найти(ВРЕГ(СтрокаПоле.ИмяПоля), ИмяДляПоиска) Тогда
						НайденныеСтроки.Добавить(Строка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если ТочноеСоответствие Тогда
			Если ВРЕГ(Строка.ИмяТаблицыХранения) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.ИмяТаблицы) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Метаданные) = ИмяДляПоиска
					ИЛИ ВРЕГ(Строка.Назначение) = ИмяДляПоиска Тогда
				НайденныеСтроки.Добавить(Строка);
			КонецЕсли;
		Иначе
			Если Найти(ВРЕГ(Строка.ИмяТаблицыХранения), ИмяДляПоиска) > 0
					ИЛИ Найти(ВРЕГ(Строка.ИмяТаблицы), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Метаданные), ИмяДляПоиска)
					ИЛИ Найти(ВРЕГ(Строка.Назначение), ИмяДляПоиска) Тогда
				НайденныеСтроки.Добавить(Строка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ЗаполнитьТаблицуРезультата(НайденныеСтроки);


КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Команда)

	НайтиПоИмениТаблицыХранения();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресСтруктурыБазы = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПолучитьСтруктуру();

КонецПроцедуры

&НаКлиенте
Процедура ОтборОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора,
		ПараметрыПолученияДанных, СтандартнаяОбработка)

	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Текст);
	СтандартнаяОбработка = Ложь;
	Отбор = Текст;
	НайтиПоИмениТаблицыХранения();

КонецПроцедуры

&НаКлиенте
Procedure ВключаяПоляOnChange(Item)
	НайтиПоИмениТаблицыХранения();
EndProcedure

&НаКлиенте
Procedure ТочноеСоответствиеOnChange(Item)
	НайтиПоИмениТаблицыХранения();
EndProcedure

 
