//Модуль для быстрого доступа к процедурам для отладки


// Описание
// 
// Параметры:
// 	ОбъектОтладки - Объект типа Запрос
// Возвращаемое значение:
// СсылкаНаДанныеОтладки- Тип СправочникСсылка.УИ_ДанныеДляОтладки
// сохраненные данные отладки
// 	
Функция От(ОбъектОтладки) Экспорт
	Возврат УИ_ОбщегоНазначенияКлиентСервер.Отладить(ОбъектОтладки, Истина);
КонецФункции

// Описание
// 
// Параметры:
// 	ОбъектОтладки - Объект типа Запрос
// Возвращаемое значение:
// Адрес во временном хранилище данных для отладки
// 	
Функция ОтЗ(ОбъектОтладки) Экспорт
	Возврат УИ_ОбщегоНазначенияКлиентСервер.Отладить(ОбъектОтладки, Ложь);
КонецФункции
