
&НаКлиенте
Процедура вУправлениеДиалогом()

	Элементы.ИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

//======================================= Обработка событий ==========================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Настройки=Параметры.Настройки;

	ФрмИспользоватьАвтосохранение          	= Настройки.ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения              	= Настройки.ИнтервалАвтосохранения;
	ФрмИспользоватьБэкапЗапросов           	= Настройки.ИспользоватьБэкапЗапросов;
    ФрмИспользоватьтолькоВыделеннуюОбласть 	= Настройки.ИспользоватьТолькоВыделеннуюОбласть;
	ФрмИспользоватьСжатиеФайлов 			= Настройки.ИспользоватьСжатиеФайлов;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	вУправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)
	
	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	вУправлениеДиалогом();

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Настройки=	Новый Структура;
	Настройки.Вставить("ИспользоватьАвтосохранение",ФрмИспользоватьАвтосохранение);
	Настройки.Вставить("ИнтервалАвтосохранения",ФрмИнтервалАвтосохранения);
	Настройки.Вставить("ИспользоватьБэкапЗапросов",ФрмИспользоватьБэкапЗапросов);
	Настройки.Вставить("ИспользоватьТолькоВыделеннуюОбласть",ФрмИспользоватьтолькоВыделеннуюОбласть);
	Настройки.Вставить("ИспользоватьСжатиеФайлов",ФрмИспользоватьСжатиеФайлов);
	
		
	Закрыть(Настройки);

КонецПроцедуры
