
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_ЗагружатьВРежимеОбменДанными = истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура _ПутьКФайлуXMLПриИзменении(Элемент)
	_ПутьКФайлуXML = СокрЛП(_ПутьКФайлуXML);
КонецПроцедуры

&НаКлиенте
Процедура _ПутьКФайлуXMLОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если Не ПустаяСтрока(_ПутьКФайлуXML) Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		Оповещение = Новый ОписаниеОповещения("вПослеЧтенияФайлаXML", ЭтотОбъект, ТекстовыйДокумент);
		ТекстовыйДокумент.НачатьЧтение(Оповещение, _ПутьКФайлуXML, "UTF-8");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ПутьКФайлуXMLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОписаниеФайла = РазобратьПутьКФайлу(_ПутьКФайлуXML);

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Каталог = ОписаниеФайла.Каталог;
	ДиалогВыбораФайла.ПолноеИмяФайла = ОписаниеФайла.Имя;
	ДиалогВыбораФайла.Заголовок  = НСтр("ru = 'Файл данных XML'");
	ДиалогВыбораФайла.Фильтр     = НСтр("ru = 'Файлы данных XML (*.xml)|*.xml|Все файлы (*.*)|*.*'");
	ДиалогВыбораФайла.Расширение = "xml";

	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("вОбработатьВыборФайла", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДополнительныеСвойства

&НаКлиенте
Процедура _ДополнительныеСвойстваЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы._ДополнительныеСвойства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "Значение");

	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.Значение = ТекущиеДанные["Значение"];
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Элемент.ДоступныеТипы;
	ПараметрыОбработчика.ПараметрыФормы.Вставить("ВыборГруппИЭлементов",
		УИ_ОбщегоНазначенияКлиентСервер.ИспользованиеГруппИЭлементов(Элемент.ВыборГруппИЭлементов));
	
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура _ДополнительныеСвойстваЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы._ДополнительныеСвойства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "Значение");

	ПараметрыОбработчика.ДоступенКонтейнер = Ложь;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекущиеДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Элемент.ДоступныеТипы;

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _ЗагрузитьДанные(Команда)
	
	Если _ЗагружатьДанныеБезИспользованияФайла Тогда
		Если ПустаяСтрока(_ДанныеXML) Тогда
			ПоказатьПредупреждение( , НСтр("ru = 'Нет данных для загрузки!'"), 10);
			Возврат;
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(_ПутьКФайлуXML) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не задан файл для загрузки данных!'"), 10);
		Возврат;
	КонецЕсли;

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Режим", "Загрузка");
	ПараметрыЗакрытия.Вставить("ДанныеXML", ?(_ЗагружатьДанныеБезИспользованияФайла, _ДанныеXML, ""));
	ПараметрыЗакрытия.Вставить("ПутьКФайлуXML", _ПутьКФайлуXML);
	ПараметрыЗакрытия.Вставить("ЗагружатьДанныеБезИспользованияФайла", _ЗагружатьДанныеБезИспользованияФайла);
	ПараметрыЗакрытия.Вставить("ЗагружатьВРежимеОбменДанными", _ЗагружатьВРежимеОбменДанными);
	ПараметрыЗакрытия.Вставить("ЗагружатьВТранзакции", _ЗагружатьВТранзакции);
	ПараметрыЗакрытия.Вставить("ПродолжатьЗагрузкуПриОшибке", _ПродолжатьЗагрузкуПриОшибке);
	ПараметрыЗакрытия.Вставить("ИспользоватьДополнительныеСвойстваПриЗаписи", _ИспользоватьДополнительныеСвойстваПриЗаписи);
	ПараметрыЗакрытия.Вставить("ИспользоватьПроцедуруПередЗаписью", _ИспользоватьПроцедуруПередЗаписью);
	ПараметрыЗакрытия.Вставить("ПроцедураПередЗаписью", _ПроцедураПередЗаписью);
	ПараметрыЗакрытия.Вставить("ДополнительныеСвойства", Новый Структура);

	Если _ИспользоватьДополнительныеСвойстваПриЗаписи Тогда
		Для Каждого Элемент Из _ДополнительныеСвойства Цикл
			Попытка
				ПараметрыЗакрытия.ДополнительныеСвойства.Вставить(Элемент.Ключ, Элемент.Значение);
			Исключение
				ЗначениеСвойства = ?(ПустаяСтрока(Элемент.Ключ), "<пусто>", Элемент.Ключ);
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Неправильное значение ключа дополнительного свойства: %1'"),
					ЗначениеСвойства);
				УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РазобратьПутьКФайлу(ПутьКФайлу)
	
	ОписаниеФайла = Новый Структура("Каталог, Имя", "", "");
	Если Не ПустаяСтрока(ПутьКФайлу) Тогда
		РазделительПути = ПолучитьРазделительПути();
		Поз = СтрНайти(ПутьКФайлу, РазделительПути, НаправлениеПоиска.СКонца);
		Если Поз <> 0 Тогда
			ОписаниеФайла.Каталог = СокрЛП(Лев(ПутьКФайлу, Поз - 1));
			ОписаниеФайла.Имя = СокрЛП(Сред(ПутьКФайлу, Поз + 1));
		Иначе
			ОписаниеФайла.Имя = СокрЛП(ПутьКФайлу);
		КонецЕсли;
	КонецЕсли;

	Возврат ОписаниеФайла;
КонецФункции

&НаКлиенте
Процедура вПослеЧтенияФайлаXML(ТекстовыйДокумент = Неопределено) Экспорт
	Если ТипЗнч(ТекстовыйДокумент) = Тип("ТекстовыйДокумент") Тогда
		ТекстовыйДокумент.Показать(_ПутьКФайлуXML);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вОбработатьВыборФайла(ВыбранныеФайлы, ДопПарам = Неопределено) Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		_ПутьКФайлуXML = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
