
#Область ПрограммныйИнтерфейс

// Возвращает форму навигатора по метаданным.
//
// Параметры:
//  ОткрытьФорму - Булево - если Истина, то форма будет открыта.
//
// Возвращаемое значение:
//  УправляемаяФорма, Неопределено - форма навигатора по метаданным.
//
Функция ФормаНавигатораПоМетаданным(ОткрытьФорму = Ложь) Экспорт

ФормаНавигатора = Неопределено;
	
	// Шаг 1: Поиск существующей формы
	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл
		Для Каждого Элем Из ОткрытоеОкно.Содержимое Цикл
			
			Если ТипЗнч(Элем) <> УИ_ОбщегоНазначенияКлиентСервер.ТипУправляемойФормы() Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрЗаканчиваетсяНа(Элем.ИмяФормы, ".УИ_НавигаторПоМетаданным.Форма.Форма") Тогда
				ФормаНавигатора = Элем;
				Прервать; // Выход из внутреннего цикла
			КонецЕсли;
			
		КонецЦикла;

		Если ФормаНавигатора <> Неопределено Тогда
			Прервать; // Выход из внешнего цикла
		КонецЕсли;
	КонецЦикла;

	// Шаг 2: Если форму нужно открыть, а её нет - создаем/открываем её (без рекурсии)
	Если ОткрытьФорму И ФормаНавигатора = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиент.ОткрытьНавигаторПоКонфигурации();
		// Чтобы не плодить рекурсию, ищем форму повторно один раз
		Возврат ФормаНавигатораПоМетаданным(Ложь); 
	КонецЕсли;

	// Шаг 3: Если форма найдена и её просили открыть - проверяем состояние
	Если ОткрытьФорму И Не ФормаНавигатора.Открыта() Тогда
		Попытка
			ФормаНавигатора.Открыть();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;

	Возврат ФормаНавигатора;

КонецФункции

#КонецОбласти