
#Область ПрограммныйИнтерфейс

// Возвращает форму навигатора по метаданным.
//
// Параметры:
//  ОткрытьФорму - Булево - если Истина, то форма будет открыта.
//
// Возвращаемое значение:
//  УправляемаяФорма, Неопределено - форма навигатора по метаданным.
//

Функция ФормаНавигатораПоМетаданным(ОткрытьФорму = Ложь) Экспорт

	ФормаНавигатора = Неопределено;
	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл
		Для Каждого Элем Из ОткрытоеОкно.Содержимое Цикл
			Если ТипЗнч(Элем) = УИ_ОбщегоНазначенияКлиентСервер.ТипУправляемойФормы() Тогда
				Если СтрЗаканчиваетсяНа(Элем.ИмяФормы, ".УИ_НавигаторПоМетаданным.Форма.Форма") Тогда
					ФормаНавигатора = Элем;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Если ФормаНавигатора <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ОткрытьФорму И ФормаНавигатора <> Неопределено Тогда
		Если Не ФормаНавигатора.Открыта() Тогда
			Попытка
				ФормаНавигатора.Открыть();
			Исключение
				Возврат Неопределено;
			КонецПопытки;
		КонецЕсли;
		Возврат ФормаНавигатора;
	ИначеЕсли ОткрытьФорму И ФормаНавигатора = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиент.ОткрытьНавигаторПоКонфигурации();
		ФормаНавигатора = ФормаНавигатораПоМетаданным(ОткрытьФорму);
		Возврат ФормаНавигатора;
	Иначе
		Возврат ФормаНавигатора;
	КонецЕсли;

КонецФункции

#КонецОбласти