
#Область ПрограммныйИнтерфейс

// Возвращает форму навигатора по метаданным.
//
// Параметры:
//  ОткрытьФорму - Булево - если Истина, то форма будет открыта.
//
// Возвращаемое значение:
//  УправляемаяФорма, Неопределено - форма навигатора по метаданным.
//
Функция ФормаНавигатораПоМетаданным(ОткрытьФорму = Ложь) Экспорт

	ФормаНавигатора = НайтиОткрытуюФормуНавигатора();

	Если ОткрытьФорму И ФормаНавигатора = Неопределено Тогда
		УИ_ОбщегоНазначенияКлиент.ОткрытьНавигаторПоКонфигурации();
		Возврат ФормаНавигатораПоМетаданным(Ложь); 
	КонецЕсли;

	Если ОткрытьФорму И Не ФормаНавигатора.Открыта() Тогда
		Попытка
			ФормаНавигатора.Открыть();
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;

	Возврат ФормаНавигатора;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиОткрытуюФормуНавигатора()

	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл
		Для Каждого Элем Из ОткрытоеОкно.Содержимое Цикл
			
			Если ТипЗнч(Элем) = УИ_ОбщегоНазначенияКлиентСервер.ТипУправляемойФормы() 
				И СтрЗаканчиваетсяНа(Элем.ИмяФормы, ".УИ_НавигаторПоМетаданным.Форма.Форма") Тогда
				
				Возврат Элем;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
