
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("_ИмяФайла", _ИмяФайла);
	Параметры.Свойство("_Режим", _Режим);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура _ПутьКФайлуXMLПриИзменении(Элемент)
	_ПутьКФайлуXML = СокрЛП(_ПутьКФайлуXML);
КонецПроцедуры

&НаКлиенте
Процедура _ПутьКФайлуXMLОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если Не ПустаяСтрока(_ПутьКФайлуXML) Тогда
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		Оповещение = Новый ОписаниеОповещения("вПослеЧтенияФайлаXML", ЭтотОбъект, ТекстовыйДокумент);
		ТекстовыйДокумент.НачатьЧтение(Оповещение, _ПутьКФайлуXML, "UTF-8");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура _ПутьКФайлуXMLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ОписаниеФайла = РазобратьПутьКФайлу(_ПутьКФайлуXML);

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.Каталог = ОписаниеФайла.Каталог;
	ДиалогВыбораФайла.ПолноеИмяФайла = ОписаниеФайла.Имя;
	ДиалогВыбораФайла.Заголовок  = НСтр("ru = 'Файл данных XML'");
	ДиалогВыбораФайла.Фильтр     = НСтр("ru = 'Файлы данных XML (*.xml)|*.xml|Все файлы (*.*)|*.*'");
	ДиалогВыбораФайла.Расширение = "xml";

	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("вОбработатьВыборФайла", ЭтотОбъект));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура _ВыгрузитьДанные(Команда)
	Если Не _ВыгружатьДанныеБезИспользованияФайла И ПустаяСтрока(_ПутьКФайлуXML) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не задан файл для выгрузки данных!'"), 10);
		Возврат;
	КонецЕсли;
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Режим", _Режим);
	ПараметрЗакрытия.Вставить("ПутьКФайлуXML", _ПутьКФайлуXML);
	ПараметрЗакрытия.Вставить("ВыгружатьДанныеБезИспользованияФайла", _ВыгружатьДанныеБезИспользованияФайла);

	Закрыть(ПараметрЗакрытия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РазобратьПутьКФайлу(ПутьКФайлу)
	ОписаниеФайла = Новый Структура("Каталог, Имя", "", "");
	Если Не ПустаяСтрока(ПутьКФайлу) Тогда
		РазделительПути = ПолучитьРазделительПути();
		Поз = СтрНайти(ПутьКФайлу, РазделительПути, НаправлениеПоиска.СКонца);
		Если Поз <> 0 Тогда
			ОписаниеФайла.Каталог = СокрЛП(Лев(ПутьКФайлу, Поз - 1));
			ОписаниеФайла.Имя = СокрЛП(Сред(ПутьКФайлу, Поз + 1));
		Иначе
			ОписаниеФайла.Имя = СокрЛП(ПутьКФайлу);
		КонецЕсли;
	КонецЕсли;

	Возврат ОписаниеФайла;
КонецФункции

&НаКлиенте
Процедура вПослеЧтенияФайлаXML(ТекстовыйДокумент = Неопределено) Экспорт
	Если ТипЗнч(ТекстовыйДокумент) = Тип("ТекстовыйДокумент") Тогда
		ТекстовыйДокумент.Показать(_ПутьКФайлуXML);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура вОбработатьВыборФайла(ВыбранныеФайлы, ДопПарам = Неопределено) Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		_ПутьКФайлуXML = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
