
#Область ПрограммныйИнтерфейс

// Стандартный заголовок сгенерированного кода.
// 
// Параметры:
//  Инструмент- Строка- Инструмент
//  ИмяФайлаИнструмента - Строка -  Имя файла
//  ИмяГенерируемойЗаписи - Строка -Имя генерируемой записи
//  ДополнительныеДанные - Соответствие из КлючИЗначение:
//  	* Ключ - Строка - Имя 
//  	* Значение - Строка - 
// Возвращаемое значение:
//  Строка
Функция СтандартныйЗаголовокСгенерированногоКода(Инструмент, ИмяФайлаИнструмента = "", ИмяГенерируемойЗаписи = "",
	ДополнительныеДанные = Неопределено) Экспорт
	ТекстДополнительныхДанных ="";
	Если ДополнительныеДанные <> Неопределено Тогда
		СтрокиДляОбъединения = Новый Массив;
		Для Каждого КлючЗначение Из ДополнительныеДанные Цикл
			СтрокиДляОбъединения.Добавить(СтрШаблон("//%1 - %2", КлючЗначение.Ключ, КлючЗначение.Значение));
		КонецЦикла;

		ТекстДополнительныхДанных = СтрСоединить(СтрокиДляОбъединения, Символы.ПС);
	КонецЕсли;
	
	Возврат СтрШаблон("//Сгенерировано с помощью инструмента ""%4"" из набора ""Универсальные инструменты 1С""
					  |//https://github.com/cpr1c/tools_ui_1c
					  |//
					  |//Дата - %1
					  |//Имя файла инструмента - %2
					  |//Имя - %3
					  |//Пользователь - %5
					  |%7
					  |",
					  ТекущаяДатаСеанса(),
					  ИмяФайлаИнструмента,
					  ИмяГенерируемойЗаписи,
					  Инструмент,
					  ИмяПользователя(),
					  ТекстДополнительныхДанных);
КонецФункции

// Булево в строку кода.
// 
// Параметры:
//  Значение -Булево- Значение
// 
// Возвращаемое значение:
//  Строка
Функция БулевоВСтрокуКода(Значение) Экспорт
	Возврат Формат(Значение, "БЛ=Ложь; БИ=Истина;");
КонецФункции

// Число в строку кода.
// 
// Параметры:
//  Значение - Число -Значение
// 
// Возвращаемое значение:
//  Строка -  Число в строку кода
Функция ЧислоВСтрокуКода(Значение) Экспорт
	Возврат XMLСтрока(Значение);
КонецФункции

// Строка в строку кода.
// 
// Параметры:
//  Значение -Строка -Значение
// 
// Возвращаемое значение:
//  Строка
Функция СтрокаВСтрокуКода(Значение) Экспорт
	СтрокаДляКонфигуратора = СтрЗаменить(Значение, """", """""");
	СтрокаДляКонфигуратора = СтрЗаменить(СтрокаДляКонфигуратора, Символы.ПС, Символы.ПС+"|");
	Возврат """"+СтрокаДляКонфигуратора+"""";
КонецФункции

// Неопределено в строку кода.
// 
// Возвращаемое значение:
//  Строка -  Неопределено в строку кода
Функция НеопределеноВСтрокуКода() Экспорт
	Возврат "Неопределено";	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
