#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрефиксОкончаниеКолонокКонтейнера = "____Контейнер__";

	Если Параметры.Свойство("СериализоватьВXML") Тогда
		//@skip-check unknown-form-parameter-access
		СериализоватьВXML = Параметры.СериализоватьВXML;
	КонецЕсли;
	
	Таблица = Неопределено;
	Если Параметры.Свойство("ТаблицаЗначенийСтрокой") Тогда
		//@skip-check unknown-form-parameter-access
		Таблица = ТаблицаЗначенийИзСтроковогоПредставления(Параметры.ТаблицаЗначенийСтрокой, СериализоватьВXML);
	ИначеЕсли Параметры.Свойство("ХранилищеКонтейнераЗначения") Тогда 
		ВозвратХранилищаДляКонтейнераЗначения = Истина;
		
		//@skip-check unknown-form-parameter-access
		ХранилищеКонтейнера = Параметры.ХранилищеКонтейнераЗначения; //см. УИ_ОбщегоНазначенияКлиентСервер.НовыйХранилищеЗначенияТаблицыЗначений
		
		СериализоватьВXML = Ложь;
		Если ХранилищеКонтейнера <> Неопределено Тогда
			Таблица = УИ_ОбщегоНазначения.ЗначениеИзХранилищаКонтейнераТаблицыЗначений(ХранилищеКонтейнера);
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ХранилищеКонтейнераЗначенияДерева") Тогда 
		ВозвратХранилищаДляКонтейнераЗначения = Истина;
		ЭтоДерево = Истина;
		
		//@skip-check unknown-form-parameter-access
		ХранилищеКонтейнера = Параметры.ХранилищеКонтейнераЗначенияДерева; //см. УИ_ОбщегоНазначенияКлиентСервер.НовыйХранилищеЗначенияТаблицыЗначений
		
		СериализоватьВXML = Ложь;
		Если ХранилищеКонтейнера <> Неопределено Тогда
			Таблица = УИ_ОбщегоНазначения.ЗначениеИзХранилищаКонтейнераДереваЗначений(ХранилищеКонтейнера);
		КонецЕсли;
	КонецЕсли;

	Если Таблица = Неопределено Тогда
		Если ЭтоДерево Тогда
			Таблица = Новый ДеревоЗначений;
		Иначе
			Таблица = Новый ТаблицаЗначений;
		КонецЕсли;
	КонецЕсли;
	Если ЭтоДерево Тогда
		Заголовок = "Редактор дерева значения";
	Иначе
		Заголовок = "Редактор таблицы значения";
	КонецЕсли;
	ДобавитьКорневойЭлементИРеквизитТаблицы();	

	ЗаполнитьКолонкиТаблицыЗначений(Таблица);
	СоздатьКолонкиТаблицыЗначенийФормы();
	Если ЭтоДерево Тогда
		ЗаполнитьДеревоЗначенийФормыПоДереву(Таблица);
	Иначе
		ЗаполнитьТаблицуЗначенийФормыПоТаблице(Таблица);
	КонецЕсли;
	
	Если КолонкиТаблицы.Количество() = 0 Тогда
		Элементы.ГруппаКолонкиТаблицы.Показать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиТаблицы

&НаКлиенте
Процедура КолонкиТаблицыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы.КолонкиТаблицы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = ТекДанные.Имя;

	Если Не УИ_ОбщегоНазначенияКлиентСервер.ИмяПеременнойКорректно(ИмяКолонки) Тогда
		ПоказатьПредупреждение( ,
			УИ_ОбщегоНазначенияКлиентСервер.ТекстПредупрежденияОНерпавильномИмениПеременной(),
			, Заголовок);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	СтрокиИмени = КолонкиТаблицы.НайтиСтроки(Новый Структура("Имя", ИмяКолонки));
	Если СтрокиИмени.Количество() > 1 Тогда
		ПоказатьПредупреждение( , "Колонка с таким именем уже есть! Введите другое имя.", , Заголовок);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТаблицыТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.КолонкиТаблицы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.КолонкиТаблицы.ТекущаяСтрока;
	ДополнительныеПараметры = Новый Структура("ТекСтрока", ТекСтрока);
	Оповещение = Новый ОписаниеОповещения("КолонкиТаблицыТипЗначенияНачалоВыбораЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  "ТипЗначения");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.Значение = ТекДанные.ТипЗначения;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.НаборТипов = УИ_ОбщегоНазначенияКлиентСервер.ВсеНаборыТиповДляРедактирования();
	ПараметрыОбработчика.ОповещениеОЗавершении = Оповещение;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Новый ОписаниеТипов("ОписаниеТипов");

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);



КонецПроцедуры

&НаКлиенте
Процедура КолонкиТаблицыПослеУдаления(Элемент)
	СоздатьКолонкиТаблицыЗначенийФормы();
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТаблицыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.КолонкиТаблицы.ТекущиеДанные;
	ТекДанные.ИмяДляПоиска = НРег(ТекДанные.Имя);

	Элементы.ТаблицаЗначений.Доступность = Ложь;
	ПодключитьОбработчикОжидания("СоздатьКолонкиТаблицыЗначенийФормыОбработчикОжидания", 0.1, Истина);
КонецПроцедуры


&НаКлиенте
Процедура КолонкиТаблицыТипЗначенияОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.КолонкиТаблицы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 "ТипЗначения");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Новый ОписаниеТипов("ОписаниеТипов");

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КолонкиТаблицыТипЗначенияПриИзменении(Элемент)
	ТекДанные = Элементы.КолонкиТаблицы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияПриИзменении(ЭтотОбъект,
																								  Элемент,
																								  "ТипЗначения");
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = Новый ОписаниеТипов("ОписаниеТипов");

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикПриИзменении(ПараметрыОбработчика);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗначений

&НаКлиенте 
Процедура Подключаемый_ПолеТаблицыЗначенийПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаЗначений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;
	
	СтрокаКолонкиТаблицы = СтрокаКолонкиТаблицы(КолонкиТаблицы, Сред(НРег(Элемент.Имя), СтрДлина("таблицазначений")+1));
	Если СтрокаКолонкиТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  СтрокаКолонкиТаблицы.Имя);
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.Значение = ТекДанные[СтрокаКолонкиТаблицы.Имя];
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.НаборТипов = УИ_ОбщегоНазначенияКлиентСервер.ВсеНаборыТиповДляРедактирования();
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = ХранилищеОписанияТиповСтрокиКолонки(СтрокаКолонкиТаблицы);

	ЗаполнитьЗначенияСвойств(ПараметрыОбработчика, СтруктураХраненияКолонкиТаблицыНаФорме(СтрокаКолонкиТаблицы.Имя));

	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикПриИзменении(ПараметрыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеТаблицыЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаЗначений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;

	СтрокаКолонкиТаблицы = СтрокаКолонкиТаблицы(КолонкиТаблицы, Сред(НРег(Элемент.Имя), СтрДлина("таблицазначений")+1));
	Если СтрокаКолонкиТаблицы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияНачалоВыбораЗначения(ЭтотОбъект,
																										  Элемент,
																										  СтрокаКолонкиТаблицы.Имя);
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.Значение = ТекДанные[СтрокаКолонкиТаблицы.Имя];
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.НаборТипов = УИ_ОбщегоНазначенияКлиентСервер.ВсеНаборыТиповДляРедактирования();
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = ХранилищеОписанияТиповСтрокиКолонки(СтрокаКолонкиТаблицы);

	ЗаполнитьЗначенияСвойств(ПараметрыОбработчика, СтруктураХраненияКолонкиТаблицыНаФорме(СтрокаКолонкиТаблицы.Имя));
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикНачалоВыбораЗначения(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеТаблицыЗначенийОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаЗначений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаКолонкиТаблицы = СтрокаКолонкиТаблицы(КолонкиТаблицы, Сред(НРег(Элемент.Имя), СтрДлина("таблицазначений")+1));
	Если СтрокаКолонкиТаблицы = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	ПараметрыОбработчика = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыОбработчикаСобытияОчистка(ЭтотОбъект,
																							 Элемент,
																							 СтрокаКолонкиТаблицы.Имя);
	ПараметрыОбработчика.ДоступенКонтейнер = Истина;
	ПараметрыОбработчика.СтруктураХраненияЗначения = ТекДанные;
	ПараметрыОбработчика.ТекущееОписаниеТиповЗначения = ХранилищеОписанияТиповСтрокиКолонки(СтрокаКолонкиТаблицы);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОбработчика, СтруктураХраненияКолонкиТаблицыНаФорме(СтрокаКолонкиТаблицы.Имя));
	
	УИ_ОбщегоНазначенияКлиент.ПолеФормыОбработчикОчистка(ПараметрыОбработчика, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ЭтоДерево Тогда
		ТекДанные = Элемент.ТекущиеДанные();
		Если ТекДанные = Неопределено Тогда
			НоваяСтрока = ТекДанные.ПолучитьЭлементы().Добавить();
		Иначе
			НоваяСтрока = ЭтотОбъект[ИмяРеквизитаХранилища].ПолучитьЭлементы().Добавить();
		КонецЕсли;
	Иначе
		НоваяСтрока = ЭтотОбъект[ИмяРеквизитаХранилища].Добавить();
	КонецЕсли;
	
	Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаЗначенийПередНачаломДобавленияНаСервере(Элемент.ТекущаяСтрока);
	
	Элемент.ИзменитьСтроку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Применить(Команда)
	Если ЭтоДерево Тогда
		СтруктураРезультата=РезультатДеревоЗначенийВХранилище();
	Иначе
		СтруктураРезультата=РезультатТаблицаЗначенийВСтроку();
	КонецЕсли;
	
	Закрыть(СтруктураРезультата);	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КолонкиТаблицы

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураХраненияТипЗначенияКолонки() 
	Возврат УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером("ТипЗначения");
КонецФункции

// Строка колонки таблицы.
// 
// Параметры:
//  Колонки - ДанныеФормыКоллекция: см. ОбщаяФорма.УИ_РедакторТаблицыЗначений.КолонкиТаблицы
//  Имя - Строка - Имя
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции: см. ОбщаяФорма.УИ_РедакторТаблицыЗначений.КолонкиТаблицы
&НаКлиентеНаСервереБезКонтекста
Функция СтрокаКолонкиТаблицы(Колонки, Имя)
	Поиск = Новый Структура;
	Поиск.Вставить("ИмяДляПоиска", НРег(Имя));
	
	НайденныеСтроки = Колонки.НайтиСтроки(Поиск);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденныеСтроки[0];
	КонецЕсли;
КонецФункции

// Заполнить колонки таблицы значений.
// 
// Параметры:
//  Таблица - ТаблицаЗначений, ДеревоЗначений - Таблица
&НаСервере
Процедура ЗаполнитьКолонкиТаблицыЗначений(Таблица)
	СтруктураХраненияТипЗначения = СтруктураХраненияТипЗначенияКолонки();
	КолонкиТаблицы.Очистить();

	Для Каждого Колонка Из Таблица.Колонки Цикл
		НС=КолонкиТаблицы.Добавить();
		НС.Имя=Колонка.Имя;
		НС.ИмяДляПоиска = НРег(Колонка.Имя);

		УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(НС,
																		   СтруктураХраненияТипЗначения,
																		   Колонка.ТипЗначения);
		НС.Квалификаторы = УИ_ОбщегоНазначенияКлиентСервер.ПредставлениеМодификаторовТипа(Колонка.ТипЗначения);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКолонкиТаблицыЗначенийФормыОбработчикОжидания()
	СоздатьКолонкиТаблицыЗначенийФормы();
	Элементы.ТаблицаЗначений.Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция ИмяВспомогательнойКолонкиТаблицы(ИмяПоля, Суффикс)
	Возврат ПрефиксОкончаниеКолонокКонтейнера + ИмяПоля + Суффикс + ПрефиксОкончаниеКолонокКонтейнера;
КонецФункции

// Структура хранения колонки таблицы на форме.
// 
// Параметры:
//  ИмяКолонки - Строка - Имя колонки
// 
// Возвращаемое значение:
//  см. УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером
&НаСервере
Функция СтруктураХраненияКолонкиТаблицыНаФорме(ИмяКолонки)
	СтруктураХранения = УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером(ИмяКолонки);
	СтруктураХранения.ИмяПоляКонтейнера = ИмяВспомогательнойКолонкиТаблицы(ИмяКолонки,
																		   УИ_ОбщегоНазначенияКлиентСервер.СуффиксИмениПоляХраненияКонтейнераДляПоляСКонтейнером());
	СтруктураХранения.ИмяПоляТипаЗначения = ИмяВспомогательнойКолонкиТаблицы(ИмяКолонки,
																			 УИ_ОбщегоНазначенияКлиентСервер.СуффиксИмениПоляХраненияТипаЗначенияДляПоляСКонтейнером());
	СтруктураХранения.ИмяПоляПредставленияТипаЗначения = ИмяВспомогательнойКолонкиТаблицы(ИмяКолонки,
																						  УИ_ОбщегоНазначенияКлиентСервер.СуффиксИмениПоляХраненияПредставленияТипаЗначенияДляПоляСКонтейнером());

	Возврат СтруктураХранения;
КонецФункции

// Описание колонки таблицы.
// 
// Параметры:
//  СтрокаКолонки - ДанныеФормыЭлементКоллекции: см. ОбщаяФорма.УИ_РедакторТаблицыЗначений.КолонкиТаблицы
//  СтруктураХраненияКолонкиТип - см. УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером
// 
// Возвращаемое значение:
//  Структура - Описание колонки таблицы:
// * СтруктураХранения - см. СтруктураХраненияКолонкиТаблицыНаФорме 
// * Тип - ОписаниеТипов -
// * Имя - Строка -
// * Заголовок - Строка -
&НаСервере
Функция ОписаниеКолонкиТаблицы(СтрокаКолонки, СтруктураХраненияКолонкиТип)
	Данные = Новый Структура;
	Данные.Вставить("Имя", СтрокаКолонки.Имя);
	Данные.Вставить("Заголовок", "");
	Данные.Вставить("СтруктураХранения", СтруктураХраненияКолонкиТаблицыНаФорме(СтрокаКолонки.Имя));

	ОписаниеТипаКолонки =  УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(СтрокаКолонки,
																							СтруктураХраненияКолонкиТип);//ОписаниеТипов
	Если ОписаниеТипаКолонки = Неопределено Тогда
		ОписаниеТипаКолонки = Новый ОписаниеТипов;
	КонецЕсли;
	Данные.Вставить("Тип", ОписаниеТипаКолонки);

	//@skip-check constructor-function-return-section
	Возврат Данные;
КонецФункции

// Описания колонок таблицы.
// 
// Возвращаемое значение:
//  Структура из КлючИЗначение - Описания колонок таблицы
&НаСервере
Функция ОписанияКолонокТаблицы()
	СтруктураХраненияКолонкиТип = СтруктураХраненияТипЗначенияКолонки();

	Колонки = Новый Структура;

	Для Каждого ТекСтрокаКолонки Из КолонкиТаблицы Цикл
		Колонки.Вставить(ТекСтрокаКолонки.Имя, ОписаниеКолонкиТаблицы(ТекСтрокаКолонки, СтруктураХраненияКолонкиТип));
	КонецЦикла;

	Возврат Колонки;
КонецФункции

&НаКлиенте
Процедура КолонкиТаблицыТипЗначенияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	КолонкиТаблицыТипЗначенияНачалоВыбораЗавершениеНаСервере(ДополнительныеПараметры.ТекСтрока);
КонецПроцедуры

&НаСервере
Процедура КолонкиТаблицыТипЗначенияНачалоВыбораЗавершениеНаСервере(ИдентификаторСтроки) 

	ТекДанные=КолонкиТаблицы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьМодификаторыТипаВСтрокеКолонки(ТекДанные);
	
КонецПроцедуры

// Заполнить модификаторы типа в строке колонки.
// 
// Параметры:
//  СтрокаКолонки - ДанныеФормыЭлементКоллекции: см. ОбщаяФорма.УИ_РедакторТаблицыЗначений.КолонкиТаблицы
//  СтруктураХраненияКолонкиТип - см. УИ_ОбщегоНазначенияКлиентСервер.НовыйСтруктураХраненияРеквизитаНаФормеСКонейнером
&НаСервере
Процедура ЗаполнитьМодификаторыТипаВСтрокеКолонки(СтрокаКолонки, СтруктураХраненияКолонкиТип = Неопределено)
	СтруктураХраненияТипа = СтруктураХраненияКолонкиТип;
	Если СтруктураХраненияТипа = Неопределено Тогда
		СтруктураХраненияТипа = СтруктураХраненияТипЗначенияКолонки();
	КонецЕсли;
	ОписаниеКолонки = ОписаниеКолонкиТаблицы(СтрокаКолонки, СтруктураХраненияТипа);
	СтрокаКолонки.Квалификаторы= УИ_ОбщегоНазначенияКлиентСервер.ПредставлениеМодификаторовТипа(ОписаниеКолонки.Тип);

КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиТаблицыЗначенийФормы(ТекущаяСтрокаКолонки = Неопределено)
	МассивУдаляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	МассивТекущихКолонокТаблицы = ПолучитьРеквизиты(ИмяРеквизитаХранилища);
	
	УжеСозданныеКолонки=Новый Структура;

	Для Каждого ТекРеквизит Из МассивТекущихКолонокТаблицы Цикл
		МассивУдаляемыхРеквизитов.Добавить(ИмяРеквизитаХранилища + "." + НРег(ТекРеквизит.Имя));
		Если СтрНачинаетсяС(ТекРеквизит.Имя, ПрефиксОкончаниеКолонокКонтейнера) И СтрЗаканчиваетсяНа(ТекРеквизит.Имя,
																									 ПрефиксОкончаниеКолонокКонтейнера) Тогда
			Продолжить;
		КонецЕсли;
		УжеСозданныеКолонки.Вставить(ТекРеквизит.Имя, ТекРеквизит);

	КонецЦикла;
	
	ОписанияКолонок = ОписанияКолонокТаблицы();
	
	Для Каждого ТекКолонка Из КолонкиТаблицы Цикл
		ОписаниеКолонки = ОписанияКолонок[ТекКолонка.Имя];//см. ОписаниеКолонкиТаблицы
		СтруктураХранения = ОписаниеКолонки.СтруктураХранения;
		

		Если УжеСозданныеКолонки.Свойство(ТекКолонка.Имя) Тогда
			УдалитьЗначениеИзМассива(МассивУдаляемыхРеквизитов, ИмяРеквизитаХранилища
																+ "."
																+ НРег(СтруктураХранения.ИмяПоляВСтруктуре));
			УдалитьЗначениеИзМассива(МассивУдаляемыхРеквизитов, ИмяРеквизитаХранилища
																+ "."
																+ НРег(СтруктураХранения.ИмяПоляКонтейнера));
			УдалитьЗначениеИзМассива(МассивУдаляемыхРеквизитов, ИмяРеквизитаХранилища
																+ "."
																+ НРег(СтруктураХранения.ИмяПоляТипаЗначения));
			УдалитьЗначениеИзМассива(МассивУдаляемыхРеквизитов, ИмяРеквизитаХранилища
																+ "."
																+ НРег(СтруктураХранения.ИмяПоляПредставленияТипаЗначения));

		Иначе
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СтруктураХранения.ИмяПоляВСтруктуре,
				Новый ОписаниеТипов, ИмяРеквизитаХранилища, , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СтруктураХранения.ИмяПоляКонтейнера,
				Новый ОписаниеТипов, ИмяРеквизитаХранилища, , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СтруктураХранения.ИмяПоляТипаЗначения,
				Новый ОписаниеТипов("ОписаниеТипов"), ИмяРеквизитаХранилища, , Истина));
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СтруктураХранения.ИмяПоляПредставленияТипаЗначения,
				УИ_ОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(0), ИмяРеквизитаХранилища, , Истина));

		КонецЕсли;
	КонецЦикла;
	
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);

	Для Каждого ТекКолонка Из КолонкиТаблицы Цикл
		ОписаниеКолонки = ОписанияКолонок[ТекКолонка.Имя];//см. ОписаниеКолонкиТаблицы
		
		ОписаниеЭлемента=УИ_РаботаСФормами.НовыйОписаниеРеквизитаЭлемента();
		ОписаниеЭлемента.Вставить("Имя", ТекКолонка.Имя);
		ОписаниеЭлемента.Вставить("ПутьКДанным", ИмяРеквизитаХранилища+"." + ТекКолонка.Имя);
		ОписаниеЭлемента.Вставить("РодительЭлемента", Элементы.ТаблицаЗначений);

		ОписаниеЭлемента.Действия.Вставить("ПриИзменении", "Подключаемый_ПолеТаблицыЗначенийПриИзменении");
		ОписаниеЭлемента.Действия.Вставить("НачалоВыбора", "Подключаемый_ПолеТаблицыЗначенийНачалоВыбора");
		ОписаниеЭлемента.Действия.Вставить("Очистка", "Подключаемый_ПолеТаблицыЗначенийОчистка");

		ЭлементНовый = УИ_РаботаСФормами.СоздатьЭлементПоОписанию(ЭтотОбъект, ОписаниеЭлемента);
		ЭлементНовый.ВыбиратьТип = Ложь;
		ЭлементНовый.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
//		ЭлементНовый.ОграничениеТипа = ОписаниеКолонки.Тип;
		ЭлементНовый.КнопкаВыбора = Истина;
		ЭлементНовый.КнопкаОчистки = Истина;
		ЭлементНовый.СвязьПоТипу = Новый СвязьПоТипу(СтрШаблон("Элементы.%1.ТекущиеДанные.%2",
															   ИмяРеквизитаХранилища,
															   ОписаниеКолонки.СтруктураХранения.ИмяПоляТипаЗначения));

	КонецЦикла;
	
	Если ЭтоДерево Тогда
		ПривестиЗначенияКолонокТаблицыКТипамКолонок(ЭтотОбъект[ИмяРеквизитаХранилища].ПолучитьЭлементы(),
													ОписанияКолонок);
	Иначе
		ПривестиЗначенияКолонокТаблицыКТипамКолонок(ЭтотОбъект[ИмяРеквизитаХранилища], ОписанияКолонок);
	КонецЕсли;
КонецПроцедуры

// Хранилище описания типов строки параметра.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыЭлементКоллекции: см. Обработка.УИ_КонсольЗапросов.Форма.Форма.ПараметрыЗапроса
// 
// Возвращаемое значение:
//  см. УИ_ОбщегоНазначенияКлиентСервер.НовыйХранилищеЗначенияТипа
// Возвращаемое значение:
// 	Неопределено
&НаКлиентеНаСервереБезКонтекста
Функция ХранилищеОписанияТиповСтрокиКолонки(ДанныеСтроки)
	СтруктураХранения = СтруктураХраненияТипЗначенияКолонки();
	ДанныеПоляВСтруктуре = УИ_ОбщегоНазначенияКлиентСервер.СтруктураЗначенияПоДаннымФормыПоляСКонтейнером(ДанныеСтроки,
																										  СтруктураХранения);
	Если ДанныеПоляВСтруктуре.Контейнер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ДанныеПоляВСтруктуре.Контейнер.Хранилище;
КонецФункции

#КонецОбласти

#Область Таблица

&НаСервере
Процедура ПривестиЗначенияКолонокТаблицыКТипамКолонокВСтрокеКоллекции(СтрокаКоллекции, ОписанияКолонок,
	ИменаКолонок = Неопределено)
	Для Каждого КлючЗначение Из ОписанияКолонок Цикл
		ОписаниеКолонки = КлючЗначение.Значение;//см. ОписаниеКолонкиТаблицы

		ЗначениеПоля = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(СтрокаКоллекции,
																						ОписаниеКолонки.СтруктураХранения);
		НовоеЗначениеПоля = ОписаниеКолонки.Тип.ПривестиЗначение(ЗначениеПоля);

		Если ЗначениеПоля <> НовоеЗначениеПоля Или ТипЗнч(ЗначениеПоля) <> ТипЗнч(НовоеЗначениеПоля) Тогда
			УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(СтрокаКоллекции,
																			   ОписаниеКолонки.СтруктураХранения,
																			   НовоеЗначениеПоля);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПривестиЗначенияКолонокТаблицыКТипамКолонок(КоллекцияДляОбхода, ОписанияКолонок, ИменаКолонок = Неопределено)
	Для Каждого СтрокаТЗ Из КоллекцияДляОбхода Цикл
		ПривестиЗначенияКолонокТаблицыКТипамКолонокВСтрокеКоллекции(СтрокаТЗ, ОписанияКолонок, ИменаКолонок);

		Если ЭтоДерево Тогда
			ПривестиЗначенияКолонокТаблицыКТипамКолонок(СтрокаТЗ.ПолучитьЭлементы(), ОписанияКолонок, ИменаКолонок);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ТаблицаЗначенийПередНачаломДобавленияНаСервере(ИдентификаторСтроки)
	СтрокаКоллекции = ЭтотОбъект[ИмяРеквизитаХранилища].НайтиПоИдентификатору(ИдентификаторСтроки);
	ПривестиЗначенияКолонокТаблицыКТипамКолонокВСтрокеКоллекции(СтрокаКоллекции, ОписанияКолонокТаблицы());
КонецПроцедуры

&НаСервере
Процедура ДобавитьКорневойЭлементИРеквизитТаблицы()
	ИмяРеквизитаХранилища = "ТаблицаЗначений";
	МассивДобавляемыхРеквизитов = Новый Массив;

	Если ЭтоДерево Тогда
		ТипРеквизита = Новый ОписаниеТипов("ДеревоЗначений");
	Иначе
		ТипРеквизита = Новый ОписаниеТипов("ТаблицаЗначений");
	КонецЕсли;

	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаХранилища, ТипРеквизита, "", "", Истина));
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	ОписаниеЭлемента=УИ_РаботаСФормами.НовыйОписаниеРеквизитаЭлемента();
	ОписаниеЭлемента.Вставить("Имя", ИмяРеквизитаХранилища);
	ОписаниеЭлемента.Вставить("ПутьКДанным", ИмяРеквизитаХранилища);
	ОписаниеЭлемента.Параметры.Тип = Тип("ТаблицаФормы");
	ОписаниеЭлемента.Параметры.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	Если ЭтоДерево Тогда
		ОписаниеЭлемента.Параметры.Вставить("Отображение", ОтображениеТаблицы.Дерево);
	КонецЕсли;
	ОписаниеЭлемента.Действия.Вставить("ПередНачаломДобавления",
									   "Подключаемый_ТаблицаЗначенийПередНачаломДобавления");

	УИ_РаботаСФормами.СоздатьЭлементПоОписанию(ЭтотОбъект, ОписаниеЭлемента);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийФормыПоТаблице(ТаблицаИсточник)
	ТаблицаЗначений = ЭтотОбъект[ИмяРеквизитаХранилища];
	ТаблицаЗначений.Очистить();

	ОписанияКолонок = ОписанияКолонокТаблицы();

	Для Каждого Стр Из ТаблицаИсточник Цикл
		НС=ТаблицаЗначений.Добавить();

		Для Каждого СтрокаКолонки Из КолонкиТаблицы Цикл
			ОписаниеКолонки = ОписанияКолонок[СтрокаКолонки.Имя];//см. ОписаниеКолонкиТаблицы
			
			УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(НС,
																			   ОписаниеКолонки.СтруктураХранения,
																			   Стр[СтрокаКолонки.Имя]);
		КонецЦикла;
		
		//ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗначенийФормыПоДереву(ДеревоИсточник)
	ДеревоЗначений = ЭтотОбъект[ИмяРеквизитаХранилища]; //ДанныеФормыДерево
	ДеревоЗначений.ПолучитьЭлементы().Очистить();

	ОписанияКолонок = ОписанияКолонокТаблицы();

	ЗаполнитьУровеньДереваФормыПоДеревуИсточнику(ДеревоЗначений, ДеревоИсточник, ОписанияКолонок);

КонецПроцедуры

// Заполнить уровень дерева формы по дереву источнику.
// 
// Параметры:
//  СтрокаДереваФорма -ДанныеФормыДерево, ДанныеФормыЭлементДерева - Строка дерева форма
//  СтрокаДереваИсточника -ДеревоЗначений, СтрокаДереваЗначений-Строка дерева источника
//  ОписанияКолонок - см. ОписанияКолонокТаблицы
&НаСервере
Процедура ЗаполнитьУровеньДереваФормыПоДеревуИсточнику(СтрокаДереваФорма, СтрокаДереваИсточника, ОписанияКолонок)

	ЭлементыДереваФормы = СтрокаДереваФорма.ПолучитьЭлементы();

	Для Каждого Стр Из СтрокаДереваИсточника.Строки Цикл
		НС=ЭлементыДереваФормы.Добавить();

		Для Каждого КлючЗначение Из ОписанияКолонок Цикл
			ИмяКолонки = КлючЗначение.Ключ;
			ТекОписание = КлючЗначение.Значение;//см. ОписаниеКолонкиТаблицы
			УИ_ОбщегоНазначенияКлиентСервер.УстановитьЗначениеПоляСКонтейнером(НС,
																			   ТекОписание.СтруктураХранения,
																			   Стр[ИмяКолонки]);
		КонецЦикла;

		ЗаполнитьУровеньДереваФормыПоДеревуИсточнику(НС, Стр, ОписанияКолонок);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Таблица значений из строкового представления.
// 
// Параметры:
//  СтроковоеПредставлениеТаблицы -Строка-Строковое представление таблицы
//  СериализоватьвXML - Булево - Сериализоватьв XML
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений из строкового представления
&НаСервереБезКонтекста
Функция ТаблицаЗначенийИзСтроковогоПредставления(СтроковоеПредставлениеТаблицы, СериализоватьвXML)

	Если СериализоватьВXML Тогда
		Попытка
			Таблица=УИ_ОбщегоНазначения.ЗначениеИзСтрокиXML(СтроковоеПредставлениеТаблицы);
		Исключение
			Таблица=Новый ТаблицаЗначений;
		КонецПопытки;
	Иначе
		Попытка
			Таблица=ЗначениеИзСтрокиВнутр(СтроковоеПредставлениеТаблицы);
		Исключение
			Таблица=Новый ТаблицаЗначений;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Таблица;

КонецФункции

// Прочитать строку дерева формы в дерево результата.
// 
// Параметры:
//  СтрокаДереваФормы - ДанныеФормыДерево, ДанныеФормыЭлементДерева- Строка дерева формы
//  СтрокаДереваРезультата - ДеревоЗначений, СтрокаДереваЗначений -  Строка дерева результата
//  ОписанияКолонок - см. ОписанияКолонокТаблицы
&НаСервере
Процедура ПрочитатьСтрокуДереваФормыВДеревоРезультата(СтрокаДереваФормы, СтрокаДереваРезультата, ОписанияКолонок)

	Для Каждого СтрокаТаблицыФормы Из СтрокаДереваФормы.ПолучитьЭлементы() Цикл
		НоваяСтрока = СтрокаДереваРезультата.Строки.Добавить();

		Для Каждого КлючЗначение Из ОписанияКолонок Цикл
			ОписаниеКолонки = КлючЗначение.Значение;//см. ОписаниеКолонкиТаблицы

			НоваяСтрока[КлючЗначение.Ключ] = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(СтрокаТаблицыФормы,
																											  ОписаниеКолонки.СтруктураХранения);
		КонецЦикла;

		ПрочитатьСтрокуДереваФормыВДеревоРезультата(СтрокаТаблицыФормы, НоваяСтрока, ОписанияКолонок);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция РезультатДеревоЗначенийВХранилище()
	ДеревоРезультата = Новый ДеревоЗначений();

	ОписанияКолонок = ОписанияКолонокТаблицы();

	ПрочитатьСтрокуДереваФормыВДеревоРезультата(ЭтотОбъект[ИмяРеквизитаХранилища],
												ДеревоРезультата,
												ОписанияКолонок);
												
	Если ВозвратХранилищаДляКонтейнераЗначения Тогда
		Возврат УИ_ОбщегоНазначения.ЗначениеХранилищаКонтейнераДереваЗначений(ДеревоРезультата);	
	Иначе

		СтруктураРезультата=Новый Структура;
		Если СериализоватьВXML Тогда
			СтруктураРезультата.Вставить("Значение", УИ_ОбщегоНазначения.ЗначениеВСтрокуXML(ДеревоРезультата));
		Иначе
			СтруктураРезультата.Вставить("Значение", ЗначениеВСтрокуВнутр(ДеревоРезультата));
		КонецЕсли;
		СтруктураРезультата.Вставить("Представление", СтрШаблон("Строк: %1 Колонок: %2",
																ДеревоРезультата.Строки.Количество(),
																ДеревоРезультата.Колонки.Количество()));
		СтруктураРезультата.Вставить("КоличествоСтрок", ДеревоРезультата.Строки.Количество());
		СтруктураРезультата.Вставить("КоличествоКолонок", ДеревоРезультата.Колонки.Количество());
		Возврат СтруктураРезультата;
	КонецЕсли;
	
КонецФункции

// Результат таблица значений в строку.
// 
// Возвращаемое значение:
//  Структура - Результат таблица значений в строку:
// * Значение - Строка - 
// * Представление - Строка - 
// * КоличествоСтрок - Число - 
// * КоличествоКолонок - Число - 
&НаСервере
Функция РезультатТаблицаЗначенийВСтроку()
	ТаблицаРезультата = Новый ТаблицаЗначений;

	СтруктураСтруктурХраненияПоляПоИменам = Новый Структура;

	Для Каждого ТекСтрокаКолонки Из КолонкиТаблицы Цикл
		ТаблицаРезультата.Колонки.Добавить(ТекСтрокаКолонки.Имя, ТекСтрокаКолонки.ТипЗначения);

		СтруктураСтруктурХраненияПоляПоИменам.Вставить(ТекСтрокаКолонки.Имя,
													   СтруктураХраненияКолонкиТаблицыНаФорме(ТекСтрокаКолонки.Имя));
	КонецЦикла;

	Для Каждого СтрокаТаблицыФормы Из ЭтотОбъект[ИмяРеквизитаХранилища] Цикл
		НоваяСтрока = ТаблицаРезультата.Добавить();

		Для Каждого ТекСтрокаКолонки Из КолонкиТаблицы Цикл
			НоваяСтрока[ТекСтрокаКолонки.Имя] = УИ_ОбщегоНазначенияКлиентСервер.ЗначениеПоляСКонтейнеромЗначения(СтрокаТаблицыФормы,
																												 СтруктураСтруктурХраненияПоляПоИменам[ТекСтрокаКолонки.Имя]);
		КонецЦикла;
	КонецЦикла;
	
	Если ВозвратХранилищаДляКонтейнераЗначения Тогда
		Возврат УИ_ОбщегоНазначения.ЗначениеХранилищаКонтейнераТаблицыЗначений(ТаблицаРезультата);	
	Иначе

		СтруктураРезультата=Новый Структура;
		Если СериализоватьВXML Тогда
			СтруктураРезультата.Вставить("Значение", УИ_ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаРезультата));
		Иначе
			СтруктураРезультата.Вставить("Значение", ЗначениеВСтрокуВнутр(ТаблицаРезультата));
		КонецЕсли;
		СтруктураРезультата.Вставить("Представление", СтрШаблон("Строк: %1 Колонок: %2",
																ТаблицаРезультата.Количество(),
																ТаблицаРезультата.Колонки.Количество()));
		СтруктураРезультата.Вставить("КоличествоСтрок", ТаблицаРезультата.Количество());
		СтруктураРезультата.Вставить("КоличествоКолонок", ТаблицаРезультата.Колонки.Количество());
		Возврат СтруктураРезультата;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьЗначениеИзМассива(Массив, Значение)
	Индекс = Массив.Найти(Значение);
	Если Индекс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Массив.Удалить(Индекс);
КонецПроцедуры

#КонецОбласти