#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаЗапроса = Параметры.СтрокаЗапроса;
	СтрокаИстории = Параметры.СтрокаИстории;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекСтрокаЗапроса = ВладелецФормы.ДеревоЗапросов.НайтиПоИдентификатору(СтрокаЗапроса);
	Если ТекСтрокаЗапроса = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ТекСтрокаИстории = ТекСтрокаЗапроса.ИсторияЗапросов.НайтиПоИдентификатору(СтрокаИстории);
	Если ТекСтрокаИстории = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекСтрокаИстории,, "Куки");
	Если ЭтоАдресВременногоХранилища(АдресТелаОтветаСтрокой) Тогда
		ТелоОтветаСтрока = ПолучитьИзВременногоХранилища(АдресТелаОтветаСтрокой);
	КонецЕсли;

	Для Каждого СтрокаКуки Из ТекСтрокаИстории.Куки Цикл
		НоваяСтрока = Куки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКуки);
	КонецЦикла;

	ЗаголовокНастройкиПроксиАнализаЗапроса = ЗаголовокНастроекПроксиПоПараметрам();

	Заголовок = СтрШаблон("%1, %2, %3", Дата, HTTPФункция, URLЗапроса);;

	Если ВидТелаЗапроса = "БезТела" Тогда
		ТекСтраница = Элементы.ГруппаИсторияЗапросовТелоЗапросаСтраницаБезТела;
	ИначеЕсли ВидТелаЗапроса = "Строка" Тогда
		ТекСтраница = Элементы.ГруппаИсторияЗапросовТелоЗапросаСтраницаСтрока;
	ИначеЕсли ВидТелаЗапроса = "ДвоичныеДанные" Или ВидТелаЗапроса = "МультипартФорм" Тогда
		ТекСтраница = Элементы.ГруппаИсторияЗапросовТелоЗапросаСтраницаДвоичныеДанные;
	Иначе
		ТекСтраница = Элементы.ГруппаИсторияЗапросовТелоЗапросаСтраницаФайл;
	КонецЕсли;
	Элементы.ГруппаИсторияЗапросовТелоЗапросаСтраницы.ТекущаяСтраница = ТекСтраница;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьТелоОтветаВРедактореJSONАнализируемогоЗапроса(Команда)
	УИ_ОбщегоНазначенияКлиент.РедактироватьJSON(ТелоОтветаСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТелоОтветаДвоичныеДанныеВФайл(Команда)
	Если Не ЭтоАдресВременногоХранилища(ТелоОтветаАдресДвоичныхДанных) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыСохранения = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыСохраненияФайла();
	ПараметрыСохранения.АдресФайлаВоВременномХранилище = ТелоОтветаАдресДвоичныхДанных;

	УИ_ОбщегоНазначенияКлиент.НачатьСохранениеФайла(ПараметрыСохранения);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТелоЗапросаВРедактореJSONАнализируемогоЗапроса(Команда)
	УИ_ОбщегоНазначенияКлиент.РедактироватьJSON(ТелоЗапросаСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДвоичныеДанныеТелаЗапросаИзИстории(Команда)
	Если Не ЭтоАдресВременногоХранилища(ТелоЗапросаАдресДвоичныхДанных) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыСохранения = УИ_ОбщегоНазначенияКлиент.НовыйПараметрыСохраненияФайла();
	ПараметрыСохранения.АдресФайлаВоВременномХранилище = ТелоЗапросаАдресДвоичныхДанных;

	УИ_ОбщегоНазначенияКлиент.НачатьСохранениеФайла(ПараметрыСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКуки(Команда)
	СписокКуки = Новый Массив;
	Для Каждого СтрокаКуки Из Куки Цикл
		СписокКуки.Добавить(ОписаниеКуки(СтрокаКуки));
	КонецЦикла;
	ПараметрыОткрытия = Новый Структура("Куки, ТолькоПросмотр", СписокКуки, Истина);
	ОткрытьФорму("Обработка.УИ_КонсольHTTPЗапросов.Форма.ФормаУправленияКуки",
				 ПараметрыОткрытия,
				 ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаголовокНастроекПроксиПоПараметрам()

	Если ИспользоватьПрокси Тогда
		ЗаголовокГруппыПрокси = ПроксиСервер;
		Если ЗначениеЗаполнено(ПроксиПорт) Тогда
			ЗаголовокГруппыПрокси = ЗаголовокГруппыПрокси + ":" + Формат(ПроксиПорт, "ЧГ=0;");
		КонецЕсли;

		Если ПроксиАутентификацияОС Тогда
			ЗаголовокГруппыПрокси = ЗаголовокГруппыПрокси + "; Аутентификация ОС";
		ИначеЕсли ЗначениеЗаполнено(ПроксиПользователь) Тогда
			ЗаголовокГруппыПрокси = ЗаголовокГруппыПрокси + ";" + ПроксиПользователь;
		КонецЕсли;
	Иначе
		ЗаголовокГруппыПрокси = НСтр("ru = 'Не используется'");
	КонецЕсли;

	Возврат ЗаголовокГруппыПрокси;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеКуки(СтрокаКуки)
	
	Результат = Новый Структура;
	Результат.Вставить("Ключ", СтрокаКуки.Ключ);
	Результат.Вставить("Значение", СтрокаКуки.Значение);
	Результат.Вставить("Домен", СтрокаКуки.Домен);
	Результат.Вставить("Путь", СтрокаКуки.Путь);
	Результат.Вставить("ДействуетДо", СтрокаКуки.ДействуетДо);
	Результат.Вставить("ТолькоЗащищенноеСоединение", СтрокаКуки.ТолькоЗащищенноеСоединение);
	Результат.Вставить("ТолькоHTTPЗапросы", СтрокаКуки.ТолькоHTTPЗапросы);
	Результат.Вставить("ТолькоДляДомена", СтрокаКуки.ТолькоДляДомена);
	Возврат Результат;
	
КонецФункции

#КонецОбласти
